stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/* ================================================================================================================== */
/* ================                     Processor and Core Peripheral Section                        ================ */
/* ================================================================================================================== */
/* -------  Start of section using anonymous unions and disabling warnings  ------- */
#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/* --------  Configuration of the Cortex-M33 Processor and Core Peripherals  ------ */
#define __CM33_REV                      0x0000U   /* Core revision r0p4 */
#define __SAUREGION_PRESENT             1U        /* SAU regions present */
#define __MPU_PRESENT                   1U        /* MPU present */
#define __VTOR_PRESENT                  1U        /* VTOR present */
#define __NVIC_PRIO_BITS                4U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig          0U        /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT                   1U        /* FPU present */
#define __DSP_PRESENT                   1U        /* DSP extension present */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm33.h"                            /*!< ARM Cortex-M33 processor and core peripherals */
#include "system_stm32u3xx.h"                     /*!< STM32U3xx System */


/* ================================================================================================================== */
/* ================                     Device Specific Peripheral Section                           ================ */
/* ================================================================================================================== */
/** @addtogroup STM32U3xx_peripherals
  * @{
  */

/**
  * @brief ADC Analog to Digital Converter
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< ADC interrupt and status register,                        Address offset: 0x00 */
  __IO uint32_t IER;              /*!< ADC interrupt enable register,                            Address offset: 0x04 */
  __IO uint32_t CR;               /*!< ADC control register,                                     Address offset: 0x08 */
  __IO uint32_t CFGR1;            /*!< ADC configuration register 1,                             Address offset: 0x0C */
  __IO uint32_t CFGR2;            /*!< ADC configuration register 2,                             Address offset: 0x10 */
  __IO uint32_t SMPR1;            /*!< ADC sample time register 1,                               Address offset: 0x14 */
  __IO uint32_t SMPR2;            /*!< ADC sample time register 2,                               Address offset: 0x18 */
  __IO uint32_t PCSEL;            /*!< ADC channel preselection register,                        Address offset: 0x1C */
  uint32_t      RESERVED1[4];     /*!< Reserved,                                                 Address offset: 0x20 */
  __IO uint32_t SQR1;             /*!< ADC regular sequence register 1,                          Address offset: 0x30 */
  __IO uint32_t SQR2;             /*!< ADC regular sequence register 2,                          Address offset: 0x34 */
  __IO uint32_t SQR3;             /*!< ADC regular sequence register 3,                          Address offset: 0x38 */
  __IO uint32_t SQR4;             /*!< ADC regular sequence register 4,                          Address offset: 0x3C */
  __IO uint32_t DR;               /*!< ADC regular data register,                                Address offset: 0x40 */
  uint32_t      RESERVED2[2];     /*!< Reserved,                                                 Address offset: 0x44 */
  __IO uint32_t JSQR;             /*!< ADC injected sequence register,                           Address offset: 0x4C */
  __IO uint32_t OFCFGR1;          /*!< ADC offset configuration register 1,                      Address offset: 0x50 */
  __IO uint32_t OFCFGR2;          /*!< ADC offset configuration register 2,                      Address offset: 0x54 */
  __IO uint32_t OFCFGR3;          /*!< ADC offset configuration register 3,                      Address offset: 0x58 */
  __IO uint32_t OFCFGR4;          /*!< ADC offset configuration register 4,                      Address offset: 0x5C */
  __IO uint32_t OFR1;             /*!< ADC offset register 1,                                    Address offset: 0x60 */
  __IO uint32_t OFR2;             /*!< ADC offset register 2,                                    Address offset: 0x64 */
  __IO uint32_t OFR3;             /*!< ADC offset register 3,                                    Address offset: 0x68 */
  __IO uint32_t OFR4;             /*!< ADC offset register 4,                                    Address offset: 0x6C */
  __IO uint32_t GCOMP;            /*!< ADC gain compensation register,                           Address offset: 0x70 */
  uint32_t      RESERVED3[3];     /*!< Reserved,                                                 Address offset: 0x74 */
  __IO uint32_t JDR1;             /*!< ADC injected data register 1,                             Address offset: 0x80 */
  __IO uint32_t JDR2;             /*!< ADC injected data register 2,                             Address offset: 0x84 */
  __IO uint32_t JDR3;             /*!< ADC injected data register 3,                             Address offset: 0x88 */
  __IO uint32_t JDR4;             /*!< ADC injected data register 4,                             Address offset: 0x8C */
  uint32_t      RESERVED4[4];     /*!< Reserved,                                                 Address offset: 0x90 */
  __IO uint32_t AWD2CR;           /*!< ADC analog watchdog 2 configuration register,             Address offset: 0xA0 */
  __IO uint32_t AWD3CR;           /*!< ADC analog watchdog 3 configuration register,             Address offset: 0xA4 */
  __IO uint32_t AWD1LTR;          /*!< ADC analog watchdog 1 low threshold register,             Address offset: 0xA8 */
  __IO uint32_t AWD1HTR;          /*!< ADC analog watchdog 1 high threshold register,            Address offset: 0xAC */
  __IO uint32_t AWD2LTR;          /*!< ADC analog watchdog 2 low threshold register,             Address offset: 0xB0 */
  __IO uint32_t AWD2HTR;          /*!< ADC analog watchdog 2 high threshold register,            Address offset: 0xB4 */
  __IO uint32_t AWD3LTR;          /*!< ADC analog watchdog 3 low threshold register,             Address offset: 0xB8 */
  __IO uint32_t AWD3HTR;          /*!< ADC analog watchdog 3 high threshold register,            Address offset: 0xBC */
  __IO uint32_t DIFSEL;           /*!< ADC differential mode selection register,                 Address offset: 0xC0 */
  __IO uint32_t CALFACT;          /*!< ADC calibration factors,                                  Address offset: 0xC4 */
  uint32_t      RESERVED5[2];     /*!< Reserved,                                                 Address offset: 0xC8 */
  __IO uint32_t OR;               /*!< ADC option register,                                      Address offset: 0xD0 */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CSR;              /*!< ADC common status register,                              Address offset: 0x300 */
  uint32_t RESERVED;              /*!< Reserved,                                                Address offset: 0x304 */
  __IO uint32_t CCR;              /*!< ADC common control register,                             Address offset: 0x308 */
  __IO uint32_t CDR;              /*!< ADC common regular data register for dual mode,          Address offset: 0x30C */
  __IO uint32_t CDR2;             /*!< ADC common regular data register for dual mode 32-bit,   Address offset: 0x310 */
} ADC_Common_TypeDef;


/**
  * @brief Comparator
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< Comparator control/status register  ,             Address offset: 0x00 */
} COMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR_ODD;          /*!< COMP control and status register located in register of comparator instance odd, used for bits common to several COMP instances, Address offset: 0x00 */
  __IO uint32_t CSR_EVEN;         /*!< COMP control and status register located in register of comparator instance even, used for bits common to several COMP instances, Address offset: 0x04 */
} COMP_Common_TypeDef;

/**
  * @brief CRC calculation unit
  */
typedef struct
{
  __IO uint32_t DR;               /*!< CRC Data register,                                   Address offset: 0x00 */
  __IO uint32_t IDR;              /*!< CRC Independent data register,                       Address offset: 0x04 */
  __IO uint32_t CR;               /*!< CRC Control register,                                Address offset: 0x08 */
       uint32_t RESERVED2;        /*!< Reserved,                                                            0x0C */
  __IO uint32_t INIT;             /*!< Initial CRC value register,                          Address offset: 0x10 */
  __IO uint32_t POL;              /*!< CRC polynomial register,                             Address offset: 0x14 */
} CRC_TypeDef;

/**
  * @brief Clock Recovery System
  */
typedef struct
{
__IO uint32_t CR;                 /*!< CRS ccontrol register,              Address offset: 0x00 */
__IO uint32_t CFGR;               /*!< CRS configuration register,         Address offset: 0x04 */
__IO uint32_t ISR;                /*!< CRS interrupt and status register,  Address offset: 0x08 */
__IO uint32_t ICR;                /*!< CRS interrupt flag clear register,  Address offset: 0x0C */
} CRS_TypeDef;

/**
  * @brief DAC
  */
typedef struct
{
  __IO uint32_t CR;               /*!< DAC control register,                                    Address offset: 0x00 */
  __IO uint32_t SWTRIGR;          /*!< DAC software trigger register,                           Address offset: 0x04 */
  __IO uint32_t DHR12R1;          /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
  __IO uint32_t DHR12L1;          /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
  __IO uint32_t DHR8R1;           /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
  __IO uint32_t DHR12R2;          /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
  __IO uint32_t DHR12L2;          /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
  __IO uint32_t DHR8R2;           /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
  __IO uint32_t DHR12RD;          /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
  __IO uint32_t DHR12LD;          /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
  __IO uint32_t DHR8RD;           /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
  __IO uint32_t DOR1;             /*!< DAC channel1 data output register,                       Address offset: 0x2C */
  __IO uint32_t DOR2;             /*!< DAC channel2 data output register,                       Address offset: 0x30 */
  __IO uint32_t SR;               /*!< DAC status register,                                     Address offset: 0x34 */
  __IO uint32_t CCR;              /*!< DAC calibration control register,                        Address offset: 0x38 */
  __IO uint32_t MCR;              /*!< DAC mode control register,                               Address offset: 0x3C */
  __IO uint32_t SHSR1;            /*!< DAC Sample and Hold sample time register 1,              Address offset: 0x40 */
  __IO uint32_t SHSR2;            /*!< DAC Sample and Hold sample time register 2,              Address offset: 0x44 */
  __IO uint32_t SHHR;             /*!< DAC Sample and Hold hold time register,                  Address offset: 0x48 */
  __IO uint32_t SHRR;             /*!< DAC Sample and Hold refresh time register,               Address offset: 0x4C */
  __IO uint32_t RESERVED[1];
  __IO uint32_t AUTOCR;           /*!< DAC Autonomous mode register,                         Address offset: 0x54 */
} DAC_TypeDef;

/**
  * @brief Debug MCU
  */
typedef struct
{
  __IO uint32_t IDCODE;           /*!< MCU device ID code,                 Address offset: 0x00 */
  __IO uint32_t CR;               /*!< Debug MCU configuration register,   Address offset: 0x04 */
  __IO uint32_t APB1FZR1;         /*!< Debug MCU APB1 freeze register 1,   Address offset: 0x08 */
  __IO uint32_t APB1FZR2;         /*!< Debug MCU APB1 freeze register 2,   Address offset: 0x0C */
  __IO uint32_t APB2FZR;          /*!< Debug MCU APB2 freeze register,     Address offset: 0x10 */
  __IO uint32_t APB3FZR;          /*!< Debug MCU APB3 freeze register,     Address offset: 0x14 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                    0x18 - 0x1C */
  __IO uint32_t AHB1FZR;          /*!< Debug MCU AHB1 freeze register,     Address offset: 0x20 */
       uint32_t RESERVED2;        /*!< Reserved,                                           0x24 */
  __IO uint32_t AHB3FZR;          /*!< Debug MCU AHB3 freeze register,     Address offset: 0x28 */
} DBGMCU_TypeDef;

/**
  * @ brief Delay Block
  */
typedef struct
{
  __IO uint32_t CR;   /*!< Delay Block Control Register,       Address offset: 0x00 */
  __IO uint32_t CFGR; /*!< Delay Block Configuration Register, Address offset: 0x04 */
} DLYB_TypeDef;

/**
  * @brief DMA Controller
  */
typedef struct
{
  __IO uint32_t SECCFGR;          /*!< DMA secure configuration register,               Address offset: 0x00  */
  __IO uint32_t PRIVCFGR;         /*!< DMA privileged configuration register,           Address offset: 0x04  */
  __IO uint32_t RCFGLOCKR;        /*!< DMA lock configuration register,                 Address offset: 0x08  */
  __IO uint32_t MISR;             /*!< DMA non secure masked interrupt status register, Address offset: 0x0C  */
  __IO uint32_t SMISR;            /*!< DMA secure masked interrupt status register,     Address offset: 0x10  */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t CLBAR;            /*!< DMA channel x linked-list base address register, Address offset: 0x50 + (x * 0x80) */
       uint32_t RESERVED1[2];     /*!< Reserved 1,                                      Address offset: 0x54 -- 0x58      */
  __IO uint32_t CFCR;             /*!< DMA channel x flag clear register,               Address offset: 0x5C + (x * 0x80) */
  __IO uint32_t CSR;              /*!< DMA channel x flag status register,              Address offset: 0x60 + (x * 0x80) */
  __IO uint32_t CCR;              /*!< DMA channel x control register,                  Address offset: 0x64 + (x * 0x80) */
       uint32_t RESERVED2[10];    /*!< Reserved 2,                                      Address offset: 0x68 -- 0x8C      */
  __IO uint32_t CTR1;             /*!< DMA channel x transfer register 1,               Address offset: 0x90 + (x * 0x80) */
  __IO uint32_t CTR2;             /*!< DMA channel x transfer register 2,               Address offset: 0x94 + (x * 0x80) */
  __IO uint32_t CBR1;             /*!< DMA channel x block register 1,                  Address offset: 0x98 + (x * 0x80) */
  __IO uint32_t CSAR;             /*!< DMA channel x source address register,           Address offset: 0x9C + (x * 0x80) */
  __IO uint32_t CDAR;             /*!< DMA channel x destination address register,      Address offset: 0xA0 + (x * 0x80) */
  __IO uint32_t CTR3;             /*!< DMA channel x transfer register 3,               Address offset: 0xA4 + (x * 0x80) */
  __IO uint32_t CBR2;             /*!< DMA channel x block register 2,                  Address offset: 0xA8 + (x * 0x80) */
       uint32_t RESERVED3[8];     /*!< Reserved 3,                                      Address offset: 0xAC -- 0xC8      */
  __IO uint32_t CLLR;             /*!< DMA channel x linked-list address register,      Address offset: 0xCC + (x * 0x80) */
} DMA_Channel_TypeDef;

/**
  * @brief Asynch Interrupt/Event Controller (EXTI)
  */
typedef struct
{
  __IO uint32_t RTSR1;            /*!< EXTI Rising Trigger Selection Register 1,        Address offset:   0x00 */
  __IO uint32_t FTSR1;            /*!< EXTI Falling Trigger Selection Register 1,       Address offset:   0x04 */
  __IO uint32_t SWIER1;           /*!< EXTI Software Interrupt event Register 1,        Address offset:   0x08 */
  __IO uint32_t RPR1;             /*!< EXTI Rising Pending Register 1,                  Address offset:   0x0C */
  __IO uint32_t FPR1;             /*!< EXTI Falling Pending Register 1,                 Address offset:   0x10 */
  __IO uint32_t SECCFGR1;         /*!< EXTI Security Configuration Register 1,          Address offset:   0x14 */
  __IO uint32_t PRIVCFGR1;        /*!< EXTI Privilege Configuration Register 1,         Address offset:   0x18 */
       uint32_t RESERVED1[17];    /*!< Reserved 1,                                                0x1C -- 0x5C */
  __IO uint32_t EXTICR[4];        /*!< EXIT External Interrupt Configuration Register,            0x60 -- 0x6C */
  __IO uint32_t LOCKR;            /*!< EXTI Lock Register,                              Address offset:   0x70 */
       uint32_t RESERVED2[3];     /*!< Reserved 2,                                                0x74 -- 0x7C */
  __IO uint32_t IMR1;             /*!< EXTI Interrupt Mask Register 1,                  Address offset:   0x80 */
  __IO uint32_t EMR1;             /*!< EXTI Event Mask Register 1,                      Address offset:   0x84 */
} EXTI_TypeDef;

/**
  * @brief FD Controller Area Network
  */
typedef struct
{
  __IO uint32_t CREL;             /*!< FDCAN Core Release register,                                     Address offset: 0x000 */
  __IO uint32_t ENDN;             /*!< FDCAN Endian register,                                           Address offset: 0x004 */
       uint32_t RESERVED1;        /*!< Reserved,                                                                        0x008 */
  __IO uint32_t DBTP;             /*!< FDCAN Data Bit Timing & Prescaler register,                      Address offset: 0x00C */
  __IO uint32_t TEST;             /*!< FDCAN Test register,                                             Address offset: 0x010 */
  __IO uint32_t RWD;              /*!< FDCAN RAM Watchdog register,                                     Address offset: 0x014 */
  __IO uint32_t CCCR;             /*!< FDCAN CC Control register,                                       Address offset: 0x018 */
  __IO uint32_t NBTP;             /*!< FDCAN Nominal Bit Timing & Prescaler register,                   Address offset: 0x01C */
  __IO uint32_t TSCC;             /*!< FDCAN Timestamp Counter Configuration register,                  Address offset: 0x020 */
  __IO uint32_t TSCV;             /*!< FDCAN Timestamp Counter Value register,                          Address offset: 0x024 */
  __IO uint32_t TOCC;             /*!< FDCAN Timeout Counter Configuration register,                    Address offset: 0x028 */
  __IO uint32_t TOCV;             /*!< FDCAN Timeout Counter Value register,                            Address offset: 0x02C */
       uint32_t RESERVED2[4];     /*!< Reserved,                                                                0x030 - 0x03C */
  __IO uint32_t ECR;              /*!< FDCAN Error Counter register,                                    Address offset: 0x040 */
  __IO uint32_t PSR;              /*!< FDCAN Protocol Status register,                                  Address offset: 0x044 */
  __IO uint32_t TDCR;             /*!< FDCAN Transmitter Delay Compensation register,                   Address offset: 0x048 */
       uint32_t RESERVED3;        /*!< Reserved,                                                                        0x04C */
  __IO uint32_t IR;               /*!< FDCAN Interrupt register,                                        Address offset: 0x050 */
  __IO uint32_t IE;               /*!< FDCAN Interrupt Enable register,                                 Address offset: 0x054 */
  __IO uint32_t ILS;              /*!< FDCAN Interrupt Line Select register,                            Address offset: 0x058 */
  __IO uint32_t ILE;              /*!< FDCAN Interrupt Line Enable register,                            Address offset: 0x05C */
       uint32_t RESERVED4[8];     /*!< Reserved,                                                                0x060 - 0x07C */
  __IO uint32_t RXGFC;            /*!< FDCAN Global Filter Configuration register,                      Address offset: 0x080 */
  __IO uint32_t XIDAM;            /*!< FDCAN Extended ID AND Mask register,                             Address offset: 0x084 */
  __IO uint32_t HPMS;             /*!< FDCAN High Priority Message Status register,                     Address offset: 0x088 */
       uint32_t RESERVED5;        /*!< Reserved,                                                                        0x08C */
  __IO uint32_t RXF0S;            /*!< FDCAN Rx FIFO 0 Status register,                                 Address offset: 0x090 */
  __IO uint32_t RXF0A;            /*!< FDCAN Rx FIFO 0 Acknowledge register,                            Address offset: 0x094 */
  __IO uint32_t RXF1S;            /*!< FDCAN Rx FIFO 1 Status register,                                 Address offset: 0x098 */
  __IO uint32_t RXF1A;            /*!< FDCAN Rx FIFO 1 Acknowledge register,                            Address offset: 0x09C */
       uint32_t RESERVED6[8];     /*!< Reserved,                                                                0x0A0 - 0x0BC */
  __IO uint32_t TXBC;             /*!< FDCAN Tx Buffer Configuration register,                          Address offset: 0x0C0 */
  __IO uint32_t TXFQS;            /*!< FDCAN Tx FIFO/Queue Status register,                             Address offset: 0x0C4 */
  __IO uint32_t TXBRP;            /*!< FDCAN Tx Buffer Request Pending register,                        Address offset: 0x0C8 */
  __IO uint32_t TXBAR;            /*!< FDCAN Tx Buffer Add Request register,                            Address offset: 0x0CC */
  __IO uint32_t TXBCR;            /*!< FDCAN Tx Buffer Cancellation Request register,                   Address offset: 0x0D0 */
  __IO uint32_t TXBTO;            /*!< FDCAN Tx Buffer Transmission Occurred register,                  Address offset: 0x0D4 */
  __IO uint32_t TXBCF;            /*!< FDCAN Tx Buffer Cancellation Finished register,                  Address offset: 0x0D8 */
  __IO uint32_t TXBTIE;           /*!< FDCAN Tx Buffer Transmission Interrupt Enable register,          Address offset: 0x0DC */
  __IO uint32_t TXBCIE;           /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register, Address offset: 0x0E0 */
  __IO uint32_t TXEFS;            /*!< FDCAN Tx Event FIFO Status register,                             Address offset: 0x0E4 */
  __IO uint32_t TXEFA;            /*!< FDCAN Tx Event FIFO Acknowledge register,                        Address offset: 0x0E8 */
} FDCAN_GlobalTypeDef;

