stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/******************  Bits definition for FLASH_BOOT0R register  ***************/
#define FLASH_BOOT0R_ADD_Pos                (7U)
#define FLASH_BOOT0R_ADD_Msk                (0x1FFFFFFUL << FLASH_BOOT0R_ADD_Pos)   /*!< 0xFFFFFF80 */
#define FLASH_BOOT0R_ADD                    FLASH_BOOT0R_ADD_Msk                    /*!< Non-secure boot base address 0 */

/******************  Bits definition for FLASH_BOOT1R register  ***************/
#define FLASH_BOOT1R_ADD_Pos                (7U)
#define FLASH_BOOT1R_ADD_Msk                (0x1FFFFFFUL << FLASH_BOOT1R_ADD_Pos)   /*!< 0xFFFFFF80 */
#define FLASH_BOOT1R_ADD                    FLASH_BOOT1R_ADD_Msk                    /*!< Non-secure boot base address 1 */

/******************  Bits definition for FLASH_SBOOT0R register  **************/
#define FLASH_SBOOT0R_BOOT_LOCK_Pos         (0U)
#define FLASH_SBOOT0R_BOOT_LOCK_Msk         (0x1UL << FLASH_SBOOT0R_BOOT_LOCK_Pos)  /*!< 0x00000001 */
#define FLASH_SBOOT0R_BOOT_LOCK             FLASH_SBOOT0R_BOOT_LOCK_Msk             /*!< Boot Lock */
#define FLASH_SBOOT0R_ADD_Pos               (7U)
#define FLASH_SBOOT0R_ADD_Msk               (0x1FFFFFFUL << FLASH_SBOOT0R_ADD_Pos)  /*!< 0xFFFFFF80 */
#define FLASH_SBOOT0R_ADD                   FLASH_SBOOT0R_ADD_Msk                   /*!< Secure boot base address 0 */

/*****************  Bits definition for FLASH_SECWM1R1 register  **************/
#define FLASH_SECWM1R1_SECWM1_STRT_Pos      (0U)
#define FLASH_SECWM1R1_SECWM1_STRT_Msk      (0xFFUL << FLASH_SECWM1R1_SECWM1_STRT_Pos) /*!< 0x000000FF */
#define FLASH_SECWM1R1_SECWM1_STRT          FLASH_SECWM1R1_SECWM1_STRT_Msk             /*!< Start page of first secure area */
#define FLASH_SECWM1R1_SECWM1_END_Pos       (16U)
#define FLASH_SECWM1R1_SECWM1_END_Msk       (0xFFUL << FLASH_SECWM1R1_SECWM1_END_Pos)  /*!< 0x00FF0000 */
#define FLASH_SECWM1R1_SECWM1_END           FLASH_SECWM1R1_SECWM1_END_Msk              /*!< End page of first secure area */

/*****************  Bits definition for FLASH_SECWM1R2 register  **************/
#define FLASH_SECWM1R2_HDP1_END_Pos         (16U)
#define FLASH_SECWM1R2_HDP1_END_Msk         (0xFFUL << FLASH_SECWM1R2_HDP1_END_Pos) /*!< 0x00FF0000 */
#define FLASH_SECWM1R2_HDP1_END             FLASH_SECWM1R2_HDP1_END_Msk             /*!< End page of first hide protection area */
#define FLASH_SECWM1R2_HDP1EN_Pos           (24U)
#define FLASH_SECWM1R2_HDP1EN_Msk           (0xFFUL << FLASH_SECWM1R2_HDP1EN_Pos)   /*!< 0xFF000000 */
#define FLASH_SECWM1R2_HDP1EN               FLASH_SECWM1R2_HDP1EN_Msk               /*!< Hide protection first area enable */

/******************  Bits definition for FLASH_WRP1AR register  ***************/
#define FLASH_WRP1AR_STRT_Pos               (0U)
#define FLASH_WRP1AR_STRT_Msk               (0xFFUL << FLASH_WRP1AR_STRT_Pos)       /*!< 0x000000FF */
#define FLASH_WRP1AR_STRT                   FLASH_WRP1AR_STRT_Msk                   /*!< Bank 1 WRP first area A start page */
#define FLASH_WRP1AR_END_Pos                (16U)
#define FLASH_WRP1AR_END_Msk                (0xFFUL << FLASH_WRP1AR_END_Pos)        /*!< 0x00FF0000 */
#define FLASH_WRP1AR_END                    FLASH_WRP1AR_END_Msk                    /*!< Bank 1 WRP first area A end page */
#define FLASH_WRP1AR_UNLOCK_Pos             (31U)
#define FLASH_WRP1AR_UNLOCK_Msk             (0x1UL << FLASH_WRP1AR_UNLOCK_Pos)      /*!< 0x80000000 */
#define FLASH_WRP1AR_UNLOCK                 FLASH_WRP1AR_UNLOCK_Msk                 /*!< Bank 1 WRP first area A unlock */

/******************  Bits definition for FLASH_WRP1BR register  ***************/
#define FLASH_WRP1BR_STRT_Pos               (0U)
#define FLASH_WRP1BR_STRT_Msk               (0xFFUL << FLASH_WRP1BR_STRT_Pos)       /*!< 0x000000FF */
#define FLASH_WRP1BR_STRT                   FLASH_WRP1BR_STRT_Msk                   /*!< Bank 1 WRP second area B start page */
#define FLASH_WRP1BR_END_Pos                (16U)
#define FLASH_WRP1BR_END_Msk                (0xFFUL << FLASH_WRP1BR_END_Pos)        /*!< 0x00FF0000 */
#define FLASH_WRP1BR_END                    FLASH_WRP1BR_END_Msk                    /*!< Bank 1 WRP second area B end page */
#define FLASH_WRP1BR_UNLOCK_Pos             (31U)
#define FLASH_WRP1BR_UNLOCK_Msk             (0x1UL << FLASH_WRP1BR_UNLOCK_Pos)      /*!< 0x80000000 */
#define FLASH_WRP1BR_UNLOCK                 FLASH_WRP1BR_UNLOCK_Msk                 /*!< Bank 1 WRP second area B unlock */

/*****************  Bits definition for FLASH_SECWM2R1 register  **************/
#define FLASH_SECWM2R1_SECWM2_STRT_Pos      (0U)
#define FLASH_SECWM2R1_SECWM2_STRT_Msk      (0xFFUL << FLASH_SECWM2R1_SECWM2_STRT_Pos) /*!< 0x000000FF */
#define FLASH_SECWM2R1_SECWM2_STRT          FLASH_SECWM2R1_SECWM2_STRT_Msk             /*!< Start page of second secure area */
#define FLASH_SECWM2R1_SECWM2_END_Pos       (16U)
#define FLASH_SECWM2R1_SECWM2_END_Msk       (0xFFUL << FLASH_SECWM2R1_SECWM2_END_Pos)  /*!< 0x00FF0000 */
#define FLASH_SECWM2R1_SECWM2_END           FLASH_SECWM2R1_SECWM2_END_Msk              /*!< End page of second secure area */

/*****************  Bits definition for FLASH_SECWM2R2 register  **************/
#define FLASH_SECWM2R2_HDP2_END_Pos         (16U)
#define FLASH_SECWM2R2_HDP2_END_Msk         (0xFFUL << FLASH_SECWM2R2_HDP2_END_Pos) /*!< 0x00FF0000 */
#define FLASH_SECWM2R2_HDP2_END             FLASH_SECWM2R2_HDP2_END_Msk             /*!< End page of hide protection second area */
#define FLASH_SECWM2R2_HDP2EN_Pos           (24U)
#define FLASH_SECWM2R2_HDP2EN_Msk           (0xFFUL << FLASH_SECWM2R2_HDP2EN_Pos)   /*!< 0xFF000000 */
#define FLASH_SECWM2R2_HDP2EN               FLASH_SECWM2R2_HDP2EN_Msk               /*!< Hide protection second area enable */

/******************  Bits definition for FLASH_WRP2AR register  ***************/
#define FLASH_WRP2AR_STRT_Pos               (0U)
#define FLASH_WRP2AR_STRT_Msk               (0xFFUL << FLASH_WRP2AR_STRT_Pos)       /*!< 0x000000FF */
#define FLASH_WRP2AR_STRT                   FLASH_WRP2AR_STRT_Msk                   /*!< Bank 2 WPR first area A start page */
#define FLASH_WRP2AR_END_Pos                (16U)
#define FLASH_WRP2AR_END_Msk                (0xFFUL << FLASH_WRP2AR_END_Pos)        /*!< 0x00FF0000 */
#define FLASH_WRP2AR_END                    FLASH_WRP2AR_END_Msk                    /*!< Bank 2 WPR first area A end page */
#define FLASH_WRP2AR_UNLOCK_Pos             (31U)
#define FLASH_WRP2AR_UNLOCK_Msk             (0x1UL << FLASH_WRP2AR_UNLOCK_Pos)      /*!< 0x80000000 */
#define FLASH_WRP2AR_UNLOCK                 FLASH_WRP2AR_UNLOCK_Msk                 /*!< Bank 2 WPR first area A unlock */

/******************  Bits definition for FLASH_WRP2BR register  ***************/
#define FLASH_WRP2BR_STRT_Pos               (0U)
#define FLASH_WRP2BR_STRT_Msk               (0xFFUL << FLASH_WRP2BR_STRT_Pos)       /*!< 0x000000FF */
#define FLASH_WRP2BR_STRT                   FLASH_WRP2BR_STRT_Msk                   /*!< Bank 2 WPR second area B start page */
#define FLASH_WRP2BR_END_Pos                (16U)
#define FLASH_WRP2BR_END_Msk                (0xFFUL << FLASH_WRP2BR_END_Pos)        /*!< 0x00FF0000 */
#define FLASH_WRP2BR_END                    FLASH_WRP2BR_END_Msk                    /*!< Bank 2 WPR second area B end page */
#define FLASH_WRP2BR_UNLOCK_Pos             (31U)
#define FLASH_WRP2BR_UNLOCK_Msk             (0x1UL << FLASH_WRP2BR_UNLOCK_Pos)      /*!< 0x80000000 */
#define FLASH_WRP2BR_UNLOCK                 FLASH_WRP2BR_UNLOCK_Msk                 /*!< Bank 2 WPR second area B unlock */

/*******************  Bit definition for FLASH_SECBB1R1 register  ******************/
#define FLASH_SECBB1R1_SEC0_Pos                   (0U)
#define FLASH_SECBB1R1_SEC0_Msk                   (0x1UL << FLASH_SECBB1R1_SEC0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB1R1_SEC0                       FLASH_SECBB1R1_SEC0_Msk                       /*!< Page 0 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC1_Pos                   (1U)
#define FLASH_SECBB1R1_SEC1_Msk                   (0x1UL << FLASH_SECBB1R1_SEC1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB1R1_SEC1                       FLASH_SECBB1R1_SEC1_Msk                       /*!< Page 1 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC2_Pos                   (2U)
#define FLASH_SECBB1R1_SEC2_Msk                   (0x1UL << FLASH_SECBB1R1_SEC2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB1R1_SEC2                       FLASH_SECBB1R1_SEC2_Msk                       /*!< Page 2 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC3_Pos                   (3U)
#define FLASH_SECBB1R1_SEC3_Msk                   (0x1UL << FLASH_SECBB1R1_SEC3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB1R1_SEC3                       FLASH_SECBB1R1_SEC3_Msk                       /*!< Page 3 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC4_Pos                   (4U)
#define FLASH_SECBB1R1_SEC4_Msk                   (0x1UL << FLASH_SECBB1R1_SEC4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB1R1_SEC4                       FLASH_SECBB1R1_SEC4_Msk                       /*!< Page 4 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC5_Pos                   (5U)
#define FLASH_SECBB1R1_SEC5_Msk                   (0x1UL << FLASH_SECBB1R1_SEC5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB1R1_SEC5                       FLASH_SECBB1R1_SEC5_Msk                       /*!< Page 5 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC6_Pos                   (6U)
#define FLASH_SECBB1R1_SEC6_Msk                   (0x1UL << FLASH_SECBB1R1_SEC6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB1R1_SEC6                       FLASH_SECBB1R1_SEC6_Msk                       /*!< Page 6 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC7_Pos                   (7U)
#define FLASH_SECBB1R1_SEC7_Msk                   (0x1UL << FLASH_SECBB1R1_SEC7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB1R1_SEC7                       FLASH_SECBB1R1_SEC7_Msk                       /*!< Page 7 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC8_Pos                   (8U)
#define FLASH_SECBB1R1_SEC8_Msk                   (0x1UL << FLASH_SECBB1R1_SEC8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB1R1_SEC8                       FLASH_SECBB1R1_SEC8_Msk                       /*!< Page 8 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC9_Pos                   (9U)
#define FLASH_SECBB1R1_SEC9_Msk                   (0x1UL << FLASH_SECBB1R1_SEC9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB1R1_SEC9                       FLASH_SECBB1R1_SEC9_Msk                       /*!< Page 9 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC10_Pos                  (10U)
#define FLASH_SECBB1R1_SEC10_Msk                  (0x1UL << FLASH_SECBB1R1_SEC10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB1R1_SEC10                      FLASH_SECBB1R1_SEC10_Msk                      /*!< Page 10 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC11_Pos                  (11U)
#define FLASH_SECBB1R1_SEC11_Msk                  (0x1UL << FLASH_SECBB1R1_SEC11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB1R1_SEC11                      FLASH_SECBB1R1_SEC11_Msk                      /*!< Page 11 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC12_Pos                  (12U)
#define FLASH_SECBB1R1_SEC12_Msk                  (0x1UL << FLASH_SECBB1R1_SEC12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB1R1_SEC12                      FLASH_SECBB1R1_SEC12_Msk                      /*!< Page 12 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC13_Pos                  (13U)
#define FLASH_SECBB1R1_SEC13_Msk                  (0x1UL << FLASH_SECBB1R1_SEC13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB1R1_SEC13                      FLASH_SECBB1R1_SEC13_Msk                      /*!< Page 13 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC14_Pos                  (14U)
#define FLASH_SECBB1R1_SEC14_Msk                  (0x1UL << FLASH_SECBB1R1_SEC14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB1R1_SEC14                      FLASH_SECBB1R1_SEC14_Msk                      /*!< Page 14 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC15_Pos                  (15U)
#define FLASH_SECBB1R1_SEC15_Msk                  (0x1UL << FLASH_SECBB1R1_SEC15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB1R1_SEC15                      FLASH_SECBB1R1_SEC15_Msk                      /*!< Page 15 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC16_Pos                  (16U)
#define FLASH_SECBB1R1_SEC16_Msk                  (0x1UL << FLASH_SECBB1R1_SEC16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB1R1_SEC16                      FLASH_SECBB1R1_SEC16_Msk                      /*!< Page 16 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC17_Pos                  (17U)
#define FLASH_SECBB1R1_SEC17_Msk                  (0x1UL << FLASH_SECBB1R1_SEC17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB1R1_SEC17                      FLASH_SECBB1R1_SEC17_Msk                      /*!< Page 17 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC18_Pos                  (18U)
#define FLASH_SECBB1R1_SEC18_Msk                  (0x1UL << FLASH_SECBB1R1_SEC18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB1R1_SEC18                      FLASH_SECBB1R1_SEC18_Msk                      /*!< Page 18 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC19_Pos                  (19U)
#define FLASH_SECBB1R1_SEC19_Msk                  (0x1UL << FLASH_SECBB1R1_SEC19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB1R1_SEC19                      FLASH_SECBB1R1_SEC19_Msk                      /*!< Page 19 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC20_Pos                  (20U)
#define FLASH_SECBB1R1_SEC20_Msk                  (0x1UL << FLASH_SECBB1R1_SEC20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB1R1_SEC20                      FLASH_SECBB1R1_SEC20_Msk                      /*!< Page 20 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC21_Pos                  (21U)
#define FLASH_SECBB1R1_SEC21_Msk                  (0x1UL << FLASH_SECBB1R1_SEC21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB1R1_SEC21                      FLASH_SECBB1R1_SEC21_Msk                      /*!< Page 21 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC22_Pos                  (22U)
#define FLASH_SECBB1R1_SEC22_Msk                  (0x1UL << FLASH_SECBB1R1_SEC22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB1R1_SEC22                      FLASH_SECBB1R1_SEC22_Msk                      /*!< Page 22 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC23_Pos                  (23U)
#define FLASH_SECBB1R1_SEC23_Msk                  (0x1UL << FLASH_SECBB1R1_SEC23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB1R1_SEC23                      FLASH_SECBB1R1_SEC23_Msk                      /*!< Page 23 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC24_Pos                  (24U)
#define FLASH_SECBB1R1_SEC24_Msk                  (0x1UL << FLASH_SECBB1R1_SEC24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB1R1_SEC24                      FLASH_SECBB1R1_SEC24_Msk                      /*!< Page 24 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC25_Pos                  (25U)
#define FLASH_SECBB1R1_SEC25_Msk                  (0x1UL << FLASH_SECBB1R1_SEC25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB1R1_SEC25                      FLASH_SECBB1R1_SEC25_Msk                      /*!< Page 25 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC26_Pos                  (26U)
#define FLASH_SECBB1R1_SEC26_Msk                  (0x1UL << FLASH_SECBB1R1_SEC26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB1R1_SEC26                      FLASH_SECBB1R1_SEC26_Msk                      /*!< Page 26 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC27_Pos                  (27U)
#define FLASH_SECBB1R1_SEC27_Msk                  (0x1UL << FLASH_SECBB1R1_SEC27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB1R1_SEC27                      FLASH_SECBB1R1_SEC27_Msk                      /*!< Page 27 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC28_Pos                  (28U)
#define FLASH_SECBB1R1_SEC28_Msk                  (0x1UL << FLASH_SECBB1R1_SEC28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB1R1_SEC28                      FLASH_SECBB1R1_SEC28_Msk                      /*!< Page 28 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC29_Pos                  (29U)
#define FLASH_SECBB1R1_SEC29_Msk                  (0x1UL << FLASH_SECBB1R1_SEC29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB1R1_SEC29                      FLASH_SECBB1R1_SEC29_Msk                      /*!< Page 29 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC30_Pos                  (30U)
#define FLASH_SECBB1R1_SEC30_Msk                  (0x1UL << FLASH_SECBB1R1_SEC30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB1R1_SEC30                      FLASH_SECBB1R1_SEC30_Msk                      /*!< Page 30 in bank 1 block-based secure */
#define FLASH_SECBB1R1_SEC31_Pos                  (31U)
#define FLASH_SECBB1R1_SEC31_Msk                  (0x1UL << FLASH_SECBB1R1_SEC31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB1R1_SEC31                      FLASH_SECBB1R1_SEC31_Msk                      /*!< Page 31 in bank 1 block-based secure */

