stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/******************  Bits definition for HASH_STR register  *******************/
#define HASH_STR_NBLW_Pos                   (0U)
#define HASH_STR_NBLW_Msk                   (0x1FUL << HASH_STR_NBLW_Pos)           /*!< 0x0000001F */
#define HASH_STR_NBLW                       HASH_STR_NBLW_Msk
#define HASH_STR_NBLW_0                     (0x01UL << HASH_STR_NBLW_Pos)           /*!< 0x00000001 */
#define HASH_STR_NBLW_1                     (0x02UL << HASH_STR_NBLW_Pos)           /*!< 0x00000002 */
#define HASH_STR_NBLW_2                     (0x04UL << HASH_STR_NBLW_Pos)           /*!< 0x00000004 */
#define HASH_STR_NBLW_3                     (0x08UL << HASH_STR_NBLW_Pos)           /*!< 0x00000008 */
#define HASH_STR_NBLW_4                     (0x10UL << HASH_STR_NBLW_Pos)           /*!< 0x00000010 */
#define HASH_STR_DCAL_Pos                   (8U)
#define HASH_STR_DCAL_Msk                   (0x1UL << HASH_STR_DCAL_Pos)            /*!< 0x00000100 */
#define HASH_STR_DCAL                       HASH_STR_DCAL_Msk

/******************  Bits definition for HASH_SHA3CFGR register  ********************/
#define HASH_SHA3CFGR_PADBYTE_Pos           (0U)
#define HASH_SHA3CFGR_PADBYTE_Msk           (0xFFUL << HASH_SHA3CFGR_PADBYTE_Pos)            /*!< 0x000000FF */
#define HASH_SHA3CFGR_PADBYTE               HASH_SHA3CFGR_PADBYTE_Msk
#define HASH_SHA3CFGR_PADCONFIG_Pos         (8U)
#define HASH_SHA3CFGR_PADCONFIG_Msk         (0x1UL << HASH_SHA3CFGR_PADCONFIG_Pos)             /*!< 0x00000100 */
#define HASH_SHA3CFGR_PADCONFIG             HASH_SHA3CFGR_PADCONFIG_Msk
#define HASH_SHA3CFGR_START_RND_Pos         (9U)
#define HASH_SHA3CFGR_START_RND_Msk         (0x1FUL << HASH_SHA3CFGR_START_RND_Pos)             /*!< 0x00003E00 */
#define HASH_SHA3CFGR_START_RND             HASH_SHA3CFGR_START_RND_Msk
#define HASH_SHA3CFGR_END_RND_Pos           (14U)
#define HASH_SHA3CFGR_END_RND_Msk           (0x1FUL << HASH_SHA3CFGR_END_RND_Pos)             /*!< 0x0007C000 */
#define HASH_SHA3CFGR_END_RND               HASH_SHA3CFGR_END_RND_Msk
#define HASH_SHA3CFGR_IN_RATE_Pos           (19U)
#define HASH_SHA3CFGR_IN_RATE_Msk           (0x1FUL << HASH_SHA3CFGR_IN_RATE_Pos)             /*!< 0x0F80000 */
#define HASH_SHA3CFGR_IN_RATE               HASH_SHA3CFGR_IN_RATE_Msk

/******************  Bits definition for HASH_IMR register  *******************/
#define HASH_IMR_DINIE_Pos                  (0U)
#define HASH_IMR_DINIE_Msk                  (0x1UL << HASH_IMR_DINIE_Pos)           /*!< 0x00000001 */
#define HASH_IMR_DINIE                      HASH_IMR_DINIE_Msk
#define HASH_IMR_DCIE_Pos                   (1U)
#define HASH_IMR_DCIE_Msk                   (0x1UL << HASH_IMR_DCIE_Pos)            /*!< 0x00000002 */
#define HASH_IMR_DCIE                       HASH_IMR_DCIE_Msk

/******************  Bits definition for HASH_SR register  ********************/
#define HASH_SR_DINIS_Pos                   (0U)
#define HASH_SR_DINIS_Msk                   (0x1UL << HASH_SR_DINIS_Pos)            /*!< 0x00000001 */
#define HASH_SR_DINIS                       HASH_SR_DINIS_Msk
#define HASH_SR_DCIS_Pos                    (1U)
#define HASH_SR_DCIS_Msk                    (0x1UL << HASH_SR_DCIS_Pos)             /*!< 0x00000002 */
#define HASH_SR_DCIS                        HASH_SR_DCIS_Msk
#define HASH_SR_DMAS_Pos                    (2U)
#define HASH_SR_DMAS_Msk                    (0x1UL << HASH_SR_DMAS_Pos)             /*!< 0x00000004 */
#define HASH_SR_DMAS                        HASH_SR_DMAS_Msk
#define HASH_SR_BUSY_Pos                    (3U)
#define HASH_SR_BUSY_Msk                    (0x1UL << HASH_SR_BUSY_Pos)             /*!< 0x00000008 */
#define HASH_SR_BUSY                        HASH_SR_BUSY_Msk
#define HASH_SR_NBWP_Pos                    (9U)
#define HASH_SR_NBWP_Msk                    (0x3FUL << HASH_SR_NBWP_Pos)             /*!< 0x00007E00 */
#define HASH_SR_NBWP                        HASH_SR_NBWP_Msk
#define HASH_SR_DINNE_Pos                   (15U)
#define HASH_SR_DINNE_Msk                   (0x1UL << HASH_SR_DINNE_Pos)            /*!< 0x00008000 */
#define HASH_SR_DINNE                       HASH_SR_DINNE_Msk
#define HASH_SR_NBWE_Pos                    (16U)
#define HASH_SR_NBWE_Msk                    (0x3FUL << HASH_SR_NBWE_Pos)             /*!< 0x000F0000 */
#define HASH_SR_NBWE                        HASH_SR_NBWE_Msk

/******************************************************************************/
/*                                                                            */
/*                      Hardware Signal Processor (HSP)                       */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for HSP_CR register  ********************/
/*!< BOOTEN configuration */
#define HSP_CR_BOOTEN_Pos    (0U)
#define HSP_CR_BOOTEN_Msk    (0x1UL << HSP_CR_BOOTEN_Pos)    /*!< 0x00000001 */
#define HSP_CR_BOOTEN        HSP_CR_BOOTEN_Msk               /*!< BOOTEN (Boot Enable control) */
/*!< CTRLCGDIS configuration */
#define HSP_CR_CTRLCGDIS_Pos (4U)
#define HSP_CR_CTRLCGDIS_Msk (0x1UL << HSP_CR_CTRLCGDIS_Pos) /*!< 0x00000010 */
#define HSP_CR_CTRLCGDIS     HSP_CR_CTRLCGDIS_Msk            /*!< CTRLCGDIS (HSP_CTRL clock gating disable) */
/*!< MMCCGDIS configuration */
#define HSP_CR_MMCCGDIS_Pos  (6U)
#define HSP_CR_MMCCGDIS_Msk  (0x1UL << HSP_CR_MMCCGDIS_Pos)  /*!< 0x00000040 */
#define HSP_CR_MMCCGDIS      HSP_CR_MMCCGDIS_Msk             /*!< MMCCGDIS (MMC clock gating disable) */
/*!< SPECGDIS configuration */
#define HSP_CR_SPECGDIS_Pos  (7U)
#define HSP_CR_SPECGDIS_Msk  (0x1UL << HSP_CR_SPECGDIS_Pos)  /*!< 0x00000080 */
#define HSP_CR_SPECGDIS      HSP_CR_SPECGDIS_Msk             /*!< SPECGDIS (SPE clock gating disable) */
/*!< DCMDEVEN configuration */
#define HSP_CR_DCMDEVEN_Pos  (12U)
#define HSP_CR_DCMDEVEN_Msk  (0x1UL << HSP_CR_DCMDEVEN_Pos)  /*!< 0x00001000 */
#define HSP_CR_DCMDEVEN      HSP_CR_DCMDEVEN_Msk             /*!< DCMDEVEN (Direct command event enable) */
/*!< CDRLCK configuration */
#define HSP_CR_CDRLCK_Pos    (13U)
#define HSP_CR_CDRLCK_Msk    (0x3UL << HSP_CR_CDRLCK_Pos)    /*!< 0x00006000 */
#define HSP_CR_CDRLCK        HSP_CR_CDRLCK_Msk               /*!< CDRLCK[1:0] bits (CRAM & DRAM lock access control) */
#define HSP_CR_CDRLCK_0      (0x1UL << HSP_CR_CDRLCK_Pos)    /*!< 0x00002000 */
#define HSP_CR_CDRLCK_1      (0x2UL << HSP_CR_CDRLCK_Pos)    /*!< 0x00004000 */
/*!< REGLCK configuration */
#define HSP_CR_REGLCK_Pos    (15U)
#define HSP_CR_REGLCK_Msk    (0x1UL << HSP_CR_REGLCK_Pos)    /*!< 0x00008000 */
#define HSP_CR_REGLCK        HSP_CR_REGLCK_Msk               /*!< REGLCK (Register write lock access control) */
/*!< RSTREQ configuration */
#define HSP_CR_RSTREQ_Pos    (16U)
#define HSP_CR_RSTREQ_Msk    (0x1UL << HSP_CR_RSTREQ_Pos)    /*!< 0x00010000 */
#define HSP_CR_RSTREQ        HSP_CR_RSTREQ_Msk               /*!< RSTREQ (Reset request) */
/*!< RSTOK configuration */
#define HSP_CR_RSTOK_Pos     (17U)
#define HSP_CR_RSTOK_Msk     (0x1UL << HSP_CR_RSTOK_Pos)     /*!< 0x00020000 */
#define HSP_CR_RSTOK         HSP_CR_RSTOK_Msk                /*!< RSTOK (Reset request accepted) */
/*!< BARB configuration */
#define HSP_CR_BARB_Pos      (24U)
#define HSP_CR_BARB_Msk      (0x3UL << HSP_CR_BARB_Pos)      /*!< 0x03000000 */
#define HSP_CR_BARB          HSP_CR_BARB_Msk                 /*!< BARB[1:0] bits (BRAM Arbitration) */
#define HSP_CR_BARB_0        (0x1UL << HSP_CR_BARB_Pos)      /*!< 0x01000000 */
#define HSP_CR_BARB_1        (0x2UL << HSP_CR_BARB_Pos)      /*!< 0x02000000 */
/*!< BSTAT configuration */
#define HSP_CR_BSTAT_Pos     (28U)
#define HSP_CR_BSTAT_Msk     (0xFUL << HSP_CR_BSTAT_Pos)     /*!< 0xF0000000 */
#define HSP_CR_BSTAT         HSP_CR_BSTAT_Msk                /*!< BSTAT[3:0] bits (Boot status) */
#define HSP_CR_BSTAT_0       (0x01UL << HSP_CR_BSTAT_Pos)    /*!< 0x10000000 */
#define HSP_CR_BSTAT_1       (0x02UL << HSP_CR_BSTAT_Pos)    /*!< 0x20000000 */
#define HSP_CR_BSTAT_2       (0x04UL << HSP_CR_BSTAT_Pos)    /*!< 0x40000000 */
#define HSP_CR_BSTAT_3       (0x08UL << HSP_CR_BSTAT_Pos)    /*!< 0x80000000 */

/********************  Bit definition for HSP_OR register  ********************/
/*!< OPTION configuration */
#define HSP_OR_OPTION_Pos (0U)
#define HSP_OR_OPTION_Msk (0xFFFFFFFFUL << HSP_OR_OPTION_Pos) /*!< 0xFFFFFFFF */
#define HSP_OR_OPTION     HSP_OR_OPTION_Msk                   /*!< OPTION[31:0] bits (Option control bits) */
#define HSP_OR_OPTION_0   (0x00001UL << HSP_OR_OPTION_Pos)    /*!< 0x00000001 */
#define HSP_OR_OPTION_1   (0x00002UL << HSP_OR_OPTION_Pos)    /*!< 0x00000002 */
#define HSP_OR_OPTION_2   (0x00004UL << HSP_OR_OPTION_Pos)    /*!< 0x00000004 */
#define HSP_OR_OPTION_3   (0x00008UL << HSP_OR_OPTION_Pos)    /*!< 0x00000008 */
#define HSP_OR_OPTION_4   (0x00010UL << HSP_OR_OPTION_Pos)    /*!< 0x00000010 */
#define HSP_OR_OPTION_5   (0x00020UL << HSP_OR_OPTION_Pos)    /*!< 0x00000020 */
#define HSP_OR_OPTION_6   (0x00040UL << HSP_OR_OPTION_Pos)    /*!< 0x00000040 */
#define HSP_OR_OPTION_7   (0x00080UL << HSP_OR_OPTION_Pos)    /*!< 0x00000080 */
#define HSP_OR_OPTION_8   (0x00100UL << HSP_OR_OPTION_Pos)    /*!< 0x00000100 */
#define HSP_OR_OPTION_9   (0x00200UL << HSP_OR_OPTION_Pos)    /*!< 0x00000200 */
#define HSP_OR_OPTION_10  (0x00400UL << HSP_OR_OPTION_Pos)    /*!< 0x00000400 */
#define HSP_OR_OPTION_11  (0x00800UL << HSP_OR_OPTION_Pos)    /*!< 0x00000800 */
#define HSP_OR_OPTION_12  (0x01000UL << HSP_OR_OPTION_Pos)    /*!< 0x00001000 */
#define HSP_OR_OPTION_13  (0x02000UL << HSP_OR_OPTION_Pos)    /*!< 0x00002000 */
#define HSP_OR_OPTION_14  (0x04000UL << HSP_OR_OPTION_Pos)    /*!< 0x00004000 */
#define HSP_OR_OPTION_15  (0x08000UL << HSP_OR_OPTION_Pos)    /*!< 0x00008000 */
#define HSP_OR_OPTION_16  (0x10000UL << HSP_OR_OPTION_Pos)    /*!< 0x00010000 */
#define HSP_OR_OPTION_17  (0x20000UL << HSP_OR_OPTION_Pos)    /*!< 0x00020000 */
#define HSP_OR_OPTION_18  (0x40000UL << HSP_OR_OPTION_Pos)    /*!< 0x00040000 */
#define HSP_OR_OPTION_19  (0x80000UL << HSP_OR_OPTION_Pos)    /*!< 0x00080000 */
#define HSP_OR_OPTION_20  (0x100000UL << HSP_OR_OPTION_Pos)   /*!< 0x00100000 */
#define HSP_OR_OPTION_21  (0x200000UL << HSP_OR_OPTION_Pos)   /*!< 0x00200000 */
#define HSP_OR_OPTION_22  (0x400000UL << HSP_OR_OPTION_Pos)   /*!< 0x00400000 */
#define HSP_OR_OPTION_23  (0x800000UL << HSP_OR_OPTION_Pos)   /*!< 0x00800000 */
#define HSP_OR_OPTION_24  (0x1000000UL << HSP_OR_OPTION_Pos)  /*!< 0x01000000 */
#define HSP_OR_OPTION_25  (0x2000000UL << HSP_OR_OPTION_Pos)  /*!< 0x02000000 */
#define HSP_OR_OPTION_26  (0x4000000UL << HSP_OR_OPTION_Pos)  /*!< 0x04000000 */
#define HSP_OR_OPTION_27  (0x8000000UL << HSP_OR_OPTION_Pos)  /*!< 0x08000000 */
#define HSP_OR_OPTION_28  (0x10000000UL << HSP_OR_OPTION_Pos) /*!< 0x10000000 */
#define HSP_OR_OPTION_29  (0x20000000UL << HSP_OR_OPTION_Pos) /*!< 0x20000000 */
#define HSP_OR_OPTION_30  (0x40000000UL << HSP_OR_OPTION_Pos) /*!< 0x40000000 */
#define HSP_OR_OPTION_31  (0x80000000UL << HSP_OR_OPTION_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_C2HSEMR register  ********************/
/*!< C2HSEM configuration */
#define HSP_C2HSEMR_C2HSEM_Pos (0U)
#define HSP_C2HSEMR_C2HSEM_Msk (0x1UL << HSP_C2HSEMR_C2HSEM_Pos) /*!< 0x00000001 */
#define HSP_C2HSEMR_C2HSEM     HSP_C2HSEMR_C2HSEM_Msk            /*!< C2HSEM (CPU to HSP semaphore) */

/********************  Bit definition for HSP_C2HMSGDR register  ********************/
/*!< C2HDATA configuration */
#define HSP_C2HMSGDR_C2HDATA_Pos (0U)
#define HSP_C2HMSGDR_C2HDATA_Msk (0xFFFFFFFFUL << HSP_C2HMSGDR_C2HDATA_Pos) /*!< 0xFFFFFFFF */
#define HSP_C2HMSGDR_C2HDATA     HSP_C2HMSGDR_C2HDATA_Msk                   /*!< C2HDATA[31:0] bits (CPU Message for the HSP) */
#define HSP_C2HMSGDR_C2HDATA_0   (0x00001UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000001 */
#define HSP_C2HMSGDR_C2HDATA_1   (0x00002UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000002 */
#define HSP_C2HMSGDR_C2HDATA_2   (0x00004UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000004 */
#define HSP_C2HMSGDR_C2HDATA_3   (0x00008UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000008 */
#define HSP_C2HMSGDR_C2HDATA_4   (0x00010UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000010 */
#define HSP_C2HMSGDR_C2HDATA_5   (0x00020UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000020 */
#define HSP_C2HMSGDR_C2HDATA_6   (0x00040UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000040 */
#define HSP_C2HMSGDR_C2HDATA_7   (0x00080UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000080 */
#define HSP_C2HMSGDR_C2HDATA_8   (0x00100UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000100 */
#define HSP_C2HMSGDR_C2HDATA_9   (0x00200UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000200 */
#define HSP_C2HMSGDR_C2HDATA_10  (0x00400UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000400 */
#define HSP_C2HMSGDR_C2HDATA_11  (0x00800UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00000800 */
#define HSP_C2HMSGDR_C2HDATA_12  (0x01000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00001000 */
#define HSP_C2HMSGDR_C2HDATA_13  (0x02000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00002000 */
#define HSP_C2HMSGDR_C2HDATA_14  (0x04000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00004000 */
#define HSP_C2HMSGDR_C2HDATA_15  (0x08000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00008000 */
#define HSP_C2HMSGDR_C2HDATA_16  (0x10000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00010000 */
#define HSP_C2HMSGDR_C2HDATA_17  (0x20000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00020000 */
#define HSP_C2HMSGDR_C2HDATA_18  (0x40000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00040000 */
#define HSP_C2HMSGDR_C2HDATA_19  (0x80000UL << HSP_C2HMSGDR_C2HDATA_Pos)    /*!< 0x00080000 */
#define HSP_C2HMSGDR_C2HDATA_20  (0x100000UL << HSP_C2HMSGDR_C2HDATA_Pos)   /*!< 0x00100000 */
#define HSP_C2HMSGDR_C2HDATA_21  (0x200000UL << HSP_C2HMSGDR_C2HDATA_Pos)   /*!< 0x00200000 */
#define HSP_C2HMSGDR_C2HDATA_22  (0x400000UL << HSP_C2HMSGDR_C2HDATA_Pos)   /*!< 0x00400000 */
#define HSP_C2HMSGDR_C2HDATA_23  (0x800000UL << HSP_C2HMSGDR_C2HDATA_Pos)   /*!< 0x00800000 */
#define HSP_C2HMSGDR_C2HDATA_24  (0x1000000UL << HSP_C2HMSGDR_C2HDATA_Pos)  /*!< 0x01000000 */
#define HSP_C2HMSGDR_C2HDATA_25  (0x2000000UL << HSP_C2HMSGDR_C2HDATA_Pos)  /*!< 0x02000000 */
#define HSP_C2HMSGDR_C2HDATA_26  (0x4000000UL << HSP_C2HMSGDR_C2HDATA_Pos)  /*!< 0x04000000 */
#define HSP_C2HMSGDR_C2HDATA_27  (0x8000000UL << HSP_C2HMSGDR_C2HDATA_Pos)  /*!< 0x08000000 */
#define HSP_C2HMSGDR_C2HDATA_28  (0x10000000UL << HSP_C2HMSGDR_C2HDATA_Pos) /*!< 0x10000000 */
#define HSP_C2HMSGDR_C2HDATA_29  (0x20000000UL << HSP_C2HMSGDR_C2HDATA_Pos) /*!< 0x20000000 */
#define HSP_C2HMSGDR_C2HDATA_30  (0x40000000UL << HSP_C2HMSGDR_C2HDATA_Pos) /*!< 0x40000000 */
#define HSP_C2HMSGDR_C2HDATA_31  (0x80000000UL << HSP_C2HMSGDR_C2HDATA_Pos) /*!< 0x80000000 */

