stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_H2CSEMR register  ********************/
/*!< H2CSEM configuration */
#define HSP_H2CSEMR_H2CSEM_Pos (0U)
#define HSP_H2CSEMR_H2CSEM_Msk (0x1UL << HSP_H2CSEMR_H2CSEM_Pos) /*!< 0x00000001 */
#define HSP_H2CSEMR_H2CSEM     HSP_H2CSEMR_H2CSEM_Msk            /*!< H2CSEM (HSP to CPU semaphore) */

/********************  Bit definition for HSP_H2CMSGDR register  ********************/
/*!< H2CDATA configuration */
#define HSP_H2CMSGDR_H2CDATA_Pos (0U)
#define HSP_H2CMSGDR_H2CDATA_Msk (0xFFFFFFFFUL << HSP_H2CMSGDR_H2CDATA_Pos) /*!< 0xFFFFFFFF */
#define HSP_H2CMSGDR_H2CDATA     HSP_H2CMSGDR_H2CDATA_Msk                   /*!< H2CDATA[31:0] bits (HSP Message for the CPU) */
#define HSP_H2CMSGDR_H2CDATA_0   (0x00001UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000001 */
#define HSP_H2CMSGDR_H2CDATA_1   (0x00002UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000002 */
#define HSP_H2CMSGDR_H2CDATA_2   (0x00004UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000004 */
#define HSP_H2CMSGDR_H2CDATA_3   (0x00008UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000008 */
#define HSP_H2CMSGDR_H2CDATA_4   (0x00010UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000010 */
#define HSP_H2CMSGDR_H2CDATA_5   (0x00020UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000020 */
#define HSP_H2CMSGDR_H2CDATA_6   (0x00040UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000040 */
#define HSP_H2CMSGDR_H2CDATA_7   (0x00080UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000080 */
#define HSP_H2CMSGDR_H2CDATA_8   (0x00100UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000100 */
#define HSP_H2CMSGDR_H2CDATA_9   (0x00200UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000200 */
#define HSP_H2CMSGDR_H2CDATA_10  (0x00400UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000400 */
#define HSP_H2CMSGDR_H2CDATA_11  (0x00800UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00000800 */
#define HSP_H2CMSGDR_H2CDATA_12  (0x01000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00001000 */
#define HSP_H2CMSGDR_H2CDATA_13  (0x02000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00002000 */
#define HSP_H2CMSGDR_H2CDATA_14  (0x04000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00004000 */
#define HSP_H2CMSGDR_H2CDATA_15  (0x08000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00008000 */
#define HSP_H2CMSGDR_H2CDATA_16  (0x10000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00010000 */
#define HSP_H2CMSGDR_H2CDATA_17  (0x20000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00020000 */
#define HSP_H2CMSGDR_H2CDATA_18  (0x40000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00040000 */
#define HSP_H2CMSGDR_H2CDATA_19  (0x80000UL << HSP_H2CMSGDR_H2CDATA_Pos)    /*!< 0x00080000 */
#define HSP_H2CMSGDR_H2CDATA_20  (0x100000UL << HSP_H2CMSGDR_H2CDATA_Pos)   /*!< 0x00100000 */
#define HSP_H2CMSGDR_H2CDATA_21  (0x200000UL << HSP_H2CMSGDR_H2CDATA_Pos)   /*!< 0x00200000 */
#define HSP_H2CMSGDR_H2CDATA_22  (0x400000UL << HSP_H2CMSGDR_H2CDATA_Pos)   /*!< 0x00400000 */
#define HSP_H2CMSGDR_H2CDATA_23  (0x800000UL << HSP_H2CMSGDR_H2CDATA_Pos)   /*!< 0x00800000 */
#define HSP_H2CMSGDR_H2CDATA_24  (0x1000000UL << HSP_H2CMSGDR_H2CDATA_Pos)  /*!< 0x01000000 */
#define HSP_H2CMSGDR_H2CDATA_25  (0x2000000UL << HSP_H2CMSGDR_H2CDATA_Pos)  /*!< 0x02000000 */
#define HSP_H2CMSGDR_H2CDATA_26  (0x4000000UL << HSP_H2CMSGDR_H2CDATA_Pos)  /*!< 0x04000000 */
#define HSP_H2CMSGDR_H2CDATA_27  (0x8000000UL << HSP_H2CMSGDR_H2CDATA_Pos)  /*!< 0x08000000 */
#define HSP_H2CMSGDR_H2CDATA_28  (0x10000000UL << HSP_H2CMSGDR_H2CDATA_Pos) /*!< 0x10000000 */
#define HSP_H2CMSGDR_H2CDATA_29  (0x20000000UL << HSP_H2CMSGDR_H2CDATA_Pos) /*!< 0x20000000 */
#define HSP_H2CMSGDR_H2CDATA_30  (0x40000000UL << HSP_H2CMSGDR_H2CDATA_Pos) /*!< 0x40000000 */
#define HSP_H2CMSGDR_H2CDATA_31  (0x80000000UL << HSP_H2CMSGDR_H2CDATA_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_DCMDSR register  ********************/
/*!< DCBSY configuration */
#define HSP_DCMDSR_DCBSY_Pos (0U)
#define HSP_DCMDSR_DCBSY_Msk (0x1UL << HSP_DCMDSR_DCBSY_Pos) /*!< 0x00000001 */
#define HSP_DCMDSR_DCBSY     HSP_DCMDSR_DCBSY_Msk            /*!< DCBSY (Direct command busy flag) */

/********************  Bit definition for HSP_DCMDPTSR register  ********************/
/*!< PTRF0 configuration */
#define HSP_DCMDPTSR_PTRF0_Pos (0U)
#define HSP_DCMDPTSR_PTRF0_Msk (0x1UL << HSP_DCMDPTSR_PTRF0_Pos) /*!< 0x00000001 */
#define HSP_DCMDPTSR_PTRF0     HSP_DCMDPTSR_PTRF0_Msk            /*!< PTRF0 (Address pointer 0 flag) */
/*!< PTRF1 configuration */
#define HSP_DCMDPTSR_PTRF1_Pos (1U)
#define HSP_DCMDPTSR_PTRF1_Msk (0x1UL << HSP_DCMDPTSR_PTRF1_Pos) /*!< 0x00000002 */
#define HSP_DCMDPTSR_PTRF1     HSP_DCMDPTSR_PTRF1_Msk            /*!< PTRF1 (Address pointer 1 flag) */
/*!< PTRF2 configuration */
#define HSP_DCMDPTSR_PTRF2_Pos (2U)
#define HSP_DCMDPTSR_PTRF2_Msk (0x1UL << HSP_DCMDPTSR_PTRF2_Pos) /*!< 0x00000004 */
#define HSP_DCMDPTSR_PTRF2     HSP_DCMDPTSR_PTRF2_Msk            /*!< PTRF2 (Address pointer 2 flag) */
/*!< RDOG configuration */
#define HSP_DCMDPTSR_RDOG_Pos  (15U)
#define HSP_DCMDPTSR_RDOG_Msk  (0x1UL << HSP_DCMDPTSR_RDOG_Pos)  /*!< 0x00008000 */
#define HSP_DCMDPTSR_RDOG      HSP_DCMDPTSR_RDOG_Msk             /*!< RDOG (Read on-going indicator) */

/********************  Bit definition for HSP_DCMDIDR register  ********************/
/*!< CMDID configuration */
#define HSP_DCMDIDR_CMDID_Pos (0U)
#define HSP_DCMDIDR_CMDID_Msk (0xFFFFUL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x0000FFFF */
#define HSP_DCMDIDR_CMDID     HSP_DCMDIDR_CMDID_Msk               /*!< CMDID[15:0] bits (Command ID) */
#define HSP_DCMDIDR_CMDID_0   (0x0001UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000001 */
#define HSP_DCMDIDR_CMDID_1   (0x0002UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000002 */
#define HSP_DCMDIDR_CMDID_2   (0x0004UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000004 */
#define HSP_DCMDIDR_CMDID_3   (0x0008UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000008 */
#define HSP_DCMDIDR_CMDID_4   (0x0010UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000010 */
#define HSP_DCMDIDR_CMDID_5   (0x0020UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000020 */
#define HSP_DCMDIDR_CMDID_6   (0x0040UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000040 */
#define HSP_DCMDIDR_CMDID_7   (0x0080UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000080 */
#define HSP_DCMDIDR_CMDID_8   (0x0100UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000100 */
#define HSP_DCMDIDR_CMDID_9   (0x0200UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000200 */
#define HSP_DCMDIDR_CMDID_10  (0x0400UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000400 */
#define HSP_DCMDIDR_CMDID_11  (0x0800UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00000800 */
#define HSP_DCMDIDR_CMDID_12  (0x1000UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00001000 */
#define HSP_DCMDIDR_CMDID_13  (0x2000UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00002000 */
#define HSP_DCMDIDR_CMDID_14  (0x4000UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00004000 */
#define HSP_DCMDIDR_CMDID_15  (0x8000UL << HSP_DCMDIDR_CMDID_Pos) /*!< 0x00008000 */

/********************  Bit definition for HSP_DCMDPTR0 register  ********************/
/*!< PTCPU configuration */
#define HSP_DCMDPTR0_PTCPU_Pos (0U)
#define HSP_DCMDPTR0_PTCPU_Msk (0xFFFFFFFFUL << HSP_DCMDPTR0_PTCPU_Pos) /*!< 0xFFFFFFFF */
#define HSP_DCMDPTR0_PTCPU     HSP_DCMDPTR0_PTCPU_Msk                   /*!< PTCPU[31:0] bits (Address pointer value) */
#define HSP_DCMDPTR0_PTCPU_0   (0x00001UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000001 */
#define HSP_DCMDPTR0_PTCPU_1   (0x00002UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000002 */
#define HSP_DCMDPTR0_PTCPU_2   (0x00004UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000004 */
#define HSP_DCMDPTR0_PTCPU_3   (0x00008UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000008 */
#define HSP_DCMDPTR0_PTCPU_4   (0x00010UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000010 */
#define HSP_DCMDPTR0_PTCPU_5   (0x00020UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000020 */
#define HSP_DCMDPTR0_PTCPU_6   (0x00040UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000040 */
#define HSP_DCMDPTR0_PTCPU_7   (0x00080UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000080 */
#define HSP_DCMDPTR0_PTCPU_8   (0x00100UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000100 */
#define HSP_DCMDPTR0_PTCPU_9   (0x00200UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000200 */
#define HSP_DCMDPTR0_PTCPU_10  (0x00400UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000400 */
#define HSP_DCMDPTR0_PTCPU_11  (0x00800UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00000800 */
#define HSP_DCMDPTR0_PTCPU_12  (0x01000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00001000 */
#define HSP_DCMDPTR0_PTCPU_13  (0x02000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00002000 */
#define HSP_DCMDPTR0_PTCPU_14  (0x04000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00004000 */
#define HSP_DCMDPTR0_PTCPU_15  (0x08000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00008000 */
#define HSP_DCMDPTR0_PTCPU_16  (0x10000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00010000 */
#define HSP_DCMDPTR0_PTCPU_17  (0x20000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00020000 */
#define HSP_DCMDPTR0_PTCPU_18  (0x40000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00040000 */
#define HSP_DCMDPTR0_PTCPU_19  (0x80000UL << HSP_DCMDPTR0_PTCPU_Pos)    /*!< 0x00080000 */
#define HSP_DCMDPTR0_PTCPU_20  (0x100000UL << HSP_DCMDPTR0_PTCPU_Pos)   /*!< 0x00100000 */
#define HSP_DCMDPTR0_PTCPU_21  (0x200000UL << HSP_DCMDPTR0_PTCPU_Pos)   /*!< 0x00200000 */
#define HSP_DCMDPTR0_PTCPU_22  (0x400000UL << HSP_DCMDPTR0_PTCPU_Pos)   /*!< 0x00400000 */
#define HSP_DCMDPTR0_PTCPU_23  (0x800000UL << HSP_DCMDPTR0_PTCPU_Pos)   /*!< 0x00800000 */
#define HSP_DCMDPTR0_PTCPU_24  (0x1000000UL << HSP_DCMDPTR0_PTCPU_Pos)  /*!< 0x01000000 */
#define HSP_DCMDPTR0_PTCPU_25  (0x2000000UL << HSP_DCMDPTR0_PTCPU_Pos)  /*!< 0x02000000 */
#define HSP_DCMDPTR0_PTCPU_26  (0x4000000UL << HSP_DCMDPTR0_PTCPU_Pos)  /*!< 0x04000000 */
#define HSP_DCMDPTR0_PTCPU_27  (0x8000000UL << HSP_DCMDPTR0_PTCPU_Pos)  /*!< 0x08000000 */
#define HSP_DCMDPTR0_PTCPU_28  (0x10000000UL << HSP_DCMDPTR0_PTCPU_Pos) /*!< 0x10000000 */
#define HSP_DCMDPTR0_PTCPU_29  (0x20000000UL << HSP_DCMDPTR0_PTCPU_Pos) /*!< 0x20000000 */
#define HSP_DCMDPTR0_PTCPU_30  (0x40000000UL << HSP_DCMDPTR0_PTCPU_Pos) /*!< 0x40000000 */
#define HSP_DCMDPTR0_PTCPU_31  (0x80000000UL << HSP_DCMDPTR0_PTCPU_Pos) /*!< 0x80000000 */

