stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_BUFFCFGR register  ********************/
/*!< BUFF0DIR configuration */
#define HSP_BUFFCFGR_BUFF0DIR_Pos (0U)
#define HSP_BUFFCFGR_BUFF0DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF0DIR_Pos) /*!< 0x00000001 */
#define HSP_BUFFCFGR_BUFF0DIR     HSP_BUFFCFGR_BUFF0DIR_Msk            /*!< BUFF0DIR (Direction selection of BUFF0 <sup>(1)</sup>) */
/*!< BUFF1DIR configuration */
#define HSP_BUFFCFGR_BUFF1DIR_Pos (1U)
#define HSP_BUFFCFGR_BUFF1DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF1DIR_Pos) /*!< 0x00000002 */
#define HSP_BUFFCFGR_BUFF1DIR     HSP_BUFFCFGR_BUFF1DIR_Msk            /*!< BUFF1DIR (Direction selection of BUFF1 <sup>(1)</sup>) */
/*!< BUFF2DIR configuration */
#define HSP_BUFFCFGR_BUFF2DIR_Pos (2U)
#define HSP_BUFFCFGR_BUFF2DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF2DIR_Pos) /*!< 0x00000004 */
#define HSP_BUFFCFGR_BUFF2DIR     HSP_BUFFCFGR_BUFF2DIR_Msk            /*!< BUFF2DIR (Direction selection of BUFF2 <sup>(1)</sup>) */
/*!< BUFF3DIR configuration */
#define HSP_BUFFCFGR_BUFF3DIR_Pos (3U)
#define HSP_BUFFCFGR_BUFF3DIR_Msk (0x1UL << HSP_BUFFCFGR_BUFF3DIR_Pos) /*!< 0x00000008 */
#define HSP_BUFFCFGR_BUFF3DIR     HSP_BUFFCFGR_BUFF3DIR_Msk            /*!< BUFF3DIR (Direction selection of BUFF3 <sup>(1)</sup>) */
/*!< I2FEN configuration */
#define HSP_BUFFCFGR_I2FEN_Pos    (8U)
#define HSP_BUFFCFGR_I2FEN_Msk    (0x1UL << HSP_BUFFCFGR_I2FEN_Pos)    /*!< 0x00000100 */
#define HSP_BUFFCFGR_I2FEN        HSP_BUFFCFGR_I2FEN_Msk               /*!< I2FEN (integer to float32 conversion <sup>(1)</sup>) */
/*!< COMB0 configuration */
#define HSP_BUFFCFGR_COMB0_Pos    (16U)
#define HSP_BUFFCFGR_COMB0_Msk    (0x1UL << HSP_BUFFCFGR_COMB0_Pos)    /*!< 0x00010000 */
#define HSP_BUFFCFGR_COMB0        HSP_BUFFCFGR_COMB0_Msk               /*!< COMB0 (BUFCMB control for buff_evt[0] <sup>(1)</sup>) */
/*!< COMB1 configuration */
#define HSP_BUFFCFGR_COMB1_Pos    (17U)
#define HSP_BUFFCFGR_COMB1_Msk    (0x1UL << HSP_BUFFCFGR_COMB1_Pos)    /*!< 0x00020000 */
#define HSP_BUFFCFGR_COMB1        HSP_BUFFCFGR_COMB1_Msk               /*!< COMB1 (BUFCMB control for buff_evt[1] <sup>(1)</sup>) */
/*!< COMB2 configuration */
#define HSP_BUFFCFGR_COMB2_Pos    (18U)
#define HSP_BUFFCFGR_COMB2_Msk    (0x1UL << HSP_BUFFCFGR_COMB2_Pos)    /*!< 0x00040000 */
#define HSP_BUFFCFGR_COMB2        HSP_BUFFCFGR_COMB2_Msk               /*!< COMB2 (BUFCMB control for buff_evt[2] ) */

/********************  Bit definition for HSP_BUFF0DR register  ********************/
/*!< BUFFDAT configuration */
#define HSP_BUFF0DR_BUFFDAT_Pos (0U)
#define HSP_BUFF0DR_BUFFDAT_Msk (0xFFFFFFFFUL << HSP_BUFF0DR_BUFFDAT_Pos) /*!< 0xFFFFFFFF */
#define HSP_BUFF0DR_BUFFDAT     HSP_BUFF0DR_BUFFDAT_Msk                   /*!< BUFFDAT[31:0] bits (Data buffer) */
#define HSP_BUFF0DR_BUFFDAT_0   (0x00001UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000001 */
#define HSP_BUFF0DR_BUFFDAT_1   (0x00002UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000002 */
#define HSP_BUFF0DR_BUFFDAT_2   (0x00004UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000004 */
#define HSP_BUFF0DR_BUFFDAT_3   (0x00008UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000008 */
#define HSP_BUFF0DR_BUFFDAT_4   (0x00010UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000010 */
#define HSP_BUFF0DR_BUFFDAT_5   (0x00020UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000020 */
#define HSP_BUFF0DR_BUFFDAT_6   (0x00040UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000040 */
#define HSP_BUFF0DR_BUFFDAT_7   (0x00080UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000080 */
#define HSP_BUFF0DR_BUFFDAT_8   (0x00100UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000100 */
#define HSP_BUFF0DR_BUFFDAT_9   (0x00200UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000200 */
#define HSP_BUFF0DR_BUFFDAT_10  (0x00400UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000400 */
#define HSP_BUFF0DR_BUFFDAT_11  (0x00800UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00000800 */
#define HSP_BUFF0DR_BUFFDAT_12  (0x01000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00001000 */
#define HSP_BUFF0DR_BUFFDAT_13  (0x02000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00002000 */
#define HSP_BUFF0DR_BUFFDAT_14  (0x04000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00004000 */
#define HSP_BUFF0DR_BUFFDAT_15  (0x08000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00008000 */
#define HSP_BUFF0DR_BUFFDAT_16  (0x10000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00010000 */
#define HSP_BUFF0DR_BUFFDAT_17  (0x20000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00020000 */
#define HSP_BUFF0DR_BUFFDAT_18  (0x40000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00040000 */
#define HSP_BUFF0DR_BUFFDAT_19  (0x80000UL << HSP_BUFF0DR_BUFFDAT_Pos)    /*!< 0x00080000 */
#define HSP_BUFF0DR_BUFFDAT_20  (0x100000UL << HSP_BUFF0DR_BUFFDAT_Pos)   /*!< 0x00100000 */
#define HSP_BUFF0DR_BUFFDAT_21  (0x200000UL << HSP_BUFF0DR_BUFFDAT_Pos)   /*!< 0x00200000 */
#define HSP_BUFF0DR_BUFFDAT_22  (0x400000UL << HSP_BUFF0DR_BUFFDAT_Pos)   /*!< 0x00400000 */
#define HSP_BUFF0DR_BUFFDAT_23  (0x800000UL << HSP_BUFF0DR_BUFFDAT_Pos)   /*!< 0x00800000 */
#define HSP_BUFF0DR_BUFFDAT_24  (0x1000000UL << HSP_BUFF0DR_BUFFDAT_Pos)  /*!< 0x01000000 */
#define HSP_BUFF0DR_BUFFDAT_25  (0x2000000UL << HSP_BUFF0DR_BUFFDAT_Pos)  /*!< 0x02000000 */
#define HSP_BUFF0DR_BUFFDAT_26  (0x4000000UL << HSP_BUFF0DR_BUFFDAT_Pos)  /*!< 0x04000000 */
#define HSP_BUFF0DR_BUFFDAT_27  (0x8000000UL << HSP_BUFF0DR_BUFFDAT_Pos)  /*!< 0x08000000 */
#define HSP_BUFF0DR_BUFFDAT_28  (0x10000000UL << HSP_BUFF0DR_BUFFDAT_Pos) /*!< 0x10000000 */
#define HSP_BUFF0DR_BUFFDAT_29  (0x20000000UL << HSP_BUFF0DR_BUFFDAT_Pos) /*!< 0x20000000 */
#define HSP_BUFF0DR_BUFFDAT_30  (0x40000000UL << HSP_BUFF0DR_BUFFDAT_Pos) /*!< 0x40000000 */
#define HSP_BUFF0DR_BUFFDAT_31  (0x80000000UL << HSP_BUFF0DR_BUFFDAT_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_BUFF1DR register  ********************/
/*!< BUFFDAT configuration */
#define HSP_BUFF1DR_BUFFDAT_Pos (0U)
#define HSP_BUFF1DR_BUFFDAT_Msk (0xFFFFFFFFUL << HSP_BUFF1DR_BUFFDAT_Pos) /*!< 0xFFFFFFFF */
#define HSP_BUFF1DR_BUFFDAT     HSP_BUFF1DR_BUFFDAT_Msk                   /*!< BUFFDAT[31:0] bits (Data buffer) */
#define HSP_BUFF1DR_BUFFDAT_0   (0x00001UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000001 */
#define HSP_BUFF1DR_BUFFDAT_1   (0x00002UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000002 */
#define HSP_BUFF1DR_BUFFDAT_2   (0x00004UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000004 */
#define HSP_BUFF1DR_BUFFDAT_3   (0x00008UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000008 */
#define HSP_BUFF1DR_BUFFDAT_4   (0x00010UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000010 */
#define HSP_BUFF1DR_BUFFDAT_5   (0x00020UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000020 */
#define HSP_BUFF1DR_BUFFDAT_6   (0x00040UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000040 */
#define HSP_BUFF1DR_BUFFDAT_7   (0x00080UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000080 */
#define HSP_BUFF1DR_BUFFDAT_8   (0x00100UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000100 */
#define HSP_BUFF1DR_BUFFDAT_9   (0x00200UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000200 */
#define HSP_BUFF1DR_BUFFDAT_10  (0x00400UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000400 */
#define HSP_BUFF1DR_BUFFDAT_11  (0x00800UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00000800 */
#define HSP_BUFF1DR_BUFFDAT_12  (0x01000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00001000 */
#define HSP_BUFF1DR_BUFFDAT_13  (0x02000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00002000 */
#define HSP_BUFF1DR_BUFFDAT_14  (0x04000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00004000 */
#define HSP_BUFF1DR_BUFFDAT_15  (0x08000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00008000 */
#define HSP_BUFF1DR_BUFFDAT_16  (0x10000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00010000 */
#define HSP_BUFF1DR_BUFFDAT_17  (0x20000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00020000 */
#define HSP_BUFF1DR_BUFFDAT_18  (0x40000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00040000 */
#define HSP_BUFF1DR_BUFFDAT_19  (0x80000UL << HSP_BUFF1DR_BUFFDAT_Pos)    /*!< 0x00080000 */
#define HSP_BUFF1DR_BUFFDAT_20  (0x100000UL << HSP_BUFF1DR_BUFFDAT_Pos)   /*!< 0x00100000 */
#define HSP_BUFF1DR_BUFFDAT_21  (0x200000UL << HSP_BUFF1DR_BUFFDAT_Pos)   /*!< 0x00200000 */
#define HSP_BUFF1DR_BUFFDAT_22  (0x400000UL << HSP_BUFF1DR_BUFFDAT_Pos)   /*!< 0x00400000 */
#define HSP_BUFF1DR_BUFFDAT_23  (0x800000UL << HSP_BUFF1DR_BUFFDAT_Pos)   /*!< 0x00800000 */
#define HSP_BUFF1DR_BUFFDAT_24  (0x1000000UL << HSP_BUFF1DR_BUFFDAT_Pos)  /*!< 0x01000000 */
#define HSP_BUFF1DR_BUFFDAT_25  (0x2000000UL << HSP_BUFF1DR_BUFFDAT_Pos)  /*!< 0x02000000 */
#define HSP_BUFF1DR_BUFFDAT_26  (0x4000000UL << HSP_BUFF1DR_BUFFDAT_Pos)  /*!< 0x04000000 */
#define HSP_BUFF1DR_BUFFDAT_27  (0x8000000UL << HSP_BUFF1DR_BUFFDAT_Pos)  /*!< 0x08000000 */
#define HSP_BUFF1DR_BUFFDAT_28  (0x10000000UL << HSP_BUFF1DR_BUFFDAT_Pos) /*!< 0x10000000 */
#define HSP_BUFF1DR_BUFFDAT_29  (0x20000000UL << HSP_BUFF1DR_BUFFDAT_Pos) /*!< 0x20000000 */
#define HSP_BUFF1DR_BUFFDAT_30  (0x40000000UL << HSP_BUFF1DR_BUFFDAT_Pos) /*!< 0x40000000 */
#define HSP_BUFF1DR_BUFFDAT_31  (0x80000000UL << HSP_BUFF1DR_BUFFDAT_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_BUFF2DR register  ********************/
/*!< BUFFDAT configuration */
#define HSP_BUFF2DR_BUFFDAT_Pos (0U)
#define HSP_BUFF2DR_BUFFDAT_Msk (0xFFFFFFFFUL << HSP_BUFF2DR_BUFFDAT_Pos) /*!< 0xFFFFFFFF */
#define HSP_BUFF2DR_BUFFDAT     HSP_BUFF2DR_BUFFDAT_Msk                   /*!< BUFFDAT[31:0] bits (Data buffer) */
#define HSP_BUFF2DR_BUFFDAT_0   (0x00001UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000001 */
#define HSP_BUFF2DR_BUFFDAT_1   (0x00002UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000002 */
#define HSP_BUFF2DR_BUFFDAT_2   (0x00004UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000004 */
#define HSP_BUFF2DR_BUFFDAT_3   (0x00008UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000008 */
#define HSP_BUFF2DR_BUFFDAT_4   (0x00010UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000010 */
#define HSP_BUFF2DR_BUFFDAT_5   (0x00020UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000020 */
#define HSP_BUFF2DR_BUFFDAT_6   (0x00040UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000040 */
#define HSP_BUFF2DR_BUFFDAT_7   (0x00080UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000080 */
#define HSP_BUFF2DR_BUFFDAT_8   (0x00100UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000100 */
#define HSP_BUFF2DR_BUFFDAT_9   (0x00200UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000200 */
#define HSP_BUFF2DR_BUFFDAT_10  (0x00400UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000400 */
#define HSP_BUFF2DR_BUFFDAT_11  (0x00800UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00000800 */
#define HSP_BUFF2DR_BUFFDAT_12  (0x01000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00001000 */
#define HSP_BUFF2DR_BUFFDAT_13  (0x02000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00002000 */
#define HSP_BUFF2DR_BUFFDAT_14  (0x04000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00004000 */
#define HSP_BUFF2DR_BUFFDAT_15  (0x08000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00008000 */
#define HSP_BUFF2DR_BUFFDAT_16  (0x10000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00010000 */
#define HSP_BUFF2DR_BUFFDAT_17  (0x20000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00020000 */
#define HSP_BUFF2DR_BUFFDAT_18  (0x40000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00040000 */
#define HSP_BUFF2DR_BUFFDAT_19  (0x80000UL << HSP_BUFF2DR_BUFFDAT_Pos)    /*!< 0x00080000 */
#define HSP_BUFF2DR_BUFFDAT_20  (0x100000UL << HSP_BUFF2DR_BUFFDAT_Pos)   /*!< 0x00100000 */
#define HSP_BUFF2DR_BUFFDAT_21  (0x200000UL << HSP_BUFF2DR_BUFFDAT_Pos)   /*!< 0x00200000 */
#define HSP_BUFF2DR_BUFFDAT_22  (0x400000UL << HSP_BUFF2DR_BUFFDAT_Pos)   /*!< 0x00400000 */
#define HSP_BUFF2DR_BUFFDAT_23  (0x800000UL << HSP_BUFF2DR_BUFFDAT_Pos)   /*!< 0x00800000 */
#define HSP_BUFF2DR_BUFFDAT_24  (0x1000000UL << HSP_BUFF2DR_BUFFDAT_Pos)  /*!< 0x01000000 */
#define HSP_BUFF2DR_BUFFDAT_25  (0x2000000UL << HSP_BUFF2DR_BUFFDAT_Pos)  /*!< 0x02000000 */
#define HSP_BUFF2DR_BUFFDAT_26  (0x4000000UL << HSP_BUFF2DR_BUFFDAT_Pos)  /*!< 0x04000000 */
#define HSP_BUFF2DR_BUFFDAT_27  (0x8000000UL << HSP_BUFF2DR_BUFFDAT_Pos)  /*!< 0x08000000 */
#define HSP_BUFF2DR_BUFFDAT_28  (0x10000000UL << HSP_BUFF2DR_BUFFDAT_Pos) /*!< 0x10000000 */
#define HSP_BUFF2DR_BUFFDAT_29  (0x20000000UL << HSP_BUFF2DR_BUFFDAT_Pos) /*!< 0x20000000 */
#define HSP_BUFF2DR_BUFFDAT_30  (0x40000000UL << HSP_BUFF2DR_BUFFDAT_Pos) /*!< 0x40000000 */
#define HSP_BUFF2DR_BUFFDAT_31  (0x80000000UL << HSP_BUFF2DR_BUFFDAT_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_BUFF3DR register  ********************/
/*!< BUFFDAT configuration */
#define HSP_BUFF3DR_BUFFDAT_Pos (0U)
#define HSP_BUFF3DR_BUFFDAT_Msk (0xFFFFFFFFUL << HSP_BUFF3DR_BUFFDAT_Pos) /*!< 0xFFFFFFFF */
#define HSP_BUFF3DR_BUFFDAT     HSP_BUFF3DR_BUFFDAT_Msk                   /*!< BUFFDAT[31:0] bits (Data buffer) */
#define HSP_BUFF3DR_BUFFDAT_0   (0x00001UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000001 */
#define HSP_BUFF3DR_BUFFDAT_1   (0x00002UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000002 */
#define HSP_BUFF3DR_BUFFDAT_2   (0x00004UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000004 */
#define HSP_BUFF3DR_BUFFDAT_3   (0x00008UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000008 */
#define HSP_BUFF3DR_BUFFDAT_4   (0x00010UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000010 */
#define HSP_BUFF3DR_BUFFDAT_5   (0x00020UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000020 */
#define HSP_BUFF3DR_BUFFDAT_6   (0x00040UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000040 */
#define HSP_BUFF3DR_BUFFDAT_7   (0x00080UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000080 */
#define HSP_BUFF3DR_BUFFDAT_8   (0x00100UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000100 */
#define HSP_BUFF3DR_BUFFDAT_9   (0x00200UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000200 */
#define HSP_BUFF3DR_BUFFDAT_10  (0x00400UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000400 */
#define HSP_BUFF3DR_BUFFDAT_11  (0x00800UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00000800 */
#define HSP_BUFF3DR_BUFFDAT_12  (0x01000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00001000 */
#define HSP_BUFF3DR_BUFFDAT_13  (0x02000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00002000 */
#define HSP_BUFF3DR_BUFFDAT_14  (0x04000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00004000 */
#define HSP_BUFF3DR_BUFFDAT_15  (0x08000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00008000 */
#define HSP_BUFF3DR_BUFFDAT_16  (0x10000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00010000 */
#define HSP_BUFF3DR_BUFFDAT_17  (0x20000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00020000 */
#define HSP_BUFF3DR_BUFFDAT_18  (0x40000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00040000 */
#define HSP_BUFF3DR_BUFFDAT_19  (0x80000UL << HSP_BUFF3DR_BUFFDAT_Pos)    /*!< 0x00080000 */
#define HSP_BUFF3DR_BUFFDAT_20  (0x100000UL << HSP_BUFF3DR_BUFFDAT_Pos)   /*!< 0x00100000 */
#define HSP_BUFF3DR_BUFFDAT_21  (0x200000UL << HSP_BUFF3DR_BUFFDAT_Pos)   /*!< 0x00200000 */
#define HSP_BUFF3DR_BUFFDAT_22  (0x400000UL << HSP_BUFF3DR_BUFFDAT_Pos)   /*!< 0x00400000 */
#define HSP_BUFF3DR_BUFFDAT_23  (0x800000UL << HSP_BUFF3DR_BUFFDAT_Pos)   /*!< 0x00800000 */
#define HSP_BUFF3DR_BUFFDAT_24  (0x1000000UL << HSP_BUFF3DR_BUFFDAT_Pos)  /*!< 0x01000000 */
#define HSP_BUFF3DR_BUFFDAT_25  (0x2000000UL << HSP_BUFF3DR_BUFFDAT_Pos)  /*!< 0x02000000 */
#define HSP_BUFF3DR_BUFFDAT_26  (0x4000000UL << HSP_BUFF3DR_BUFFDAT_Pos)  /*!< 0x04000000 */
#define HSP_BUFF3DR_BUFFDAT_27  (0x8000000UL << HSP_BUFF3DR_BUFFDAT_Pos)  /*!< 0x08000000 */
#define HSP_BUFF3DR_BUFFDAT_28  (0x10000000UL << HSP_BUFF3DR_BUFFDAT_Pos) /*!< 0x10000000 */
#define HSP_BUFF3DR_BUFFDAT_29  (0x20000000UL << HSP_BUFF3DR_BUFFDAT_Pos) /*!< 0x20000000 */
#define HSP_BUFF3DR_BUFFDAT_30  (0x40000000UL << HSP_BUFF3DR_BUFFDAT_Pos) /*!< 0x40000000 */
#define HSP_BUFF3DR_BUFFDAT_31  (0x80000000UL << HSP_BUFF3DR_BUFFDAT_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_TRGINCFGR register  ********************/
/*!< TRG0POL configuration */
#define HSP_TRGINCFGR_TRG0POL_Pos (0U)
#define HSP_TRGINCFGR_TRG0POL_Msk (0x1UL << HSP_TRGINCFGR_TRG0POL_Pos) /*!< 0x00000001 */
#define HSP_TRGINCFGR_TRG0POL     HSP_TRGINCFGR_TRG0POL_Msk            /*!< TRG0POL (Polarity selection for TRGIN0) */
/*!< TRG1POL configuration */
#define HSP_TRGINCFGR_TRG1POL_Pos (1U)
#define HSP_TRGINCFGR_TRG1POL_Msk (0x1UL << HSP_TRGINCFGR_TRG1POL_Pos) /*!< 0x00000002 */
#define HSP_TRGINCFGR_TRG1POL     HSP_TRGINCFGR_TRG1POL_Msk            /*!< TRG1POL (Polarity selection for TRGIN1) */
/*!< TRG2POL configuration */
#define HSP_TRGINCFGR_TRG2POL_Pos (2U)
#define HSP_TRGINCFGR_TRG2POL_Msk (0x1UL << HSP_TRGINCFGR_TRG2POL_Pos) /*!< 0x00000004 */
#define HSP_TRGINCFGR_TRG2POL     HSP_TRGINCFGR_TRG2POL_Msk            /*!< TRG2POL (Polarity selection for TRGIN2) */
/*!< TRG3POL configuration */
#define HSP_TRGINCFGR_TRG3POL_Pos (3U)
#define HSP_TRGINCFGR_TRG3POL_Msk (0x1UL << HSP_TRGINCFGR_TRG3POL_Pos) /*!< 0x00000008 */
#define HSP_TRGINCFGR_TRG3POL     HSP_TRGINCFGR_TRG3POL_Msk            /*!< TRG3POL (Polarity selection for TRGIN3) */
/*!< TRG4POL configuration */
#define HSP_TRGINCFGR_TRG4POL_Pos (4U)
#define HSP_TRGINCFGR_TRG4POL_Msk (0x1UL << HSP_TRGINCFGR_TRG4POL_Pos) /*!< 0x00000010 */
#define HSP_TRGINCFGR_TRG4POL     HSP_TRGINCFGR_TRG4POL_Msk            /*!< TRG4POL (Polarity selection for TRGIN4) */
/*!< TRG5POL configuration */
#define HSP_TRGINCFGR_TRG5POL_Pos (5U)
#define HSP_TRGINCFGR_TRG5POL_Msk (0x1UL << HSP_TRGINCFGR_TRG5POL_Pos) /*!< 0x00000020 */
#define HSP_TRGINCFGR_TRG5POL     HSP_TRGINCFGR_TRG5POL_Msk            /*!< TRG5POL (Polarity selection for TRGIN5) */
/*!< TRG6POL configuration */
#define HSP_TRGINCFGR_TRG6POL_Pos (6U)
#define HSP_TRGINCFGR_TRG6POL_Msk (0x1UL << HSP_TRGINCFGR_TRG6POL_Pos) /*!< 0x00000040 */
#define HSP_TRGINCFGR_TRG6POL     HSP_TRGINCFGR_TRG6POL_Msk            /*!< TRG6POL (Polarity selection for TRGIN6) */
/*!< TRG7POL configuration */
#define HSP_TRGINCFGR_TRG7POL_Pos (7U)
#define HSP_TRGINCFGR_TRG7POL_Msk (0x1UL << HSP_TRGINCFGR_TRG7POL_Pos) /*!< 0x00000080 */
#define HSP_TRGINCFGR_TRG7POL     HSP_TRGINCFGR_TRG7POL_Msk            /*!< TRG7POL (Polarity selection for TRGIN7) */
/*!< TRG8POL configuration */
#define HSP_TRGINCFGR_TRG8POL_Pos (8U)
#define HSP_TRGINCFGR_TRG8POL_Msk (0x1UL << HSP_TRGINCFGR_TRG8POL_Pos) /*!< 0x00000100 */
#define HSP_TRGINCFGR_TRG8POL     HSP_TRGINCFGR_TRG8POL_Msk            /*!< TRG8POL (Polarity selection for TRGIN8) */
/*!< TRG9POL configuration */
#define HSP_TRGINCFGR_TRG9POL_Pos (9U)
#define HSP_TRGINCFGR_TRG9POL_Msk (0x1UL << HSP_TRGINCFGR_TRG9POL_Pos) /*!< 0x00000200 */
#define HSP_TRGINCFGR_TRG9POL     HSP_TRGINCFGR_TRG9POL_Msk            /*!< TRG9POL (Polarity selection for TRGIN9) */

/********************  Bit definition for HSP_TRGOCFGR register  ********************/
/*!< TRGO0SRC configuration */
#define HSP_TRGOCFGR_TRGO0SRC_Pos (0U)
#define HSP_TRGOCFGR_TRGO0SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO0SRC_Pos) /*!< 0x00000003 */
#define HSP_TRGOCFGR_TRGO0SRC     HSP_TRGOCFGR_TRGO0SRC_Msk            /*!< TRGO0SRC[1:0] bits (Trigger source selection for hsp_trg_out[0] <sup>(1)</sup>) */
#define HSP_TRGOCFGR_TRGO0SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO0SRC_Pos) /*!< 0x00000001 */
#define HSP_TRGOCFGR_TRGO0SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO0SRC_Pos) /*!< 0x00000002 */
/*!< TRGO1SRC configuration */
#define HSP_TRGOCFGR_TRGO1SRC_Pos (2U)
#define HSP_TRGOCFGR_TRGO1SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO1SRC_Pos) /*!< 0x0000000C */
#define HSP_TRGOCFGR_TRGO1SRC     HSP_TRGOCFGR_TRGO1SRC_Msk            /*!< TRGO1SRC[1:0] bits (Trigger source selection for hsp_trg_out[1] <sup>(1)</sup>) */
#define HSP_TRGOCFGR_TRGO1SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO1SRC_Pos) /*!< 0x00000004 */
#define HSP_TRGOCFGR_TRGO1SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO1SRC_Pos) /*!< 0x00000008 */
/*!< TRGO2SRC configuration */
#define HSP_TRGOCFGR_TRGO2SRC_Pos (4U)
#define HSP_TRGOCFGR_TRGO2SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO2SRC_Pos) /*!< 0x00000030 */
#define HSP_TRGOCFGR_TRGO2SRC     HSP_TRGOCFGR_TRGO2SRC_Msk            /*!< TRGO2SRC[1:0] bits (Trigger source selection for hsp_trg_out[2] <sup>(1)</sup>) */
#define HSP_TRGOCFGR_TRGO2SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO2SRC_Pos) /*!< 0x00000010 */
#define HSP_TRGOCFGR_TRGO2SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO2SRC_Pos) /*!< 0x00000020 */
/*!< TRGO3SRC configuration */
#define HSP_TRGOCFGR_TRGO3SRC_Pos (6U)
#define HSP_TRGOCFGR_TRGO3SRC_Msk (0x3UL << HSP_TRGOCFGR_TRGO3SRC_Pos) /*!< 0x000000C0 */
#define HSP_TRGOCFGR_TRGO3SRC     HSP_TRGOCFGR_TRGO3SRC_Msk            /*!< TRGO3SRC[1:0] bits (Trigger source selection for hsp_trg_out[3] ) */
#define HSP_TRGOCFGR_TRGO3SRC_0   (0x1UL << HSP_TRGOCFGR_TRGO3SRC_Pos) /*!< 0x00000040 */
#define HSP_TRGOCFGR_TRGO3SRC_1   (0x2UL << HSP_TRGOCFGR_TRGO3SRC_Pos) /*!< 0x00000080 */

/********************  Bit definition for HSP_CSEGR register  ********************/
/*!< CSEVT configuration */
#define HSP_CSEGR_CSEVT_Pos (1U)
#define HSP_CSEGR_CSEVT_Msk (0x3FFFFFUL << HSP_CSEGR_CSEVT_Pos) /*!< 0x007FFFFE */
#define HSP_CSEGR_CSEVT     HSP_CSEGR_CSEVT_Msk                 /*!< CSEVT[21:0] bits (CPU Shared Software Event ) */
#define HSP_CSEGR_CSEVT_0   (0x0001UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000002 */
#define HSP_CSEGR_CSEVT_1   (0x0002UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000004 */
#define HSP_CSEGR_CSEVT_2   (0x0004UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000008 */
#define HSP_CSEGR_CSEVT_3   (0x0008UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000010 */
#define HSP_CSEGR_CSEVT_4   (0x0010UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000020 */
#define HSP_CSEGR_CSEVT_5   (0x0020UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000040 */
#define HSP_CSEGR_CSEVT_6   (0x0040UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000080 */
#define HSP_CSEGR_CSEVT_7   (0x0080UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000100 */
#define HSP_CSEGR_CSEVT_8   (0x0100UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000200 */
#define HSP_CSEGR_CSEVT_9   (0x0200UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000400 */
#define HSP_CSEGR_CSEVT_10  (0x0400UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00000800 */
#define HSP_CSEGR_CSEVT_11  (0x0800UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00001000 */
#define HSP_CSEGR_CSEVT_12  (0x1000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00002000 */
#define HSP_CSEGR_CSEVT_13  (0x2000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00004000 */
#define HSP_CSEGR_CSEVT_14  (0x4000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00008000 */
#define HSP_CSEGR_CSEVT_15  (0x8000UL << HSP_CSEGR_CSEVT_Pos)   /*!< 0x00010000 */
#define HSP_CSEGR_CSEVT_16  (0x10000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00020000 */
#define HSP_CSEGR_CSEVT_17  (0x20000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00040000 */
#define HSP_CSEGR_CSEVT_18  (0x40000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00080000 */
#define HSP_CSEGR_CSEVT_19  (0x80000UL << HSP_CSEGR_CSEVT_Pos)  /*!< 0x00100000 */
#define HSP_CSEGR_CSEVT_20  (0x100000UL << HSP_CSEGR_CSEVT_Pos) /*!< 0x00200000 */
#define HSP_CSEGR_CSEVT_21  (0x200000UL << HSP_CSEGR_CSEVT_Pos) /*!< 0x00400000 */

/********************  Bit definition for HSP_CDEGR register  ********************/
/*!< CTSKN configuration */
#define HSP_CDEGR_CTSKN_Pos   (0U)
#define HSP_CDEGR_CTSKN_Msk   (0x3FUL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x0000003F */
#define HSP_CDEGR_CTSKN       HSP_CDEGR_CTSKN_Msk              /*!< CTSKN[5:0] bits (CPU Task number) */
#define HSP_CDEGR_CTSKN_0     (0x01UL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x00000001 */
#define HSP_CDEGR_CTSKN_1     (0x02UL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x00000002 */
#define HSP_CDEGR_CTSKN_2     (0x04UL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x00000004 */
#define HSP_CDEGR_CTSKN_3     (0x08UL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x00000008 */
#define HSP_CDEGR_CTSKN_4     (0x10UL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x00000010 */
#define HSP_CDEGR_CTSKN_5     (0x20UL << HSP_CDEGR_CTSKN_Pos)  /*!< 0x00000020 */
/*!< CDEGBSY configuration */
#define HSP_CDEGR_CDEGBSY_Pos (31U)
#define HSP_CDEGR_CDEGBSY_Msk (0x1UL << HSP_CDEGR_CDEGBSY_Pos) /*!< 0x80000000 */
#define HSP_CDEGR_CDEGBSY     HSP_CDEGR_CDEGBSY_Msk            /*!< CDEGBSY (CPU dedicated event generator busy) */

