stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_TRGINSELR0 register  ********************/
/*!< TRG0SEL configuration */
#define HSP_TRGINSELR0_TRG0SEL_Pos (0U)
#define HSP_TRGINSELR0_TRG0SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x0000003F */
#define HSP_TRGINSELR0_TRG0SEL     HSP_TRGINSELR0_TRG0SEL_Msk             /*!< TRG0SEL[5:0] bits (Input trigger selection for TRGIN0) */
#define HSP_TRGINSELR0_TRG0SEL_0   (0x01UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000001 */
#define HSP_TRGINSELR0_TRG0SEL_1   (0x02UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000002 */
#define HSP_TRGINSELR0_TRG0SEL_2   (0x04UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000004 */
#define HSP_TRGINSELR0_TRG0SEL_3   (0x08UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000008 */
#define HSP_TRGINSELR0_TRG0SEL_4   (0x10UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000010 */
#define HSP_TRGINSELR0_TRG0SEL_5   (0x20UL << HSP_TRGINSELR0_TRG0SEL_Pos) /*!< 0x00000020 */
/*!< TRG1SEL configuration */
#define HSP_TRGINSELR0_TRG1SEL_Pos (8U)
#define HSP_TRGINSELR0_TRG1SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00003F00 */
#define HSP_TRGINSELR0_TRG1SEL     HSP_TRGINSELR0_TRG1SEL_Msk             /*!< TRG1SEL[5:0] bits (Input trigger selection for TRGIN1) */
#define HSP_TRGINSELR0_TRG1SEL_0   (0x01UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000100 */
#define HSP_TRGINSELR0_TRG1SEL_1   (0x02UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000200 */
#define HSP_TRGINSELR0_TRG1SEL_2   (0x04UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000400 */
#define HSP_TRGINSELR0_TRG1SEL_3   (0x08UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00000800 */
#define HSP_TRGINSELR0_TRG1SEL_4   (0x10UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00001000 */
#define HSP_TRGINSELR0_TRG1SEL_5   (0x20UL << HSP_TRGINSELR0_TRG1SEL_Pos) /*!< 0x00002000 */
/*!< TRG2SEL configuration */
#define HSP_TRGINSELR0_TRG2SEL_Pos (16U)
#define HSP_TRGINSELR0_TRG2SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x003F0000 */
#define HSP_TRGINSELR0_TRG2SEL     HSP_TRGINSELR0_TRG2SEL_Msk             /*!< TRG2SEL[5:0] bits (Input trigger selection for TRGIN2) */
#define HSP_TRGINSELR0_TRG2SEL_0   (0x01UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00010000 */
#define HSP_TRGINSELR0_TRG2SEL_1   (0x02UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00020000 */
#define HSP_TRGINSELR0_TRG2SEL_2   (0x04UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00040000 */
#define HSP_TRGINSELR0_TRG2SEL_3   (0x08UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00080000 */
#define HSP_TRGINSELR0_TRG2SEL_4   (0x10UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00100000 */
#define HSP_TRGINSELR0_TRG2SEL_5   (0x20UL << HSP_TRGINSELR0_TRG2SEL_Pos) /*!< 0x00200000 */
/*!< TRG3SEL configuration */
#define HSP_TRGINSELR0_TRG3SEL_Pos (24U)
#define HSP_TRGINSELR0_TRG3SEL_Msk (0x3FUL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x3F000000 */
#define HSP_TRGINSELR0_TRG3SEL     HSP_TRGINSELR0_TRG3SEL_Msk             /*!< TRG3SEL[5:0] bits (Input trigger selection for TRGIN3) */
#define HSP_TRGINSELR0_TRG3SEL_0   (0x01UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x01000000 */
#define HSP_TRGINSELR0_TRG3SEL_1   (0x02UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x02000000 */
#define HSP_TRGINSELR0_TRG3SEL_2   (0x04UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x04000000 */
#define HSP_TRGINSELR0_TRG3SEL_3   (0x08UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x08000000 */
#define HSP_TRGINSELR0_TRG3SEL_4   (0x10UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x10000000 */
#define HSP_TRGINSELR0_TRG3SEL_5   (0x20UL << HSP_TRGINSELR0_TRG3SEL_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_TRGINSELR1 register  ********************/
/*!< TRG4SEL configuration */
#define HSP_TRGINSELR1_TRG4SEL_Pos (0U)
#define HSP_TRGINSELR1_TRG4SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x0000003F */
#define HSP_TRGINSELR1_TRG4SEL     HSP_TRGINSELR1_TRG4SEL_Msk             /*!< TRG4SEL[5:0] bits (Input trigger selection for TRGIN4) */
#define HSP_TRGINSELR1_TRG4SEL_0   (0x01UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000001 */
#define HSP_TRGINSELR1_TRG4SEL_1   (0x02UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000002 */
#define HSP_TRGINSELR1_TRG4SEL_2   (0x04UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000004 */
#define HSP_TRGINSELR1_TRG4SEL_3   (0x08UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000008 */
#define HSP_TRGINSELR1_TRG4SEL_4   (0x10UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000010 */
#define HSP_TRGINSELR1_TRG4SEL_5   (0x20UL << HSP_TRGINSELR1_TRG4SEL_Pos) /*!< 0x00000020 */
/*!< TRG5SEL configuration */
#define HSP_TRGINSELR1_TRG5SEL_Pos (8U)
#define HSP_TRGINSELR1_TRG5SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00003F00 */
#define HSP_TRGINSELR1_TRG5SEL     HSP_TRGINSELR1_TRG5SEL_Msk             /*!< TRG5SEL[5:0] bits (Input trigger selection for TRGIN5) */
#define HSP_TRGINSELR1_TRG5SEL_0   (0x01UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000100 */
#define HSP_TRGINSELR1_TRG5SEL_1   (0x02UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000200 */
#define HSP_TRGINSELR1_TRG5SEL_2   (0x04UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000400 */
#define HSP_TRGINSELR1_TRG5SEL_3   (0x08UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00000800 */
#define HSP_TRGINSELR1_TRG5SEL_4   (0x10UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00001000 */
#define HSP_TRGINSELR1_TRG5SEL_5   (0x20UL << HSP_TRGINSELR1_TRG5SEL_Pos) /*!< 0x00002000 */
/*!< TRG6SEL configuration */
#define HSP_TRGINSELR1_TRG6SEL_Pos (16U)
#define HSP_TRGINSELR1_TRG6SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x003F0000 */
#define HSP_TRGINSELR1_TRG6SEL     HSP_TRGINSELR1_TRG6SEL_Msk             /*!< TRG6SEL[5:0] bits (Input trigger selection for TRGIN6) */
#define HSP_TRGINSELR1_TRG6SEL_0   (0x01UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00010000 */
#define HSP_TRGINSELR1_TRG6SEL_1   (0x02UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00020000 */
#define HSP_TRGINSELR1_TRG6SEL_2   (0x04UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00040000 */
#define HSP_TRGINSELR1_TRG6SEL_3   (0x08UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00080000 */
#define HSP_TRGINSELR1_TRG6SEL_4   (0x10UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00100000 */
#define HSP_TRGINSELR1_TRG6SEL_5   (0x20UL << HSP_TRGINSELR1_TRG6SEL_Pos) /*!< 0x00200000 */
/*!< TRG7SEL configuration */
#define HSP_TRGINSELR1_TRG7SEL_Pos (24U)
#define HSP_TRGINSELR1_TRG7SEL_Msk (0x3FUL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x3F000000 */
#define HSP_TRGINSELR1_TRG7SEL     HSP_TRGINSELR1_TRG7SEL_Msk             /*!< TRG7SEL[5:0] bits (Input trigger selection for TRGIN7) */
#define HSP_TRGINSELR1_TRG7SEL_0   (0x01UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x01000000 */
#define HSP_TRGINSELR1_TRG7SEL_1   (0x02UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x02000000 */
#define HSP_TRGINSELR1_TRG7SEL_2   (0x04UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x04000000 */
#define HSP_TRGINSELR1_TRG7SEL_3   (0x08UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x08000000 */
#define HSP_TRGINSELR1_TRG7SEL_4   (0x10UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x10000000 */
#define HSP_TRGINSELR1_TRG7SEL_5   (0x20UL << HSP_TRGINSELR1_TRG7SEL_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_TRGINSELR2 register  ********************/
/*!< TRG8SEL configuration */
#define HSP_TRGINSELR2_TRG8SEL_Pos (0U)
#define HSP_TRGINSELR2_TRG8SEL_Msk (0x3FUL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x0000003F */
#define HSP_TRGINSELR2_TRG8SEL     HSP_TRGINSELR2_TRG8SEL_Msk             /*!< TRG8SEL[5:0] bits (Input trigger selection for TRGIN8) */
#define HSP_TRGINSELR2_TRG8SEL_0   (0x01UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000001 */
#define HSP_TRGINSELR2_TRG8SEL_1   (0x02UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000002 */
#define HSP_TRGINSELR2_TRG8SEL_2   (0x04UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000004 */
#define HSP_TRGINSELR2_TRG8SEL_3   (0x08UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000008 */
#define HSP_TRGINSELR2_TRG8SEL_4   (0x10UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000010 */
#define HSP_TRGINSELR2_TRG8SEL_5   (0x20UL << HSP_TRGINSELR2_TRG8SEL_Pos) /*!< 0x00000020 */
/*!< TRG9SEL configuration */
#define HSP_TRGINSELR2_TRG9SEL_Pos (8U)
#define HSP_TRGINSELR2_TRG9SEL_Msk (0x3FUL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00003F00 */
#define HSP_TRGINSELR2_TRG9SEL     HSP_TRGINSELR2_TRG9SEL_Msk             /*!< TRG9SEL[5:0] bits (Input trigger selection for TRGIN9) */
#define HSP_TRGINSELR2_TRG9SEL_0   (0x01UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000100 */
#define HSP_TRGINSELR2_TRG9SEL_1   (0x02UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000200 */
#define HSP_TRGINSELR2_TRG9SEL_2   (0x04UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000400 */
#define HSP_TRGINSELR2_TRG9SEL_3   (0x08UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00000800 */
#define HSP_TRGINSELR2_TRG9SEL_4   (0x10UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00001000 */
#define HSP_TRGINSELR2_TRG9SEL_5   (0x20UL << HSP_TRGINSELR2_TRG9SEL_Pos) /*!< 0x00002000 */

