stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_BKO3CFGR register  ********************/
/*!< ACCEREN configuration */
#define HSP_BKO3CFGR_ACCEREN_Pos  (0U)
#define HSP_BKO3CFGR_ACCEREN_Msk  (0x1UL << HSP_BKO3CFGR_ACCEREN_Pos)  /*!< 0x00000001 */
#define HSP_BKO3CFGR_ACCEREN      HSP_BKO3CFGR_ACCEREN_Msk             /*!< ACCEREN (Access error break enable for ACCERRF <sup>(1)</sup>) */
/*!< FPUEREN configuration */
#define HSP_BKO3CFGR_FPUEREN_Pos  (1U)
#define HSP_BKO3CFGR_FPUEREN_Msk  (0x1UL << HSP_BKO3CFGR_FPUEREN_Pos)  /*!< 0x00000002 */
#define HSP_BKO3CFGR_FPUEREN      HSP_BKO3CFGR_FPUEREN_Msk             /*!< FPUEREN (FPU error break enable for FPUERRF <sup>(1)</sup>) */
/*!< OPCEREN configuration */
#define HSP_BKO3CFGR_OPCEREN_Pos  (2U)
#define HSP_BKO3CFGR_OPCEREN_Msk  (0x1UL << HSP_BKO3CFGR_OPCEREN_Pos)  /*!< 0x00000004 */
#define HSP_BKO3CFGR_OPCEREN      HSP_BKO3CFGR_OPCEREN_Msk             /*!< OPCEREN (Opcode error break enable for OPCOERRF ) */
/*!< PFCT28EN configuration */
#define HSP_BKO3CFGR_PFCT28EN_Pos (4U)
#define HSP_BKO3CFGR_PFCT28EN_Msk (0x1UL << HSP_BKO3CFGR_PFCT28EN_Pos) /*!< 0x00000010 */
#define HSP_BKO3CFGR_PFCT28EN     HSP_BKO3CFGR_PFCT28EN_Msk            /*!< PFCT28EN (Processing function flag break enable for PFCTF[28] <sup>(1)</sup>) */
/*!< PFCT29EN configuration */
#define HSP_BKO3CFGR_PFCT29EN_Pos (5U)
#define HSP_BKO3CFGR_PFCT29EN_Msk (0x1UL << HSP_BKO3CFGR_PFCT29EN_Pos) /*!< 0x00000020 */
#define HSP_BKO3CFGR_PFCT29EN     HSP_BKO3CFGR_PFCT29EN_Msk            /*!< PFCT29EN (Processing function flag break enable for PFCTF[29] <sup>(1)</sup>) */
/*!< PFCT30EN configuration */
#define HSP_BKO3CFGR_PFCT30EN_Pos (6U)
#define HSP_BKO3CFGR_PFCT30EN_Msk (0x1UL << HSP_BKO3CFGR_PFCT30EN_Pos) /*!< 0x00000040 */
#define HSP_BKO3CFGR_PFCT30EN     HSP_BKO3CFGR_PFCT30EN_Msk            /*!< PFCT30EN (Processing function flag break enable for PFCTF[30] <sup>(1)</sup>) */
/*!< PFCT31EN configuration */
#define HSP_BKO3CFGR_PFCT31EN_Pos (7U)
#define HSP_BKO3CFGR_PFCT31EN_Msk (0x1UL << HSP_BKO3CFGR_PFCT31EN_Pos) /*!< 0x00000080 */
#define HSP_BKO3CFGR_PFCT31EN     HSP_BKO3CFGR_PFCT31EN_Msk            /*!< PFCT31EN (Processing function flag break enable for PFCTF[31] <sup>(1)</sup>) */
/*!< FWEREN configuration */
#define HSP_BKO3CFGR_FWEREN_Pos   (12U)
#define HSP_BKO3CFGR_FWEREN_Msk   (0x1UL << HSP_BKO3CFGR_FWEREN_Pos)   /*!< 0x00001000 */
#define HSP_BKO3CFGR_FWEREN       HSP_BKO3CFGR_FWEREN_Msk              /*!< FWEREN (Firmware error break enable for FWERRF <sup>(1)</sup>) */
/*!< HDEGOVEN configuration */
#define HSP_BKO3CFGR_HDEGOVEN_Pos (13U)
#define HSP_BKO3CFGR_HDEGOVEN_Msk (0x1UL << HSP_BKO3CFGR_HDEGOVEN_Pos) /*!< 0x00002000 */
#define HSP_BKO3CFGR_HDEGOVEN     HSP_BKO3CFGR_HDEGOVEN_Msk            /*!< HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF <sup>(1)</sup>) */

/********************  Bit definition for HSP_BKICFGR register  ********************/
/*!< ACCEREN configuration */
#define HSP_BKICFGR_ACCEREN_Pos  (0U)
#define HSP_BKICFGR_ACCEREN_Msk  (0x1UL << HSP_BKICFGR_ACCEREN_Pos)  /*!< 0x00000001 */
#define HSP_BKICFGR_ACCEREN      HSP_BKICFGR_ACCEREN_Msk             /*!< ACCEREN (Access error break enable for ACCERRF <sup>(1)</sup>) */
/*!< FPUEREN configuration */
#define HSP_BKICFGR_FPUEREN_Pos  (1U)
#define HSP_BKICFGR_FPUEREN_Msk  (0x1UL << HSP_BKICFGR_FPUEREN_Pos)  /*!< 0x00000002 */
#define HSP_BKICFGR_FPUEREN      HSP_BKICFGR_FPUEREN_Msk             /*!< FPUEREN (FPU error break enable for FPUERRF <sup>(1)</sup>) */
/*!< OPCEREN configuration */
#define HSP_BKICFGR_OPCEREN_Pos  (2U)
#define HSP_BKICFGR_OPCEREN_Msk  (0x1UL << HSP_BKICFGR_OPCEREN_Pos)  /*!< 0x00000004 */
#define HSP_BKICFGR_OPCEREN      HSP_BKICFGR_OPCEREN_Msk             /*!< OPCEREN (Opcode error break enable for OPCOERRF ) */
/*!< BKIEN configuration */
#define HSP_BKICFGR_BKIEN_Pos    (3U)
#define HSP_BKICFGR_BKIEN_Msk    (0x1UL << HSP_BKICFGR_BKIEN_Pos)    /*!< 0x00000008 */
#define HSP_BKICFGR_BKIEN        HSP_BKICFGR_BKIEN_Msk               /*!< BKIEN (Break enable for hsp_break_in signal <sup>(1)</sup>) */
/*!< PFCT28EN configuration */
#define HSP_BKICFGR_PFCT28EN_Pos (4U)
#define HSP_BKICFGR_PFCT28EN_Msk (0x1UL << HSP_BKICFGR_PFCT28EN_Pos) /*!< 0x00000010 */
#define HSP_BKICFGR_PFCT28EN     HSP_BKICFGR_PFCT28EN_Msk            /*!< PFCT28EN (Processing function flag break enable for PFCTF[28] <sup>(1)</sup>) */
/*!< PFCT29EN configuration */
#define HSP_BKICFGR_PFCT29EN_Pos (5U)
#define HSP_BKICFGR_PFCT29EN_Msk (0x1UL << HSP_BKICFGR_PFCT29EN_Pos) /*!< 0x00000020 */
#define HSP_BKICFGR_PFCT29EN     HSP_BKICFGR_PFCT29EN_Msk            /*!< PFCT29EN (Processing function flag break enable for PFCTF[29] <sup>(1)</sup>) */
/*!< PFCT30EN configuration */
#define HSP_BKICFGR_PFCT30EN_Pos (6U)
#define HSP_BKICFGR_PFCT30EN_Msk (0x1UL << HSP_BKICFGR_PFCT30EN_Pos) /*!< 0x00000040 */
#define HSP_BKICFGR_PFCT30EN     HSP_BKICFGR_PFCT30EN_Msk            /*!< PFCT30EN (Processing function flag break enable for PFCTF[30] <sup>(1)</sup>) */
/*!< PFCT31EN configuration */
#define HSP_BKICFGR_PFCT31EN_Pos (7U)
#define HSP_BKICFGR_PFCT31EN_Msk (0x1UL << HSP_BKICFGR_PFCT31EN_Pos) /*!< 0x00000080 */
#define HSP_BKICFGR_PFCT31EN     HSP_BKICFGR_PFCT31EN_Msk            /*!< PFCT31EN (Processing function flag break enable for PFCTF[31] <sup>(1)</sup>) */
/*!< FWEREN configuration */
#define HSP_BKICFGR_FWEREN_Pos   (12U)
#define HSP_BKICFGR_FWEREN_Msk   (0x1UL << HSP_BKICFGR_FWEREN_Pos)   /*!< 0x00001000 */
#define HSP_BKICFGR_FWEREN       HSP_BKICFGR_FWEREN_Msk              /*!< FWEREN (Firmware error break enable for FWERRF <sup>(1)</sup>) */
/*!< HDEGOVEN configuration */
#define HSP_BKICFGR_HDEGOVEN_Pos (13U)
#define HSP_BKICFGR_HDEGOVEN_Msk (0x1UL << HSP_BKICFGR_HDEGOVEN_Pos) /*!< 0x00002000 */
#define HSP_BKICFGR_HDEGOVEN     HSP_BKICFGR_HDEGOVEN_Msk            /*!< HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF <sup>(1)</sup>) */
/*!< FSATEN configuration */
#define HSP_BKICFGR_FSATEN_Pos   (14U)
#define HSP_BKICFGR_FSATEN_Msk   (0x1UL << HSP_BKICFGR_FSATEN_Pos)   /*!< 0x00004000 */
#define HSP_BKICFGR_FSATEN       HSP_BKICFGR_FSATEN_Msk              /*!< FSATEN (FPU saturation break enable for FPUSATF <sup>(1)</sup>) */
/*!< SSEN configuration */
#define HSP_BKICFGR_SSEN_Pos     (17U)
#define HSP_BKICFGR_SSEN_Msk     (0x1UL << HSP_BKICFGR_SSEN_Pos)     /*!< 0x00020000 */
#define HSP_BKICFGR_SSEN         HSP_BKICFGR_SSEN_Msk                /*!< SSEN (Single step enable <sup>(1)</sup>) */
/*!< BKIP configuration */
#define HSP_BKICFGR_BKIP_Pos     (18U)
#define HSP_BKICFGR_BKIP_Msk     (0x1UL << HSP_BKICFGR_BKIP_Pos)     /*!< 0x00040000 */
#define HSP_BKICFGR_BKIP         HSP_BKICFGR_BKIP_Msk                /*!< BKIP (Break enable input polarity <sup>(1)</sup>) */

/********************  Bit definition for HSP_FWERR register  ********************/
/*!< FWERRN configuration */
#define HSP_FWERR_FWERRN_Pos (0U)
#define HSP_FWERR_FWERRN_Msk (0x3FFUL << HSP_FWERR_FWERRN_Pos) /*!< 0x000003FF */
#define HSP_FWERR_FWERRN     HSP_FWERR_FWERRN_Msk              /*!< FWERRN[9:0] bits (Firmware error number) */
#define HSP_FWERR_FWERRN_0   (0x001UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000001 */
#define HSP_FWERR_FWERRN_1   (0x002UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000002 */
#define HSP_FWERR_FWERRN_2   (0x004UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000004 */
#define HSP_FWERR_FWERRN_3   (0x008UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000008 */
#define HSP_FWERR_FWERRN_4   (0x010UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000010 */
#define HSP_FWERR_FWERRN_5   (0x020UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000020 */
#define HSP_FWERR_FWERRN_6   (0x040UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000040 */
#define HSP_FWERR_FWERRN_7   (0x080UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000080 */
#define HSP_FWERR_FWERRN_8   (0x100UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000100 */
#define HSP_FWERR_FWERRN_9   (0x200UL << HSP_FWERR_FWERRN_Pos) /*!< 0x00000200 */

/********************  Bit definition for HSP_PARAMR0 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR0_PARAM_Pos (0U)
#define HSP_PARAMR0_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR0_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR0_PARAM     HSP_PARAMR0_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR0_PARAM_0   (0x00001UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR0_PARAM_1   (0x00002UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR0_PARAM_2   (0x00004UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR0_PARAM_3   (0x00008UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR0_PARAM_4   (0x00010UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR0_PARAM_5   (0x00020UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR0_PARAM_6   (0x00040UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR0_PARAM_7   (0x00080UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR0_PARAM_8   (0x00100UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR0_PARAM_9   (0x00200UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR0_PARAM_10  (0x00400UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR0_PARAM_11  (0x00800UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR0_PARAM_12  (0x01000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR0_PARAM_13  (0x02000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR0_PARAM_14  (0x04000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR0_PARAM_15  (0x08000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR0_PARAM_16  (0x10000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR0_PARAM_17  (0x20000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR0_PARAM_18  (0x40000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR0_PARAM_19  (0x80000UL << HSP_PARAMR0_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR0_PARAM_20  (0x100000UL << HSP_PARAMR0_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR0_PARAM_21  (0x200000UL << HSP_PARAMR0_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR0_PARAM_22  (0x400000UL << HSP_PARAMR0_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR0_PARAM_23  (0x800000UL << HSP_PARAMR0_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR0_PARAM_24  (0x1000000UL << HSP_PARAMR0_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR0_PARAM_25  (0x2000000UL << HSP_PARAMR0_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR0_PARAM_26  (0x4000000UL << HSP_PARAMR0_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR0_PARAM_27  (0x8000000UL << HSP_PARAMR0_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR0_PARAM_28  (0x10000000UL << HSP_PARAMR0_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR0_PARAM_29  (0x20000000UL << HSP_PARAMR0_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR0_PARAM_30  (0x40000000UL << HSP_PARAMR0_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR0_PARAM_31  (0x80000000UL << HSP_PARAMR0_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR1 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR1_PARAM_Pos (0U)
#define HSP_PARAMR1_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR1_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR1_PARAM     HSP_PARAMR1_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR1_PARAM_0   (0x00001UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR1_PARAM_1   (0x00002UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR1_PARAM_2   (0x00004UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR1_PARAM_3   (0x00008UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR1_PARAM_4   (0x00010UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR1_PARAM_5   (0x00020UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR1_PARAM_6   (0x00040UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR1_PARAM_7   (0x00080UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR1_PARAM_8   (0x00100UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR1_PARAM_9   (0x00200UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR1_PARAM_10  (0x00400UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR1_PARAM_11  (0x00800UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR1_PARAM_12  (0x01000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR1_PARAM_13  (0x02000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR1_PARAM_14  (0x04000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR1_PARAM_15  (0x08000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR1_PARAM_16  (0x10000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR1_PARAM_17  (0x20000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR1_PARAM_18  (0x40000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR1_PARAM_19  (0x80000UL << HSP_PARAMR1_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR1_PARAM_20  (0x100000UL << HSP_PARAMR1_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR1_PARAM_21  (0x200000UL << HSP_PARAMR1_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR1_PARAM_22  (0x400000UL << HSP_PARAMR1_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR1_PARAM_23  (0x800000UL << HSP_PARAMR1_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR1_PARAM_24  (0x1000000UL << HSP_PARAMR1_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR1_PARAM_25  (0x2000000UL << HSP_PARAMR1_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR1_PARAM_26  (0x4000000UL << HSP_PARAMR1_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR1_PARAM_27  (0x8000000UL << HSP_PARAMR1_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR1_PARAM_28  (0x10000000UL << HSP_PARAMR1_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR1_PARAM_29  (0x20000000UL << HSP_PARAMR1_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR1_PARAM_30  (0x40000000UL << HSP_PARAMR1_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR1_PARAM_31  (0x80000000UL << HSP_PARAMR1_PARAM_Pos) /*!< 0x80000000 */

