stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_PARAMR6 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR6_PARAM_Pos (0U)
#define HSP_PARAMR6_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR6_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR6_PARAM     HSP_PARAMR6_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR6_PARAM_0   (0x00001UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR6_PARAM_1   (0x00002UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR6_PARAM_2   (0x00004UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR6_PARAM_3   (0x00008UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR6_PARAM_4   (0x00010UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR6_PARAM_5   (0x00020UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR6_PARAM_6   (0x00040UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR6_PARAM_7   (0x00080UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR6_PARAM_8   (0x00100UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR6_PARAM_9   (0x00200UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR6_PARAM_10  (0x00400UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR6_PARAM_11  (0x00800UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR6_PARAM_12  (0x01000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR6_PARAM_13  (0x02000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR6_PARAM_14  (0x04000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR6_PARAM_15  (0x08000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR6_PARAM_16  (0x10000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR6_PARAM_17  (0x20000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR6_PARAM_18  (0x40000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR6_PARAM_19  (0x80000UL << HSP_PARAMR6_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR6_PARAM_20  (0x100000UL << HSP_PARAMR6_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR6_PARAM_21  (0x200000UL << HSP_PARAMR6_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR6_PARAM_22  (0x400000UL << HSP_PARAMR6_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR6_PARAM_23  (0x800000UL << HSP_PARAMR6_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR6_PARAM_24  (0x1000000UL << HSP_PARAMR6_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR6_PARAM_25  (0x2000000UL << HSP_PARAMR6_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR6_PARAM_26  (0x4000000UL << HSP_PARAMR6_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR6_PARAM_27  (0x8000000UL << HSP_PARAMR6_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR6_PARAM_28  (0x10000000UL << HSP_PARAMR6_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR6_PARAM_29  (0x20000000UL << HSP_PARAMR6_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR6_PARAM_30  (0x40000000UL << HSP_PARAMR6_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR6_PARAM_31  (0x80000000UL << HSP_PARAMR6_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR7 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR7_PARAM_Pos (0U)
#define HSP_PARAMR7_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR7_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR7_PARAM     HSP_PARAMR7_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR7_PARAM_0   (0x00001UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR7_PARAM_1   (0x00002UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR7_PARAM_2   (0x00004UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR7_PARAM_3   (0x00008UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR7_PARAM_4   (0x00010UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR7_PARAM_5   (0x00020UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR7_PARAM_6   (0x00040UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR7_PARAM_7   (0x00080UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR7_PARAM_8   (0x00100UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR7_PARAM_9   (0x00200UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR7_PARAM_10  (0x00400UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR7_PARAM_11  (0x00800UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR7_PARAM_12  (0x01000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR7_PARAM_13  (0x02000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR7_PARAM_14  (0x04000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR7_PARAM_15  (0x08000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR7_PARAM_16  (0x10000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR7_PARAM_17  (0x20000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR7_PARAM_18  (0x40000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR7_PARAM_19  (0x80000UL << HSP_PARAMR7_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR7_PARAM_20  (0x100000UL << HSP_PARAMR7_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR7_PARAM_21  (0x200000UL << HSP_PARAMR7_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR7_PARAM_22  (0x400000UL << HSP_PARAMR7_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR7_PARAM_23  (0x800000UL << HSP_PARAMR7_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR7_PARAM_24  (0x1000000UL << HSP_PARAMR7_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR7_PARAM_25  (0x2000000UL << HSP_PARAMR7_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR7_PARAM_26  (0x4000000UL << HSP_PARAMR7_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR7_PARAM_27  (0x8000000UL << HSP_PARAMR7_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR7_PARAM_28  (0x10000000UL << HSP_PARAMR7_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR7_PARAM_29  (0x20000000UL << HSP_PARAMR7_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR7_PARAM_30  (0x40000000UL << HSP_PARAMR7_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR7_PARAM_31  (0x80000000UL << HSP_PARAMR7_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR8 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR8_PARAM_Pos (0U)
#define HSP_PARAMR8_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR8_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR8_PARAM     HSP_PARAMR8_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR8_PARAM_0   (0x00001UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR8_PARAM_1   (0x00002UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR8_PARAM_2   (0x00004UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR8_PARAM_3   (0x00008UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR8_PARAM_4   (0x00010UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR8_PARAM_5   (0x00020UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR8_PARAM_6   (0x00040UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR8_PARAM_7   (0x00080UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR8_PARAM_8   (0x00100UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR8_PARAM_9   (0x00200UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR8_PARAM_10  (0x00400UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR8_PARAM_11  (0x00800UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR8_PARAM_12  (0x01000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR8_PARAM_13  (0x02000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR8_PARAM_14  (0x04000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR8_PARAM_15  (0x08000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR8_PARAM_16  (0x10000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR8_PARAM_17  (0x20000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR8_PARAM_18  (0x40000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR8_PARAM_19  (0x80000UL << HSP_PARAMR8_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR8_PARAM_20  (0x100000UL << HSP_PARAMR8_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR8_PARAM_21  (0x200000UL << HSP_PARAMR8_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR8_PARAM_22  (0x400000UL << HSP_PARAMR8_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR8_PARAM_23  (0x800000UL << HSP_PARAMR8_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR8_PARAM_24  (0x1000000UL << HSP_PARAMR8_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR8_PARAM_25  (0x2000000UL << HSP_PARAMR8_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR8_PARAM_26  (0x4000000UL << HSP_PARAMR8_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR8_PARAM_27  (0x8000000UL << HSP_PARAMR8_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR8_PARAM_28  (0x10000000UL << HSP_PARAMR8_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR8_PARAM_29  (0x20000000UL << HSP_PARAMR8_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR8_PARAM_30  (0x40000000UL << HSP_PARAMR8_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR8_PARAM_31  (0x80000000UL << HSP_PARAMR8_PARAM_Pos) /*!< 0x80000000 */

