stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_SPE_IER register  ********************/
/*!< C2HMRDYIE configuration */
#define HSP_SPE_IER_C2HMRDYIE_Pos  (0U)
#define HSP_SPE_IER_C2HMRDYIE_Msk  (0x1UL << HSP_SPE_IER_C2HMRDYIE_Pos)  /*!< 0x00000001 */
#define HSP_SPE_IER_C2HMRDYIE      HSP_SPE_IER_C2HMRDYIE_Msk             /*!< C2HMRDYIE (CPU to SPE message ready interrupt enable) */
/*!< H2CMFREEIE configuration */
#define HSP_SPE_IER_H2CMFREEIE_Pos (1U)
#define HSP_SPE_IER_H2CMFREEIE_Msk (0x1UL << HSP_SPE_IER_H2CMFREEIE_Pos) /*!< 0x00000002 */
#define HSP_SPE_IER_H2CMFREEIE     HSP_SPE_IER_H2CMFREEIE_Msk            /*!< H2CMFREEIE (SPE to CPU message free interrupt enable) */

/********************  Bit definition for HSP_SPE_ISR register  ********************/
/*!< C2HMRDYF configuration */
#define HSP_SPE_ISR_C2HMRDYF_Pos  (0U)
#define HSP_SPE_ISR_C2HMRDYF_Msk  (0x1UL << HSP_SPE_ISR_C2HMRDYF_Pos)  /*!< 0x00000001 */
#define HSP_SPE_ISR_C2HMRDYF      HSP_SPE_ISR_C2HMRDYF_Msk             /*!< C2HMRDYF (CPU to SPE message box status) */
/*!< H2CMFREEF configuration */
#define HSP_SPE_ISR_H2CMFREEF_Pos (1U)
#define HSP_SPE_ISR_H2CMFREEF_Msk (0x1UL << HSP_SPE_ISR_H2CMFREEF_Pos) /*!< 0x00000002 */
#define HSP_SPE_ISR_H2CMFREEF     HSP_SPE_ISR_H2CMFREEF_Msk            /*!< H2CMFREEF (SPE to CPU message box status) */
/*!< RSTREQF configuration */
#define HSP_SPE_ISR_RSTREQF_Pos   (4U)
#define HSP_SPE_ISR_RSTREQF_Msk   (0x1UL << HSP_SPE_ISR_RSTREQF_Pos)   /*!< 0x00000010 */
#define HSP_SPE_ISR_RSTREQF       HSP_SPE_ISR_RSTREQF_Msk              /*!< RSTREQF (HSP reset request) */
/*!< BUF0EVTF configuration */
#define HSP_SPE_ISR_BUF0EVTF_Pos  (12U)
#define HSP_SPE_ISR_BUF0EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF0EVTF_Pos)  /*!< 0x00001000 */
#define HSP_SPE_ISR_BUF0EVTF      HSP_SPE_ISR_BUF0EVTF_Msk             /*!< BUF0EVTF (BUF0 status) */
/*!< BUF1EVTF configuration */
#define HSP_SPE_ISR_BUF1EVTF_Pos  (13U)
#define HSP_SPE_ISR_BUF1EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF1EVTF_Pos)  /*!< 0x00002000 */
#define HSP_SPE_ISR_BUF1EVTF      HSP_SPE_ISR_BUF1EVTF_Msk             /*!< BUF1EVTF (BUF1 status) */
/*!< BUF2EVTF configuration */
#define HSP_SPE_ISR_BUF2EVTF_Pos  (14U)
#define HSP_SPE_ISR_BUF2EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF2EVTF_Pos)  /*!< 0x00004000 */
#define HSP_SPE_ISR_BUF2EVTF      HSP_SPE_ISR_BUF2EVTF_Msk             /*!< BUF2EVTF (BUF2 status) */
/*!< BUF3EVTF configuration */
#define HSP_SPE_ISR_BUF3EVTF_Pos  (15U)
#define HSP_SPE_ISR_BUF3EVTF_Msk  (0x1UL << HSP_SPE_ISR_BUF3EVTF_Pos)  /*!< 0x00008000 */
#define HSP_SPE_ISR_BUF3EVTF      HSP_SPE_ISR_BUF3EVTF_Msk             /*!< BUF3EVTF (BUF3 status) */

/********************  Bit definition for HSP_TCUCFGR register  ********************/
/*!< TSKCMP0 configuration */
#define HSP_TCUCFGR_TSKCMP0_Pos (0U)
#define HSP_TCUCFGR_TSKCMP0_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x0000003F */
#define HSP_TCUCFGR_TSKCMP0     HSP_TCUCFGR_TSKCMP0_Msk             /*!< TSKCMP0[5:0] bits (Task compare 0 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP0_0   (0x01UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000001 */
#define HSP_TCUCFGR_TSKCMP0_1   (0x02UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000002 */
#define HSP_TCUCFGR_TSKCMP0_2   (0x04UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000004 */
#define HSP_TCUCFGR_TSKCMP0_3   (0x08UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000008 */
#define HSP_TCUCFGR_TSKCMP0_4   (0x10UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000010 */
#define HSP_TCUCFGR_TSKCMP0_5   (0x20UL << HSP_TCUCFGR_TSKCMP0_Pos) /*!< 0x00000020 */
/*!< TC0EN configuration */
#define HSP_TCUCFGR_TC0EN_Pos   (7U)
#define HSP_TCUCFGR_TC0EN_Msk   (0x1UL << HSP_TCUCFGR_TC0EN_Pos)    /*!< 0x00000080 */
#define HSP_TCUCFGR_TC0EN       HSP_TCUCFGR_TC0EN_Msk               /*!< TC0EN (Task comparator 0 enable <sup>(1)</sup>) */
/*!< TSKCMP1 configuration */
#define HSP_TCUCFGR_TSKCMP1_Pos (8U)
#define HSP_TCUCFGR_TSKCMP1_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00003F00 */
#define HSP_TCUCFGR_TSKCMP1     HSP_TCUCFGR_TSKCMP1_Msk             /*!< TSKCMP1[5:0] bits (Task compare 1 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP1_0   (0x01UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000100 */
#define HSP_TCUCFGR_TSKCMP1_1   (0x02UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000200 */
#define HSP_TCUCFGR_TSKCMP1_2   (0x04UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000400 */
#define HSP_TCUCFGR_TSKCMP1_3   (0x08UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00000800 */
#define HSP_TCUCFGR_TSKCMP1_4   (0x10UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00001000 */
#define HSP_TCUCFGR_TSKCMP1_5   (0x20UL << HSP_TCUCFGR_TSKCMP1_Pos) /*!< 0x00002000 */
/*!< TC1EN configuration */
#define HSP_TCUCFGR_TC1EN_Pos   (15U)
#define HSP_TCUCFGR_TC1EN_Msk   (0x1UL << HSP_TCUCFGR_TC1EN_Pos)    /*!< 0x00008000 */
#define HSP_TCUCFGR_TC1EN       HSP_TCUCFGR_TC1EN_Msk               /*!< TC1EN (Task comparator 1 enable <sup>(1)</sup>) */
/*!< TSKCMP2 configuration */
#define HSP_TCUCFGR_TSKCMP2_Pos (16U)
#define HSP_TCUCFGR_TSKCMP2_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x003F0000 */
#define HSP_TCUCFGR_TSKCMP2     HSP_TCUCFGR_TSKCMP2_Msk             /*!< TSKCMP2[5:0] bits (Task compare 2 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP2_0   (0x01UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00010000 */
#define HSP_TCUCFGR_TSKCMP2_1   (0x02UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00020000 */
#define HSP_TCUCFGR_TSKCMP2_2   (0x04UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00040000 */
#define HSP_TCUCFGR_TSKCMP2_3   (0x08UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00080000 */
#define HSP_TCUCFGR_TSKCMP2_4   (0x10UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00100000 */
#define HSP_TCUCFGR_TSKCMP2_5   (0x20UL << HSP_TCUCFGR_TSKCMP2_Pos) /*!< 0x00200000 */
/*!< TC2EN configuration */
#define HSP_TCUCFGR_TC2EN_Pos   (23U)
#define HSP_TCUCFGR_TC2EN_Msk   (0x1UL << HSP_TCUCFGR_TC2EN_Pos)    /*!< 0x00800000 */
#define HSP_TCUCFGR_TC2EN       HSP_TCUCFGR_TC2EN_Msk               /*!< TC2EN (Task comparator 2 enable <sup>(1)</sup>) */
/*!< TSKCMP3 configuration */
#define HSP_TCUCFGR_TSKCMP3_Pos (24U)
#define HSP_TCUCFGR_TSKCMP3_Msk (0x3FUL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x3F000000 */
#define HSP_TCUCFGR_TSKCMP3     HSP_TCUCFGR_TSKCMP3_Msk             /*!< TSKCMP3[5:0] bits (Task compare 3 <sup>(1)</sup>) */
#define HSP_TCUCFGR_TSKCMP3_0   (0x01UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x01000000 */
#define HSP_TCUCFGR_TSKCMP3_1   (0x02UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x02000000 */
#define HSP_TCUCFGR_TSKCMP3_2   (0x04UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x04000000 */
#define HSP_TCUCFGR_TSKCMP3_3   (0x08UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x08000000 */
#define HSP_TCUCFGR_TSKCMP3_4   (0x10UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x10000000 */
#define HSP_TCUCFGR_TSKCMP3_5   (0x20UL << HSP_TCUCFGR_TSKCMP3_Pos) /*!< 0x20000000 */
/*!< TC3EN configuration */
#define HSP_TCUCFGR_TC3EN_Pos   (31U)
#define HSP_TCUCFGR_TC3EN_Msk   (0x1UL << HSP_TCUCFGR_TC3EN_Pos)    /*!< 0x80000000 */
#define HSP_TCUCFGR_TC3EN       HSP_TCUCFGR_TC3EN_Msk               /*!< TC3EN (Task comparator 3 enable ) */

