stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_TOVLPCR register  ********************/
/*!< TOVLPEN configuration */
#define HSP_TOVLPCR_TOVLPEN_Pos (0U)
#define HSP_TOVLPCR_TOVLPEN_Msk (0x1UL << HSP_TOVLPCR_TOVLPEN_Pos) /*!< 0x00000001 */
#define HSP_TOVLPCR_TOVLPEN     HSP_TOVLPCR_TOVLPEN_Msk            /*!< TOVLPEN (Task overlap enable <sup>(1)</sup>) */
/*!< LTNB configuration */
#define HSP_TOVLPCR_LTNB_Pos    (8U)
#define HSP_TOVLPCR_LTNB_Msk    (0x3FUL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00003F00 */
#define HSP_TOVLPCR_LTNB        HSP_TOVLPCR_LTNB_Msk               /*!< LTNB[5:0] bits (Lower task number value <sup>(1)</sup>) */
#define HSP_TOVLPCR_LTNB_0      (0x01UL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00000100 */
#define HSP_TOVLPCR_LTNB_1      (0x02UL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00000200 */
#define HSP_TOVLPCR_LTNB_2      (0x04UL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00000400 */
#define HSP_TOVLPCR_LTNB_3      (0x08UL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00000800 */
#define HSP_TOVLPCR_LTNB_4      (0x10UL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00001000 */
#define HSP_TOVLPCR_LTNB_5      (0x20UL << HSP_TOVLPCR_LTNB_Pos)   /*!< 0x00002000 */
/*!< HTNB configuration */
#define HSP_TOVLPCR_HTNB_Pos    (16U)
#define HSP_TOVLPCR_HTNB_Msk    (0x3FUL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x003F0000 */
#define HSP_TOVLPCR_HTNB        HSP_TOVLPCR_HTNB_Msk               /*!< HTNB[5:0] bits (Higher task number value ) */
#define HSP_TOVLPCR_HTNB_0      (0x01UL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x00010000 */
#define HSP_TOVLPCR_HTNB_1      (0x02UL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x00020000 */
#define HSP_TOVLPCR_HTNB_2      (0x04UL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x00040000 */
#define HSP_TOVLPCR_HTNB_3      (0x08UL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x00080000 */
#define HSP_TOVLPCR_HTNB_4      (0x10UL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x00100000 */
#define HSP_TOVLPCR_HTNB_5      (0x20UL << HSP_TOVLPCR_HTNB_Pos)   /*!< 0x00200000 */

/********************  Bit definition for HSP_SNPR register  ********************/
/*!< SNPSELA configuration */
#define HSP_SNPR_SNPSELA_Pos (0U)
#define HSP_SNPR_SNPSELA_Msk (0x7UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000007 */
#define HSP_SNPR_SNPSELA     HSP_SNPR_SNPSELA_Msk            /*!< SNPSELA[2:0] bits (Snoop group A signal selection) */
#define HSP_SNPR_SNPSELA_0   (0x1UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000001 */
#define HSP_SNPR_SNPSELA_1   (0x2UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000002 */
#define HSP_SNPR_SNPSELA_2   (0x4UL << HSP_SNPR_SNPSELA_Pos) /*!< 0x00000004 */
/*!< SNPSELB configuration */
#define HSP_SNPR_SNPSELB_Pos (4U)
#define HSP_SNPR_SNPSELB_Msk (0x7UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000070 */
#define HSP_SNPR_SNPSELB     HSP_SNPR_SNPSELB_Msk            /*!< SNPSELB[2:0] bits (Snoop group B signal selection) */
#define HSP_SNPR_SNPSELB_0   (0x1UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000010 */
#define HSP_SNPR_SNPSELB_1   (0x2UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000020 */
#define HSP_SNPR_SNPSELB_2   (0x4UL << HSP_SNPR_SNPSELB_Pos) /*!< 0x00000040 */

/********************  Bit definition for HSP_CCNTR register  ********************/
/*!< CCNTR configuration */
#define HSP_CCNTR_CCNTR_Pos (0U)
#define HSP_CCNTR_CCNTR_Msk (0xFFFFFFFFUL << HSP_CCNTR_CCNTR_Pos) /*!< 0xFFFFFFFF */
#define HSP_CCNTR_CCNTR     HSP_CCNTR_CCNTR_Msk                   /*!< CCNTR[31:0] bits (Conflict counter) */
#define HSP_CCNTR_CCNTR_0   (0x00001UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000001 */
#define HSP_CCNTR_CCNTR_1   (0x00002UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000002 */
#define HSP_CCNTR_CCNTR_2   (0x00004UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000004 */
#define HSP_CCNTR_CCNTR_3   (0x00008UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000008 */
#define HSP_CCNTR_CCNTR_4   (0x00010UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000010 */
#define HSP_CCNTR_CCNTR_5   (0x00020UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000020 */
#define HSP_CCNTR_CCNTR_6   (0x00040UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000040 */
#define HSP_CCNTR_CCNTR_7   (0x00080UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000080 */
#define HSP_CCNTR_CCNTR_8   (0x00100UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000100 */
#define HSP_CCNTR_CCNTR_9   (0x00200UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000200 */
#define HSP_CCNTR_CCNTR_10  (0x00400UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000400 */
#define HSP_CCNTR_CCNTR_11  (0x00800UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00000800 */
#define HSP_CCNTR_CCNTR_12  (0x01000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00001000 */
#define HSP_CCNTR_CCNTR_13  (0x02000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00002000 */
#define HSP_CCNTR_CCNTR_14  (0x04000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00004000 */
#define HSP_CCNTR_CCNTR_15  (0x08000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00008000 */
#define HSP_CCNTR_CCNTR_16  (0x10000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00010000 */
#define HSP_CCNTR_CCNTR_17  (0x20000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00020000 */
#define HSP_CCNTR_CCNTR_18  (0x40000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00040000 */
#define HSP_CCNTR_CCNTR_19  (0x80000UL << HSP_CCNTR_CCNTR_Pos)    /*!< 0x00080000 */
#define HSP_CCNTR_CCNTR_20  (0x100000UL << HSP_CCNTR_CCNTR_Pos)   /*!< 0x00100000 */
#define HSP_CCNTR_CCNTR_21  (0x200000UL << HSP_CCNTR_CCNTR_Pos)   /*!< 0x00200000 */
#define HSP_CCNTR_CCNTR_22  (0x400000UL << HSP_CCNTR_CCNTR_Pos)   /*!< 0x00400000 */
#define HSP_CCNTR_CCNTR_23  (0x800000UL << HSP_CCNTR_CCNTR_Pos)   /*!< 0x00800000 */
#define HSP_CCNTR_CCNTR_24  (0x1000000UL << HSP_CCNTR_CCNTR_Pos)  /*!< 0x01000000 */
#define HSP_CCNTR_CCNTR_25  (0x2000000UL << HSP_CCNTR_CCNTR_Pos)  /*!< 0x02000000 */
#define HSP_CCNTR_CCNTR_26  (0x4000000UL << HSP_CCNTR_CCNTR_Pos)  /*!< 0x04000000 */
#define HSP_CCNTR_CCNTR_27  (0x8000000UL << HSP_CCNTR_CCNTR_Pos)  /*!< 0x08000000 */
#define HSP_CCNTR_CCNTR_28  (0x10000000UL << HSP_CCNTR_CCNTR_Pos) /*!< 0x10000000 */
#define HSP_CCNTR_CCNTR_29  (0x20000000UL << HSP_CCNTR_CCNTR_Pos) /*!< 0x20000000 */
#define HSP_CCNTR_CCNTR_30  (0x40000000UL << HSP_CCNTR_CCNTR_Pos) /*!< 0x40000000 */
#define HSP_CCNTR_CCNTR_31  (0x80000000UL << HSP_CCNTR_CCNTR_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_CAPDR register  ********************/
/*!< TSTAMP configuration */
#define HSP_CAPDR_TSTAMP_Pos (0U)
#define HSP_CAPDR_TSTAMP_Msk (0x3FFFUL << HSP_CAPDR_TSTAMP_Pos) /*!< 0x00003FFF */
#define HSP_CAPDR_TSTAMP     HSP_CAPDR_TSTAMP_Msk               /*!< TSTAMP[13:0] bits (Time-stamp value) */
#define HSP_CAPDR_TSTAMP_0   (0x001UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000001 */
#define HSP_CAPDR_TSTAMP_1   (0x002UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000002 */
#define HSP_CAPDR_TSTAMP_2   (0x004UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000004 */
#define HSP_CAPDR_TSTAMP_3   (0x008UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000008 */
#define HSP_CAPDR_TSTAMP_4   (0x010UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000010 */
#define HSP_CAPDR_TSTAMP_5   (0x020UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000020 */
#define HSP_CAPDR_TSTAMP_6   (0x040UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000040 */
#define HSP_CAPDR_TSTAMP_7   (0x080UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000080 */
#define HSP_CAPDR_TSTAMP_8   (0x100UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000100 */
#define HSP_CAPDR_TSTAMP_9   (0x200UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000200 */
#define HSP_CAPDR_TSTAMP_10  (0x400UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000400 */
#define HSP_CAPDR_TSTAMP_11  (0x800UL << HSP_CAPDR_TSTAMP_Pos)  /*!< 0x00000800 */
#define HSP_CAPDR_TSTAMP_12  (0x1000UL << HSP_CAPDR_TSTAMP_Pos) /*!< 0x00001000 */
#define HSP_CAPDR_TSTAMP_13  (0x2000UL << HSP_CAPDR_TSTAMP_Pos) /*!< 0x00002000 */
/*!< IFHIST configuration */
#define HSP_CAPDR_IFHIST_Pos (14U)
#define HSP_CAPDR_IFHIST_Msk (0xFFUL << HSP_CAPDR_IFHIST_Pos)   /*!< 0x003FC000 */
#define HSP_CAPDR_IFHIST     HSP_CAPDR_IFHIST_Msk               /*!< IFHIST[7:0] bits (IF condition history) */
#define HSP_CAPDR_IFHIST_0   (0x001UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00004000 */
#define HSP_CAPDR_IFHIST_1   (0x002UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00008000 */
#define HSP_CAPDR_IFHIST_2   (0x004UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00010000 */
#define HSP_CAPDR_IFHIST_3   (0x008UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00020000 */
#define HSP_CAPDR_IFHIST_4   (0x010UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00040000 */
#define HSP_CAPDR_IFHIST_5   (0x020UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00080000 */
#define HSP_CAPDR_IFHIST_6   (0x040UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00100000 */
#define HSP_CAPDR_IFHIST_7   (0x080UL << HSP_CAPDR_IFHIST_Pos)  /*!< 0x00200000 */
/*!< IFCNT configuration */
#define HSP_CAPDR_IFCNT_Pos  (22U)
#define HSP_CAPDR_IFCNT_Msk  (0xFUL << HSP_CAPDR_IFCNT_Pos)     /*!< 0x03C00000 */
#define HSP_CAPDR_IFCNT      HSP_CAPDR_IFCNT_Msk                /*!< IFCNT[3:0] bits (IF instruction counter) */
#define HSP_CAPDR_IFCNT_0    (0x01UL << HSP_CAPDR_IFCNT_Pos)    /*!< 0x00400000 */
#define HSP_CAPDR_IFCNT_1    (0x02UL << HSP_CAPDR_IFCNT_Pos)    /*!< 0x00800000 */
#define HSP_CAPDR_IFCNT_2    (0x04UL << HSP_CAPDR_IFCNT_Pos)    /*!< 0x01000000 */
#define HSP_CAPDR_IFCNT_3    (0x08UL << HSP_CAPDR_IFCNT_Pos)    /*!< 0x02000000 */
/*!< TSKNB configuration */
#define HSP_CAPDR_TSKNB_Pos  (26U)
#define HSP_CAPDR_TSKNB_Msk  (0x3FUL << HSP_CAPDR_TSKNB_Pos)    /*!< 0xFC000000 */
#define HSP_CAPDR_TSKNB      HSP_CAPDR_TSKNB_Msk                /*!< TSKNB[5:0] bits (Last captured task number) */
#define HSP_CAPDR_TSKNB_0    (0x01UL << HSP_CAPDR_TSKNB_Pos)    /*!< 0x04000000 */
#define HSP_CAPDR_TSKNB_1    (0x02UL << HSP_CAPDR_TSKNB_Pos)    /*!< 0x08000000 */
#define HSP_CAPDR_TSKNB_2    (0x04UL << HSP_CAPDR_TSKNB_Pos)    /*!< 0x10000000 */
#define HSP_CAPDR_TSKNB_3    (0x08UL << HSP_CAPDR_TSKNB_Pos)    /*!< 0x20000000 */
#define HSP_CAPDR_TSKNB_4    (0x10UL << HSP_CAPDR_TSKNB_Pos)    /*!< 0x40000000 */
#define HSP_CAPDR_TSKNB_5    (0x20UL << HSP_CAPDR_TSKNB_Pos)    /*!< 0x80000000 */
/*!< PFCTNB configuration */
#define HSP_CAPDR_PFCTNB_Pos (16U)
#define HSP_CAPDR_PFCTNB_Msk (0x3FUL << HSP_CAPDR_PFCTNB_Pos)   /*!< 0x003F0000 */
#define HSP_CAPDR_PFCTNB     HSP_CAPDR_PFCTNB_Msk               /*!< PFCTNB[5:0] bits (Last captured processing function number) */
#define HSP_CAPDR_PFCTNB_0   (0x01UL << HSP_CAPDR_PFCTNB_Pos)   /*!< 0x00010000 */
#define HSP_CAPDR_PFCTNB_1   (0x02UL << HSP_CAPDR_PFCTNB_Pos)   /*!< 0x00020000 */
#define HSP_CAPDR_PFCTNB_2   (0x04UL << HSP_CAPDR_PFCTNB_Pos)   /*!< 0x00040000 */
#define HSP_CAPDR_PFCTNB_3   (0x08UL << HSP_CAPDR_PFCTNB_Pos)   /*!< 0x00080000 */
#define HSP_CAPDR_PFCTNB_4   (0x10UL << HSP_CAPDR_PFCTNB_Pos)   /*!< 0x00100000 */
#define HSP_CAPDR_PFCTNB_5   (0x20UL << HSP_CAPDR_PFCTNB_Pos)   /*!< 0x00200000 */

/********************  Bit definition for HSP_CAPCR register  ********************/
/*!< CAPMOD configuration */
#define HSP_CAPCR_CAPMOD_Pos  (0U)
#define HSP_CAPCR_CAPMOD_Msk  (0x3UL << HSP_CAPCR_CAPMOD_Pos)  /*!< 0x00000003 */
#define HSP_CAPCR_CAPMOD      HSP_CAPCR_CAPMOD_Msk             /*!< CAPMOD[1:0] bits (Capture mode ) */
#define HSP_CAPCR_CAPMOD_0    (0x1UL << HSP_CAPCR_CAPMOD_Pos)  /*!< 0x00000001 */
#define HSP_CAPCR_CAPMOD_1    (0x2UL << HSP_CAPCR_CAPMOD_Pos)  /*!< 0x00000002 */
/*!< FRCNTEN configuration */
#define HSP_CAPCR_FRCNTEN_Pos (2U)
#define HSP_CAPCR_FRCNTEN_Msk (0x1UL << HSP_CAPCR_FRCNTEN_Pos) /*!< 0x00000004 */
#define HSP_CAPCR_FRCNTEN     HSP_CAPCR_FRCNTEN_Msk            /*!< FRCNTEN (Free-running counter enable ) */
/*!< PRESC configuration */
#define HSP_CAPCR_PRESC_Pos   (4U)
#define HSP_CAPCR_PRESC_Msk   (0x1FUL << HSP_CAPCR_PRESC_Pos)  /*!< 0x000001F0 */
#define HSP_CAPCR_PRESC       HSP_CAPCR_PRESC_Msk              /*!< PRESC[4:0] bits (Time-stamp prescaler value ) */
#define HSP_CAPCR_PRESC_0     (0x01UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000010 */
#define HSP_CAPCR_PRESC_1     (0x02UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000020 */
#define HSP_CAPCR_PRESC_2     (0x04UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000040 */
#define HSP_CAPCR_PRESC_3     (0x08UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000080 */
#define HSP_CAPCR_PRESC_4     (0x10UL << HSP_CAPCR_PRESC_Pos)  /*!< 0x00000100 */
/*!< TSKFLT configuration */
#define HSP_CAPCR_TSKFLT_Pos  (12U)
#define HSP_CAPCR_TSKFLT_Msk  (0x1UL << HSP_CAPCR_TSKFLT_Pos)  /*!< 0x00001000 */
#define HSP_CAPCR_TSKFLT      HSP_CAPCR_TSKFLT_Msk             /*!< TSKFLT (Task filter enable <sup>(1)</sup>) */
/*!< CCNTREN configuration */
#define HSP_CAPCR_CCNTREN_Pos (16U)
#define HSP_CAPCR_CCNTREN_Msk (0x1UL << HSP_CAPCR_CCNTREN_Pos) /*!< 0x00010000 */
#define HSP_CAPCR_CCNTREN     HSP_CAPCR_CCNTREN_Msk            /*!< CCNTREN (Conflict counter enable ) */

/********************  Bit definition for HSP_ERR_IER register  ********************/
/*!< TRGIOVRIE configuration */
#define HSP_ERR_IER_TRGIOVRIE_Pos (8U)
#define HSP_ERR_IER_TRGIOVRIE_Msk (0x1UL << HSP_ERR_IER_TRGIOVRIE_Pos) /*!< 0x00000100 */
#define HSP_ERR_IER_TRGIOVRIE     HSP_ERR_IER_TRGIOVRIE_Msk            /*!< TRGIOVRIE (TRGITF overrun interrupt enable) */
/*!< B0ERRIE configuration */
#define HSP_ERR_IER_B0ERRIE_Pos   (12U)
#define HSP_ERR_IER_B0ERRIE_Msk   (0x1UL << HSP_ERR_IER_B0ERRIE_Pos)   /*!< 0x00001000 */
#define HSP_ERR_IER_B0ERRIE       HSP_ERR_IER_B0ERRIE_Msk              /*!< B0ERRIE (H2CBUFF0 underrun or C2HBUFF0 overrun interrupt enable) */
/*!< B1ERRIE configuration */
#define HSP_ERR_IER_B1ERRIE_Pos   (13U)
#define HSP_ERR_IER_B1ERRIE_Msk   (0x1UL << HSP_ERR_IER_B1ERRIE_Pos)   /*!< 0x00002000 */
#define HSP_ERR_IER_B1ERRIE       HSP_ERR_IER_B1ERRIE_Msk              /*!< B1ERRIE (H2CBUFF1 underrun or C2HBUFF1 overrun interrupt enable) */
/*!< B2ERRIE configuration */
#define HSP_ERR_IER_B2ERRIE_Pos   (14U)
#define HSP_ERR_IER_B2ERRIE_Msk   (0x1UL << HSP_ERR_IER_B2ERRIE_Pos)   /*!< 0x00004000 */
#define HSP_ERR_IER_B2ERRIE       HSP_ERR_IER_B2ERRIE_Msk              /*!< B2ERRIE (H2CBUFF2 underrun or C2HBUFF2 overrun interrupt enable) */
/*!< B3ERRIE configuration */
#define HSP_ERR_IER_B3ERRIE_Pos   (15U)
#define HSP_ERR_IER_B3ERRIE_Msk   (0x1UL << HSP_ERR_IER_B3ERRIE_Pos)   /*!< 0x00008000 */
#define HSP_ERR_IER_B3ERRIE       HSP_ERR_IER_B3ERRIE_Msk              /*!< B3ERRIE (H2CBUFF3 underrun or C2HBUFF3 overrun interrupt enable) */
/*!< CAPOVRIE configuration */
#define HSP_ERR_IER_CAPOVRIE_Pos  (16U)
#define HSP_ERR_IER_CAPOVRIE_Msk  (0x1UL << HSP_ERR_IER_CAPOVRIE_Pos)  /*!< 0x00010000 */
#define HSP_ERR_IER_CAPOVRIE      HSP_ERR_IER_CAPOVRIE_Msk             /*!< CAPOVRIE (Capture register overrun interrupt enable) */
/*!< FWERRIE configuration */
#define HSP_ERR_IER_FWERRIE_Pos   (17U)
#define HSP_ERR_IER_FWERRIE_Msk   (0x1UL << HSP_ERR_IER_FWERRIE_Pos)   /*!< 0x00020000 */
#define HSP_ERR_IER_FWERRIE       HSP_ERR_IER_FWERRIE_Msk              /*!< FWERRIE (Firmware error interrupt enable) */
/*!< SCHERRIE configuration */
#define HSP_ERR_IER_SCHERRIE_Pos  (18U)
#define HSP_ERR_IER_SCHERRIE_Msk  (0x1UL << HSP_ERR_IER_SCHERRIE_Pos)  /*!< 0x00040000 */
#define HSP_ERR_IER_SCHERRIE      HSP_ERR_IER_SCHERRIE_Msk             /*!< SCHERRIE (Scheduler error interrupt enable) */
/*!< BKINIE configuration */
#define HSP_ERR_IER_BKINIE_Pos    (19U)
#define HSP_ERR_IER_BKINIE_Msk    (0x1UL << HSP_ERR_IER_BKINIE_Pos)    /*!< 0x00080000 */
#define HSP_ERR_IER_BKINIE        HSP_ERR_IER_BKINIE_Msk               /*!< BKINIE (Break input interrupt enable) */
/*!< HDEGOVRIE configuration */
#define HSP_ERR_IER_HDEGOVRIE_Pos (20U)
#define HSP_ERR_IER_HDEGOVRIE_Msk (0x1UL << HSP_ERR_IER_HDEGOVRIE_Pos) /*!< 0x00100000 */
#define HSP_ERR_IER_HDEGOVRIE     HSP_ERR_IER_HDEGOVRIE_Msk            /*!< HDEGOVRIE (SPE event overrun interrupt enable) */
/*!< OPCOERRIE configuration */
#define HSP_ERR_IER_OPCOERRIE_Pos (22U)
#define HSP_ERR_IER_OPCOERRIE_Msk (0x1UL << HSP_ERR_IER_OPCOERRIE_Pos) /*!< 0x00400000 */
#define HSP_ERR_IER_OPCOERRIE     HSP_ERR_IER_OPCOERRIE_Msk            /*!< OPCOERRIE (Invalid Op. code error interrupt enable) */
/*!< ACCERRIE configuration */
#define HSP_ERR_IER_ACCERRIE_Pos  (23U)
#define HSP_ERR_IER_ACCERRIE_Msk  (0x1UL << HSP_ERR_IER_ACCERRIE_Pos)  /*!< 0x00800000 */
#define HSP_ERR_IER_ACCERRIE      HSP_ERR_IER_ACCERRIE_Msk             /*!< ACCERRIE (SPE access error interrupt enable) */
/*!< UDFIE configuration */
#define HSP_ERR_IER_UDFIE_Pos     (24U)
#define HSP_ERR_IER_UDFIE_Msk     (0x1UL << HSP_ERR_IER_UDFIE_Pos)     /*!< 0x01000000 */
#define HSP_ERR_IER_UDFIE         HSP_ERR_IER_UDFIE_Msk                /*!< UDFIE (FPU Underflow exception interrupt enable) */
/*!< OVFIE configuration */
#define HSP_ERR_IER_OVFIE_Pos     (25U)
#define HSP_ERR_IER_OVFIE_Msk     (0x1UL << HSP_ERR_IER_OVFIE_Pos)     /*!< 0x02000000 */
#define HSP_ERR_IER_OVFIE         HSP_ERR_IER_OVFIE_Msk                /*!< OVFIE (FPU Overflow exception interrupt enable) */
/*!< DBZIE configuration */
#define HSP_ERR_IER_DBZIE_Pos     (26U)
#define HSP_ERR_IER_DBZIE_Msk     (0x1UL << HSP_ERR_IER_DBZIE_Pos)     /*!< 0x04000000 */
#define HSP_ERR_IER_DBZIE         HSP_ERR_IER_DBZIE_Msk                /*!< DBZIE (FPU division-by-zero exception interrupt enable) */
/*!< INVIE configuration */
#define HSP_ERR_IER_INVIE_Pos     (27U)
#define HSP_ERR_IER_INVIE_Msk     (0x1UL << HSP_ERR_IER_INVIE_Pos)     /*!< 0x08000000 */
#define HSP_ERR_IER_INVIE         HSP_ERR_IER_INVIE_Msk                /*!< INVIE (FPU Invalid exception interrupt enable) */
/*!< DENORMIE configuration */
#define HSP_ERR_IER_DENORMIE_Pos  (28U)
#define HSP_ERR_IER_DENORMIE_Msk  (0x1UL << HSP_ERR_IER_DENORMIE_Pos)  /*!< 0x10000000 */
#define HSP_ERR_IER_DENORMIE      HSP_ERR_IER_DENORMIE_Msk             /*!< DENORMIE (FPU denormal interrupt enable) */

