stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for HSP_FWVERR register  ********************/
/*!< CROMINREV configuration */
#define HSP_FWVERR_CROMINREV_Pos (0U)
#define HSP_FWVERR_CROMINREV_Msk (0xFUL << HSP_FWVERR_CROMINREV_Pos)  /*!< 0x0000000F */
#define HSP_FWVERR_CROMINREV     HSP_FWVERR_CROMINREV_Msk             /*!< CROMINREV[3:0] bits (Code ROM Minor revision) */
#define HSP_FWVERR_CROMINREV_0   (0x01UL << HSP_FWVERR_CROMINREV_Pos) /*!< 0x00000001 */
#define HSP_FWVERR_CROMINREV_1   (0x02UL << HSP_FWVERR_CROMINREV_Pos) /*!< 0x00000002 */
#define HSP_FWVERR_CROMINREV_2   (0x04UL << HSP_FWVERR_CROMINREV_Pos) /*!< 0x00000004 */
#define HSP_FWVERR_CROMINREV_3   (0x08UL << HSP_FWVERR_CROMINREV_Pos) /*!< 0x00000008 */
/*!< CROMAJREV configuration */
#define HSP_FWVERR_CROMAJREV_Pos (4U)
#define HSP_FWVERR_CROMAJREV_Msk (0xFUL << HSP_FWVERR_CROMAJREV_Pos)  /*!< 0x000000F0 */
#define HSP_FWVERR_CROMAJREV     HSP_FWVERR_CROMAJREV_Msk             /*!< CROMAJREV[3:0] bits (Code ROM Major revision) */
#define HSP_FWVERR_CROMAJREV_0   (0x01UL << HSP_FWVERR_CROMAJREV_Pos) /*!< 0x00000010 */
#define HSP_FWVERR_CROMAJREV_1   (0x02UL << HSP_FWVERR_CROMAJREV_Pos) /*!< 0x00000020 */
#define HSP_FWVERR_CROMAJREV_2   (0x04UL << HSP_FWVERR_CROMAJREV_Pos) /*!< 0x00000040 */
#define HSP_FWVERR_CROMAJREV_3   (0x08UL << HSP_FWVERR_CROMAJREV_Pos) /*!< 0x00000080 */
/*!< CRAMINREV configuration */
#define HSP_FWVERR_CRAMINREV_Pos (8U)
#define HSP_FWVERR_CRAMINREV_Msk (0xFUL << HSP_FWVERR_CRAMINREV_Pos)  /*!< 0x00000F00 */
#define HSP_FWVERR_CRAMINREV     HSP_FWVERR_CRAMINREV_Msk             /*!< CRAMINREV[3:0] bits (Code RAM Minor revision) */
#define HSP_FWVERR_CRAMINREV_0   (0x01UL << HSP_FWVERR_CRAMINREV_Pos) /*!< 0x00000100 */
#define HSP_FWVERR_CRAMINREV_1   (0x02UL << HSP_FWVERR_CRAMINREV_Pos) /*!< 0x00000200 */
#define HSP_FWVERR_CRAMINREV_2   (0x04UL << HSP_FWVERR_CRAMINREV_Pos) /*!< 0x00000400 */
#define HSP_FWVERR_CRAMINREV_3   (0x08UL << HSP_FWVERR_CRAMINREV_Pos) /*!< 0x00000800 */
/*!< CRAMAJREV configuration */
#define HSP_FWVERR_CRAMAJREV_Pos (12U)
#define HSP_FWVERR_CRAMAJREV_Msk (0xFUL << HSP_FWVERR_CRAMAJREV_Pos)  /*!< 0x0000F000 */
#define HSP_FWVERR_CRAMAJREV     HSP_FWVERR_CRAMAJREV_Msk             /*!< CRAMAJREV[3:0] bits (Code RAM Major revision) */
#define HSP_FWVERR_CRAMAJREV_0   (0x01UL << HSP_FWVERR_CRAMAJREV_Pos) /*!< 0x00001000 */
#define HSP_FWVERR_CRAMAJREV_1   (0x02UL << HSP_FWVERR_CRAMAJREV_Pos) /*!< 0x00002000 */
#define HSP_FWVERR_CRAMAJREV_2   (0x04UL << HSP_FWVERR_CRAMAJREV_Pos) /*!< 0x00004000 */
#define HSP_FWVERR_CRAMAJREV_3   (0x08UL << HSP_FWVERR_CRAMAJREV_Pos) /*!< 0x00008000 */
/*!< DROMINREV configuration */
#define HSP_FWVERR_DROMINREV_Pos (16U)
#define HSP_FWVERR_DROMINREV_Msk (0xFUL << HSP_FWVERR_DROMINREV_Pos)  /*!< 0x000F0000 */
#define HSP_FWVERR_DROMINREV     HSP_FWVERR_DROMINREV_Msk             /*!< DROMINREV[3:0] bits (Data ROM Minor revision) */
#define HSP_FWVERR_DROMINREV_0   (0x01UL << HSP_FWVERR_DROMINREV_Pos) /*!< 0x00010000 */
#define HSP_FWVERR_DROMINREV_1   (0x02UL << HSP_FWVERR_DROMINREV_Pos) /*!< 0x00020000 */
#define HSP_FWVERR_DROMINREV_2   (0x04UL << HSP_FWVERR_DROMINREV_Pos) /*!< 0x00040000 */
#define HSP_FWVERR_DROMINREV_3   (0x08UL << HSP_FWVERR_DROMINREV_Pos) /*!< 0x00080000 */
/*!< DROMAJREV configuration */
#define HSP_FWVERR_DROMAJREV_Pos (20U)
#define HSP_FWVERR_DROMAJREV_Msk (0xFUL << HSP_FWVERR_DROMAJREV_Pos)  /*!< 0x00F00000 */
#define HSP_FWVERR_DROMAJREV     HSP_FWVERR_DROMAJREV_Msk             /*!< DROMAJREV[3:0] bits (Data ROM Major revision) */
#define HSP_FWVERR_DROMAJREV_0   (0x01UL << HSP_FWVERR_DROMAJREV_Pos) /*!< 0x00100000 */
#define HSP_FWVERR_DROMAJREV_1   (0x02UL << HSP_FWVERR_DROMAJREV_Pos) /*!< 0x00200000 */
#define HSP_FWVERR_DROMAJREV_2   (0x04UL << HSP_FWVERR_DROMAJREV_Pos) /*!< 0x00400000 */
#define HSP_FWVERR_DROMAJREV_3   (0x08UL << HSP_FWVERR_DROMAJREV_Pos) /*!< 0x00800000 */

/********************  Bit definition for HSP_SPEVERR register  ********************/
/*!< SPEVER configuration */
#define HSP_SPEVERR_SPEVER_Pos (0U)
#define HSP_SPEVERR_SPEVER_Msk (0xFFFFFFFFUL << HSP_SPEVERR_SPEVER_Pos) /*!< 0xFFFFFFFF */
#define HSP_SPEVERR_SPEVER     HSP_SPEVERR_SPEVER_Msk                   /*!< SPEVER[31:0] bits (SPE version ) */
#define HSP_SPEVERR_SPEVER_0   (0x00001UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000001 */
#define HSP_SPEVERR_SPEVER_1   (0x00002UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000002 */
#define HSP_SPEVERR_SPEVER_2   (0x00004UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000004 */
#define HSP_SPEVERR_SPEVER_3   (0x00008UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000008 */
#define HSP_SPEVERR_SPEVER_4   (0x00010UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000010 */
#define HSP_SPEVERR_SPEVER_5   (0x00020UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000020 */
#define HSP_SPEVERR_SPEVER_6   (0x00040UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000040 */
#define HSP_SPEVERR_SPEVER_7   (0x00080UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000080 */
#define HSP_SPEVERR_SPEVER_8   (0x00100UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000100 */
#define HSP_SPEVERR_SPEVER_9   (0x00200UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000200 */
#define HSP_SPEVERR_SPEVER_10  (0x00400UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000400 */
#define HSP_SPEVERR_SPEVER_11  (0x00800UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00000800 */
#define HSP_SPEVERR_SPEVER_12  (0x01000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00001000 */
#define HSP_SPEVERR_SPEVER_13  (0x02000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00002000 */
#define HSP_SPEVERR_SPEVER_14  (0x04000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00004000 */
#define HSP_SPEVERR_SPEVER_15  (0x08000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00008000 */
#define HSP_SPEVERR_SPEVER_16  (0x10000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00010000 */
#define HSP_SPEVERR_SPEVER_17  (0x20000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00020000 */
#define HSP_SPEVERR_SPEVER_18  (0x40000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00040000 */
#define HSP_SPEVERR_SPEVER_19  (0x80000UL << HSP_SPEVERR_SPEVER_Pos)    /*!< 0x00080000 */
#define HSP_SPEVERR_SPEVER_20  (0x100000UL << HSP_SPEVERR_SPEVER_Pos)   /*!< 0x00100000 */
#define HSP_SPEVERR_SPEVER_21  (0x200000UL << HSP_SPEVERR_SPEVER_Pos)   /*!< 0x00200000 */
#define HSP_SPEVERR_SPEVER_22  (0x400000UL << HSP_SPEVERR_SPEVER_Pos)   /*!< 0x00400000 */
#define HSP_SPEVERR_SPEVER_23  (0x800000UL << HSP_SPEVERR_SPEVER_Pos)   /*!< 0x00800000 */
#define HSP_SPEVERR_SPEVER_24  (0x1000000UL << HSP_SPEVERR_SPEVER_Pos)  /*!< 0x01000000 */
#define HSP_SPEVERR_SPEVER_25  (0x2000000UL << HSP_SPEVERR_SPEVER_Pos)  /*!< 0x02000000 */
#define HSP_SPEVERR_SPEVER_26  (0x4000000UL << HSP_SPEVERR_SPEVER_Pos)  /*!< 0x04000000 */
#define HSP_SPEVERR_SPEVER_27  (0x8000000UL << HSP_SPEVERR_SPEVER_Pos)  /*!< 0x08000000 */
#define HSP_SPEVERR_SPEVER_28  (0x10000000UL << HSP_SPEVERR_SPEVER_Pos) /*!< 0x10000000 */
#define HSP_SPEVERR_SPEVER_29  (0x20000000UL << HSP_SPEVERR_SPEVER_Pos) /*!< 0x20000000 */
#define HSP_SPEVERR_SPEVER_30  (0x40000000UL << HSP_SPEVERR_SPEVER_Pos) /*!< 0x40000000 */
#define HSP_SPEVERR_SPEVER_31  (0x80000000UL << HSP_SPEVERR_SPEVER_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_HWCFGR4 register  ********************/
/*!< NUM_DMA_REQ configuration */
#define HSP_HWCFGR4_NUM_DMA_REQ_Pos (0U)
#define HSP_HWCFGR4_NUM_DMA_REQ_Msk (0xFFUL << HSP_HWCFGR4_NUM_DMA_REQ_Pos)  /*!< 0x000000FF */
#define HSP_HWCFGR4_NUM_DMA_REQ     HSP_HWCFGR4_NUM_DMA_REQ_Msk              /*!< NUM_DMA_REQ[7:0] bits (Number of DMA request supported) */
#define HSP_HWCFGR4_NUM_DMA_REQ_0   (0x001UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000001 */
#define HSP_HWCFGR4_NUM_DMA_REQ_1   (0x002UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000002 */
#define HSP_HWCFGR4_NUM_DMA_REQ_2   (0x004UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000004 */
#define HSP_HWCFGR4_NUM_DMA_REQ_3   (0x008UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000008 */
#define HSP_HWCFGR4_NUM_DMA_REQ_4   (0x010UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000010 */
#define HSP_HWCFGR4_NUM_DMA_REQ_5   (0x020UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000020 */
#define HSP_HWCFGR4_NUM_DMA_REQ_6   (0x040UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000040 */
#define HSP_HWCFGR4_NUM_DMA_REQ_7   (0x080UL << HSP_HWCFGR4_NUM_DMA_REQ_Pos) /*!< 0x00000080 */
/*!< NO_DMA_STI configuration */
#define HSP_HWCFGR4_NO_DMA_STI_Pos  (8U)
#define HSP_HWCFGR4_NO_DMA_STI_Msk  (0xFUL << HSP_HWCFGR4_NO_DMA_STI_Pos)    /*!< 0x00000F00 */
#define HSP_HWCFGR4_NO_DMA_STI      HSP_HWCFGR4_NO_DMA_STI_Msk               /*!< NO_DMA_STI[3:0] bits (HSPDMA and STI implementation) */
#define HSP_HWCFGR4_NO_DMA_STI_0    (0x01UL << HSP_HWCFGR4_NO_DMA_STI_Pos)   /*!< 0x00000100 */
#define HSP_HWCFGR4_NO_DMA_STI_1    (0x02UL << HSP_HWCFGR4_NO_DMA_STI_Pos)   /*!< 0x00000200 */
#define HSP_HWCFGR4_NO_DMA_STI_2    (0x04UL << HSP_HWCFGR4_NO_DMA_STI_Pos)   /*!< 0x00000400 */
#define HSP_HWCFGR4_NO_DMA_STI_3    (0x08UL << HSP_HWCFGR4_NO_DMA_STI_Pos)   /*!< 0x00000800 */

/********************  Bit definition for HSP_HWCFGR3 register  ********************/
/*!< NUM_STIAP configuration */
#define HSP_HWCFGR3_NUM_STIAP_Pos    (0U)
#define HSP_HWCFGR3_NUM_STIAP_Msk    (0xFUL << HSP_HWCFGR3_NUM_STIAP_Pos)     /*!< 0x0000000F */
#define HSP_HWCFGR3_NUM_STIAP        HSP_HWCFGR3_NUM_STIAP_Msk                /*!< NUM_STIAP[3:0] bits (Number of STI_AP ports) */
#define HSP_HWCFGR3_NUM_STIAP_0      (0x01UL << HSP_HWCFGR3_NUM_STIAP_Pos)    /*!< 0x00000001 */
#define HSP_HWCFGR3_NUM_STIAP_1      (0x02UL << HSP_HWCFGR3_NUM_STIAP_Pos)    /*!< 0x00000002 */
#define HSP_HWCFGR3_NUM_STIAP_2      (0x04UL << HSP_HWCFGR3_NUM_STIAP_Pos)    /*!< 0x00000004 */
#define HSP_HWCFGR3_NUM_STIAP_3      (0x08UL << HSP_HWCFGR3_NUM_STIAP_Pos)    /*!< 0x00000008 */
/*!< NUM_STIHP configuration */
#define HSP_HWCFGR3_NUM_STIHP_Pos    (4U)
#define HSP_HWCFGR3_NUM_STIHP_Msk    (0xFUL << HSP_HWCFGR3_NUM_STIHP_Pos)     /*!< 0x000000F0 */
#define HSP_HWCFGR3_NUM_STIHP        HSP_HWCFGR3_NUM_STIHP_Msk                /*!< NUM_STIHP[3:0] bits (Number of STI_HP ports) */
#define HSP_HWCFGR3_NUM_STIHP_0      (0x01UL << HSP_HWCFGR3_NUM_STIHP_Pos)    /*!< 0x00000010 */
#define HSP_HWCFGR3_NUM_STIHP_1      (0x02UL << HSP_HWCFGR3_NUM_STIHP_Pos)    /*!< 0x00000020 */
#define HSP_HWCFGR3_NUM_STIHP_2      (0x04UL << HSP_HWCFGR3_NUM_STIHP_Pos)    /*!< 0x00000040 */
#define HSP_HWCFGR3_NUM_STIHP_3      (0x08UL << HSP_HWCFGR3_NUM_STIHP_Pos)    /*!< 0x00000080 */
/*!< NUM_TRIG configuration */
#define HSP_HWCFGR3_NUM_TRIG_Pos     (8U)
#define HSP_HWCFGR3_NUM_TRIG_Msk     (0xFFUL << HSP_HWCFGR3_NUM_TRIG_Pos)     /*!< 0x0000FF00 */
#define HSP_HWCFGR3_NUM_TRIG         HSP_HWCFGR3_NUM_TRIG_Msk                 /*!< NUM_TRIG[7:0] bits (Number of trigger inputs) */
#define HSP_HWCFGR3_NUM_TRIG_0       (0x001UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00000100 */
#define HSP_HWCFGR3_NUM_TRIG_1       (0x002UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00000200 */
#define HSP_HWCFGR3_NUM_TRIG_2       (0x004UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00000400 */
#define HSP_HWCFGR3_NUM_TRIG_3       (0x008UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00000800 */
#define HSP_HWCFGR3_NUM_TRIG_4       (0x010UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00001000 */
#define HSP_HWCFGR3_NUM_TRIG_5       (0x020UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00002000 */
#define HSP_HWCFGR3_NUM_TRIG_6       (0x040UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00004000 */
#define HSP_HWCFGR3_NUM_TRIG_7       (0x080UL << HSP_HWCFGR3_NUM_TRIG_Pos)    /*!< 0x00008000 */
/*!< NUM_TSK_MAX configuration */
#define HSP_HWCFGR3_NUM_TSK_MAX_Pos  (16U)
#define HSP_HWCFGR3_NUM_TSK_MAX_Msk  (0xFFUL << HSP_HWCFGR3_NUM_TSK_MAX_Pos)  /*!< 0x00FF0000 */
#define HSP_HWCFGR3_NUM_TSK_MAX      HSP_HWCFGR3_NUM_TSK_MAX_Msk              /*!< NUM_TSK_MAX[7:0] bits (Maximum number of tasks supported) */
#define HSP_HWCFGR3_NUM_TSK_MAX_0    (0x001UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00010000 */
#define HSP_HWCFGR3_NUM_TSK_MAX_1    (0x002UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00020000 */
#define HSP_HWCFGR3_NUM_TSK_MAX_2    (0x004UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00040000 */
#define HSP_HWCFGR3_NUM_TSK_MAX_3    (0x008UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00080000 */
#define HSP_HWCFGR3_NUM_TSK_MAX_4    (0x010UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00100000 */
#define HSP_HWCFGR3_NUM_TSK_MAX_5    (0x020UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00200000 */
#define HSP_HWCFGR3_NUM_TSK_MAX_6    (0x040UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00400000 */
#define HSP_HWCFGR3_NUM_TSK_MAX_7    (0x080UL << HSP_HWCFGR3_NUM_TSK_MAX_Pos) /*!< 0x00800000 */
/*!< TSK_OFF_SIZE configuration */
#define HSP_HWCFGR3_TSK_OFF_SIZE_Pos (24U)
#define HSP_HWCFGR3_TSK_OFF_SIZE_Msk (0xFUL << HSP_HWCFGR3_TSK_OFF_SIZE_Pos)  /*!< 0x0F000000 */
#define HSP_HWCFGR3_TSK_OFF_SIZE     HSP_HWCFGR3_TSK_OFF_SIZE_Msk             /*!< TSK_OFF_SIZE[3:0] bits (Size of task offset values) */
#define HSP_HWCFGR3_TSK_OFF_SIZE_0   (0x01UL << HSP_HWCFGR3_TSK_OFF_SIZE_Pos) /*!< 0x01000000 */
#define HSP_HWCFGR3_TSK_OFF_SIZE_1   (0x02UL << HSP_HWCFGR3_TSK_OFF_SIZE_Pos) /*!< 0x02000000 */
#define HSP_HWCFGR3_TSK_OFF_SIZE_2   (0x04UL << HSP_HWCFGR3_TSK_OFF_SIZE_Pos) /*!< 0x04000000 */
#define HSP_HWCFGR3_TSK_OFF_SIZE_3   (0x08UL << HSP_HWCFGR3_TSK_OFF_SIZE_Pos) /*!< 0x08000000 */
/*!< NUM_ADC configuration */
#define HSP_HWCFGR3_NUM_ADC_Pos      (28U)
#define HSP_HWCFGR3_NUM_ADC_Msk      (0xFUL << HSP_HWCFGR3_NUM_ADC_Pos)       /*!< 0xF0000000 */
#define HSP_HWCFGR3_NUM_ADC          HSP_HWCFGR3_NUM_ADC_Msk                  /*!< NUM_ADC[3:0] bits (Number of ADC parallel interfaces) */
#define HSP_HWCFGR3_NUM_ADC_0        (0x01UL << HSP_HWCFGR3_NUM_ADC_Pos)      /*!< 0x10000000 */
#define HSP_HWCFGR3_NUM_ADC_1        (0x02UL << HSP_HWCFGR3_NUM_ADC_Pos)      /*!< 0x20000000 */
#define HSP_HWCFGR3_NUM_ADC_2        (0x04UL << HSP_HWCFGR3_NUM_ADC_Pos)      /*!< 0x40000000 */
#define HSP_HWCFGR3_NUM_ADC_3        (0x08UL << HSP_HWCFGR3_NUM_ADC_Pos)      /*!< 0x80000000 */

/********************  Bit definition for HSP_HWCFGR2 register  ********************/
/*!< OPTION_REGOUT configuration */
#define HSP_HWCFGR2_OPTION_REGOUT_Pos  (0U)
#define HSP_HWCFGR2_OPTION_REGOUT_Msk  (0xFFUL << HSP_HWCFGR2_OPTION_REGOUT_Pos)  /*!< 0x000000FF */
#define HSP_HWCFGR2_OPTION_REGOUT      HSP_HWCFGR2_OPTION_REGOUT_Msk              /*!< OPTION_REGOUT[7:0] bits (Support of HSP_OR register) */
#define HSP_HWCFGR2_OPTION_REGOUT_0    (0x001UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000001 */
#define HSP_HWCFGR2_OPTION_REGOUT_1    (0x002UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000002 */
#define HSP_HWCFGR2_OPTION_REGOUT_2    (0x004UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000004 */
#define HSP_HWCFGR2_OPTION_REGOUT_3    (0x008UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000008 */
#define HSP_HWCFGR2_OPTION_REGOUT_4    (0x010UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000010 */
#define HSP_HWCFGR2_OPTION_REGOUT_5    (0x020UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000020 */
#define HSP_HWCFGR2_OPTION_REGOUT_6    (0x040UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000040 */
#define HSP_HWCFGR2_OPTION_REGOUT_7    (0x080UL << HSP_HWCFGR2_OPTION_REGOUT_Pos) /*!< 0x00000080 */
/*!< NUM_RESYNC_FFS configuration */
#define HSP_HWCFGR2_NUM_RESYNC_FFS_Pos (8U)
#define HSP_HWCFGR2_NUM_RESYNC_FFS_Msk (0xFUL << HSP_HWCFGR2_NUM_RESYNC_FFS_Pos)  /*!< 0x00000F00 */
#define HSP_HWCFGR2_NUM_RESYNC_FFS     HSP_HWCFGR2_NUM_RESYNC_FFS_Msk             /*!< NUM_RESYNC_FFS[3:0] bits (Number of resynchronization flops for Clock Domain Crossing synchronizers.) */
#define HSP_HWCFGR2_NUM_RESYNC_FFS_0   (0x01UL << HSP_HWCFGR2_NUM_RESYNC_FFS_Pos) /*!< 0x00000100 */
#define HSP_HWCFGR2_NUM_RESYNC_FFS_1   (0x02UL << HSP_HWCFGR2_NUM_RESYNC_FFS_Pos) /*!< 0x00000200 */
#define HSP_HWCFGR2_NUM_RESYNC_FFS_2   (0x04UL << HSP_HWCFGR2_NUM_RESYNC_FFS_Pos) /*!< 0x00000400 */
#define HSP_HWCFGR2_NUM_RESYNC_FFS_3   (0x08UL << HSP_HWCFGR2_NUM_RESYNC_FFS_Pos) /*!< 0x00000800 */
/*!< DROM_SIZE configuration */
#define HSP_HWCFGR2_DROM_SIZE_Pos      (16U)
#define HSP_HWCFGR2_DROM_SIZE_Msk      (0xFFUL << HSP_HWCFGR2_DROM_SIZE_Pos)      /*!< 0x00FF0000 */
#define HSP_HWCFGR2_DROM_SIZE          HSP_HWCFGR2_DROM_SIZE_Msk                  /*!< DROM_SIZE[7:0] bits (DROM Size) */
#define HSP_HWCFGR2_DROM_SIZE_0        (0x001UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00010000 */
#define HSP_HWCFGR2_DROM_SIZE_1        (0x002UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00020000 */
#define HSP_HWCFGR2_DROM_SIZE_2        (0x004UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00040000 */
#define HSP_HWCFGR2_DROM_SIZE_3        (0x008UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00080000 */
#define HSP_HWCFGR2_DROM_SIZE_4        (0x010UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00100000 */
#define HSP_HWCFGR2_DROM_SIZE_5        (0x020UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00200000 */
#define HSP_HWCFGR2_DROM_SIZE_6        (0x040UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00400000 */
#define HSP_HWCFGR2_DROM_SIZE_7        (0x080UL << HSP_HWCFGR2_DROM_SIZE_Pos)     /*!< 0x00800000 */
/*!< CROM_SIZE configuration */
#define HSP_HWCFGR2_CROM_SIZE_Pos      (24U)
#define HSP_HWCFGR2_CROM_SIZE_Msk      (0xFFUL << HSP_HWCFGR2_CROM_SIZE_Pos)      /*!< 0xFF000000 */
#define HSP_HWCFGR2_CROM_SIZE          HSP_HWCFGR2_CROM_SIZE_Msk                  /*!< CROM_SIZE[7:0] bits (CROM Size) */
#define HSP_HWCFGR2_CROM_SIZE_0        (0x001UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x01000000 */
#define HSP_HWCFGR2_CROM_SIZE_1        (0x002UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x02000000 */
#define HSP_HWCFGR2_CROM_SIZE_2        (0x004UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x04000000 */
#define HSP_HWCFGR2_CROM_SIZE_3        (0x008UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x08000000 */
#define HSP_HWCFGR2_CROM_SIZE_4        (0x010UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x10000000 */
#define HSP_HWCFGR2_CROM_SIZE_5        (0x020UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x20000000 */
#define HSP_HWCFGR2_CROM_SIZE_6        (0x040UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x40000000 */
#define HSP_HWCFGR2_CROM_SIZE_7        (0x080UL << HSP_HWCFGR2_CROM_SIZE_Pos)     /*!< 0x80000000 */

