stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3b5xx.h
/********************  Bit definition for RCC_AHB2SLPENR2 register  **************/
#define RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Pos   (4U)
#define RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Msk   (0x1UL << RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Pos)  /*!< 0x00000010 */
#define RCC_AHB2SLPENR2_OCTOSPI1SLPEN       RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Msk             /*!< OCTOSPI1 Sleep Mode Enable */

/********************  Bit definition for RCC_AHB1SLPENR2 register  **************/
#define RCC_AHB1SLPENR2_PWRSLPEN_Pos        (2U)
#define RCC_AHB1SLPENR2_PWRSLPEN_Msk        (0x1UL << RCC_AHB1SLPENR2_PWRSLPEN_Pos)       /*!< 0x00000004 */
#define RCC_AHB1SLPENR2_PWRSLPEN            RCC_AHB1SLPENR2_PWRSLPEN_Msk                  /*!< PWR Sleep Mode Enable */

/********************  Bit definition for RCC_APB1SLPENR1 register  **************/
#define RCC_APB1SLPENR1_TIM2SLPEN_Pos       (0U)
#define RCC_APB1SLPENR1_TIM2SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM2SLPEN_Pos)      /*!< 0x00000001 */
#define RCC_APB1SLPENR1_TIM2SLPEN           RCC_APB1SLPENR1_TIM2SLPEN_Msk                 /*!< TIM2 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM3SLPEN_Pos       (1U)
#define RCC_APB1SLPENR1_TIM3SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM3SLPEN_Pos)      /*!< 0x00000002 */
#define RCC_APB1SLPENR1_TIM3SLPEN           RCC_APB1SLPENR1_TIM3SLPEN_Msk                 /*!< TIM3 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM4SLPEN_Pos       (2U)
#define RCC_APB1SLPENR1_TIM4SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM4SLPEN_Pos)      /*!< 0x00000004 */
#define RCC_APB1SLPENR1_TIM4SLPEN           RCC_APB1SLPENR1_TIM4SLPEN_Msk                 /*!< TIM4 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM6SLPEN_Pos       (4U)
#define RCC_APB1SLPENR1_TIM6SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM6SLPEN_Pos)      /*!< 0x00000010 */
#define RCC_APB1SLPENR1_TIM6SLPEN           RCC_APB1SLPENR1_TIM6SLPEN_Msk                 /*!< TIM6 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM7SLPEN_Pos       (5U)
#define RCC_APB1SLPENR1_TIM7SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM7SLPEN_Pos)      /*!< 0x00000020 */
#define RCC_APB1SLPENR1_TIM7SLPEN           RCC_APB1SLPENR1_TIM7SLPEN_Msk                 /*!< TIM7 Sleep Mode Enable */
#define RCC_APB1SLPENR1_SPI3SLPEN_Pos       (8U)
#define RCC_APB1SLPENR1_SPI3SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_SPI3SLPEN_Pos)      /*!< 0x00000100 */
#define RCC_APB1SLPENR1_SPI3SLPEN           RCC_APB1SLPENR1_SPI3SLPEN_Msk                 /*!< SPI3 Sleep Mode Enable */
#define RCC_APB1SLPENR1_SPI4SLPEN_Pos       (9U)
#define RCC_APB1SLPENR1_SPI4SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_SPI4SLPEN_Pos)      /*!< 0x00000200 */
#define RCC_APB1SLPENR1_SPI4SLPEN           RCC_APB1SLPENR1_SPI4SLPEN_Msk                 /*!< SPI4  Sleep Mode Enable */
#define RCC_APB1SLPENR1_WWDGSLPEN_Pos       (11U)
#define RCC_APB1SLPENR1_WWDGSLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_WWDGSLPEN_Pos)      /*!< 0x00000800 */
#define RCC_APB1SLPENR1_WWDGSLPEN           RCC_APB1SLPENR1_WWDGSLPEN_Msk                 /*!< WWDG Sleep Mode Enable */
#define RCC_APB1SLPENR1_SPI2SLPEN_Pos       (14U)
#define RCC_APB1SLPENR1_SPI2SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_SPI2SLPEN_Pos)      /*!< 0x00004000 */
#define RCC_APB1SLPENR1_SPI2SLPEN           RCC_APB1SLPENR1_SPI2SLPEN_Msk                 /*!< SPI2 Sleep Mode Enable */
#define RCC_APB1SLPENR1_USART2SLPEN_Pos     (17U)
#define RCC_APB1SLPENR1_USART2SLPEN_Msk     (0x1UL << RCC_APB1SLPENR1_USART2SLPEN_Pos)    /*!< 0x00020000 */
#define RCC_APB1SLPENR1_USART2SLPEN         RCC_APB1SLPENR1_USART2SLPEN_Msk               /*!< USART2 Sleep Mode Enable */
#define RCC_APB1SLPENR1_USART3SLPEN_Pos     (18U)
#define RCC_APB1SLPENR1_USART3SLPEN_Msk     (0x1UL << RCC_APB1SLPENR1_USART3SLPEN_Pos)    /*!< 0x00040000 */
#define RCC_APB1SLPENR1_USART3SLPEN         RCC_APB1SLPENR1_USART3SLPEN_Msk               /*!< USART3 Sleep Mode Enable */
#define RCC_APB1SLPENR1_UART4SLPEN_Pos      (19U)
#define RCC_APB1SLPENR1_UART4SLPEN_Msk      (0x1UL << RCC_APB1SLPENR1_UART4SLPEN_Pos)     /*!< 0x00080000 */
#define RCC_APB1SLPENR1_UART4SLPEN          RCC_APB1SLPENR1_UART4SLPEN_Msk                /*!< UART4 Sleep Mode Enable */
#define RCC_APB1SLPENR1_UART5SLPEN_Pos      (20U)
#define RCC_APB1SLPENR1_UART5SLPEN_Msk      (0x1UL << RCC_APB1SLPENR1_UART5SLPEN_Pos)     /*!< 0x00100000 */
#define RCC_APB1SLPENR1_UART5SLPEN          RCC_APB1SLPENR1_UART5SLPEN_Msk                /*!< UART5 Sleep Mode Enable */
#define RCC_APB1SLPENR1_I2C1SLPEN_Pos       (21U)
#define RCC_APB1SLPENR1_I2C1SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_I2C1SLPEN_Pos)      /*!< 0x00200000 */
#define RCC_APB1SLPENR1_I2C1SLPEN           RCC_APB1SLPENR1_I2C1SLPEN_Msk                 /*!< I2C1 Sleep Mode Enable */
#define RCC_APB1SLPENR1_I2C2SLPEN_Pos       (22U)
#define RCC_APB1SLPENR1_I2C2SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_I2C2SLPEN_Pos)      /*!< 0x00400000 */
#define RCC_APB1SLPENR1_I2C2SLPEN           RCC_APB1SLPENR1_I2C2SLPEN_Msk                 /*!< I2C2 Sleep Mode Enable */
#define RCC_APB1SLPENR1_I3C1SLPEN_Pos       (23U)
#define RCC_APB1SLPENR1_I3C1SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_I3C1SLPEN_Pos)      /*!< 0x00800000 */
#define RCC_APB1SLPENR1_I3C1SLPEN           RCC_APB1SLPENR1_I3C1SLPEN_Msk                 /*!< I3C1 Sleep Mode Enable  */
#define RCC_APB1SLPENR1_CRSSLPEN_Pos        (24U)
#define RCC_APB1SLPENR1_CRSSLPEN_Msk        (0x1UL << RCC_APB1SLPENR1_CRSSLPEN_Pos)       /*!< 0x01000000 */
#define RCC_APB1SLPENR1_CRSSLPEN            RCC_APB1SLPENR1_CRSSLPEN_Msk                  /*!< CRS Sleep Mode Enable */
#define RCC_APB1SLPENR1_OPAMPSLPEN_Pos      (28U)
#define RCC_APB1SLPENR1_OPAMPSLPEN_Msk      (0x1UL << RCC_APB1SLPENR1_OPAMPSLPEN_Pos)     /*!< 0x100000000 */
#define RCC_APB1SLPENR1_OPAMPSLPEN          RCC_APB1SLPENR1_OPAMPSLPEN_Msk                /*!< OPAMP Sleep Mode Enable */
#define RCC_APB1SLPENR1_VREFSLPEN_Pos       (29U)
#define RCC_APB1SLPENR1_VREFSLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_VREFSLPEN_Pos)      /*!< 0x200000000 */
#define RCC_APB1SLPENR1_VREFSLPEN           RCC_APB1SLPENR1_VREFSLPEN_Msk                 /*!< VREFBUF Sleep Mode Enable */
#define RCC_APB1SLPENR1_RTCAPBSLPEN_Pos     (30U)
#define RCC_APB1SLPENR1_RTCAPBSLPEN_Msk     (0x1UL << RCC_APB1SLPENR1_RTCAPBSLPEN_Pos)    /*!< 0x400000000 */
#define RCC_APB1SLPENR1_RTCAPBSLPEN         RCC_APB1SLPENR1_RTCAPBSLPEN_Msk               /*!< RTCAPB Sleep Mode Enable */

